[
  {
    "url": "https://ekstrabladet.dk/musik/dkmusiknyt/lisa-nilsson-jeg-har-vaeret-alene-i-11-aar/10979204",
    "title": "Lisa Nilsson : Jeg har været alene i 11 år",
    "text": "- Ingen synger om at vælge ensomheden. Specielt ikke kvinder, siger Lisa Nilsson. Men hun gør. Den svenske sangerindes aktuelle album, 'Uteblivna vi', kredser ikke mindst om hendes ensomhed, og den styrke Lisa Nilsson har fundet ved at turde være sårbar: - Jeg har levet alene i 11 år nu. Jeg har haft behov for at være alene for at gå igennem et frihedsopgør med min fortid. Det havde jeg ikke kunne klare med en partner. - Men en dag inden jeg dør, håber jeg, at jeg kan blive et tillidsfuldt menneske, der kan få et sundt og ukompliceret forhold til nogen. Men jeg er der ikke helt endnu, forklarer hun. Forliste forhold Lisa Nilsson sidder på et hotel i Helsingborg før en koncert i byens koncerthus. Hun er god til at tale dansk, men hun leder forgæves efter et dansk ord for 'uteblivna'. Det er noget med forladt, udenfor og udeblevet. Men det stikker dybere end det, siger hun: - Det er et symbol på alle mine forliste forhold. Jeg er gået ind i kæmpestor kærlighed, men det har ikke fungeret. Sådan er mit liv. Men det er altid mig, der går. - Det er en misforståelse om mig og mit gamle repertoire, at jeg er alene, fordi alle mændene forlader mig. Jeg er blevet elsket rigtig meget. Og jeg har også elsket. Men jeg mister forelskelsen, eller bliver forelsket på den forkerte måde, og så må jeg videre. Sådan er det. Dårlig samvittighed Lisa Nilsson, der er 55 år, var gift med musikeren Henrik Janson fra 1998 til 2002. Hun har to teenagedøtre med en anden musiker, Niklas Medin, som hun forlod i 2015: - For mig har det været nemmere at være skilt. Og mere bekvemt. Der er fars uge og mors uge. Og når far har sin uge med børnene, er jeg fri. - Så kan jeg planlægge kreativitet, fordi jeg ved, at der ikke kommer et barn og forstyrrer mig, fordi hun har slået knæet. Men jeg kan godt få lidt dårlig samvittighed over at have det sådan. Titelnummeret på 'Uteblivna vi' indeholder linjerne 'Kærlighed er for dem, der kan blive/Dem, der ikke blev som mig'. - Jeg udstiller min ensomhed, men jeg syntes, det var vigtigt, at jeg ikke gemmer mig. Det er vigtigt at vise, at det er svært. Også selvom det er et meget bevidst valg, at jeg lever alene. - Det er et voksent valg. En ofring. Det er smertefuldt, men jeg er forsonet med det. Det er prisen for min frihed. Den koster. --------- SPLIT ELEMENT --------- Champagne gør mig kreativ På 'Uteblivna vi' er der en tragikomisk sang med titlen 'Försökte tycka om dig'. I sangen går Lisa Nilsson på druk som en reaktion på sin uspændende mand. - Jeg elsker champagne! udbryder hun begejstret og slår en latter op. - Nogle gange synes jeg, at alkohol fylder lidt for meget i mit liv, men det er ikke et problem. Jeg holder øje med det. Det er jeg meget bevidst om. Sådan vil jeg sige det. Drikker alene Lisa Nilsson er meget aktiv på sociale medier, hvor hun ofte poster billeder af glas med bobler: - Jeg nyder det rigtigt meget. Også alene! I Sverige er det ikke anset, at man har en flaske derhjemme, når man er alene. Det er en selskabsdrik i Sverige. 'Fuck det!' siger jeg bare. Jeg synes, det er en alenedrik! - Jeg elsker at tage i sommerhus et par dage, hvis jeg ved, jeg har en god flaske champagne i køleskabet og ikke rigtigt skal noget. Jeg nyder et glas her og der. Jeg kan tåle det, og jeg bliver kreativ af det. Det har jeg arvet fra min far. Lisa Nilssons far, Gösta Nilsson, er jazzpianist, og hendes afdøde mor, læreren Birgit Bokö, elskede musik og havde en stor vinylsamling: - Jeg er opvokset i en kunstnerfamilie, hvor vin var en hverdagsting. Jeg har set så mange blandt mine forældres venner og mine venner, der har et alkoholmisbrug, der gør dem ligeglade. Blaserte. De har intet behov for at opfinde noget nyt. En vild hjerne Det behov har Lisa Nilsson. Efter 12 års pladepause er 'Uteblivna vi' et album, der hellere vil drikke med Cornelis Vreeswijk end danse til 'Himlen runt hörnet': - Når mænd skriver om alkohol, bliver det romantiseret. Hvis en kvinde skriver om det, så har man problemer og dårlig karakter. - Men jeg er altså også en fri kunstner! Jeg har også en vild hjerne! Jeg er også fuldstændig grænseløs! Jeg har også et kæmpestort behov for at blive bekræftet. Jeg er jo som dem. - Men jeg er kvinde. Så jeg er nødt til at være alt det der, men jeg skal også være mor. Og jeg skal også være konstruktiv, og jeg skal vaske op, betale regninger, sende børnene i skole og bage boller. Lisa Nilssons opskrift på at lykkes med det hele er fem timers søvn. Og et godt glas champagne. Læs første del af Ekstra Bladets interview med Lisa Nilsson her",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:16.969556+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/musik/dkmusiknyt/lisa-nilsson-jeg-har-vaeret-alene-i-11-aar/10979204",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8d5398a906832899021a20b16f8bc186",
    "processed_at": "2025-10-19T23:54:36.385109",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article focuses on the personal experiences and reflections of Swedish singer Lisa Nilsson regarding her loneliness, relationships, and creativity, with no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/underholdning/filmogtv/julia-sofia-aastrup-vender-tilbage-paa-skaermen-offline-de-naeste-mange-uger/10981677",
    "title": "Julia Sofia Aastrup vender tilbage på skærmen :  Offline de næste mange uger  ",
    "text": "Influencer og tv-personlighed Julia Sofia Aastrup bevæger sig snart ud på det, hun selv beskriver som sin 'hidtil største rejse'. Sammen med sin lillesøster Ida Imilia Aastrup skal hun nemlig medvirke i et tv-program. Det skriver de to søstre i et fælles opslag på Instagram. 'Vi ses til december, Friends!,' starter de opslaget. 'Vi kan ikke sige så meget - faktisk nærmest ingenting. Men sikkert er det, at vi tager afsted nu, og vi kommer til at være helt offline de næste mange uger,' lyder det videre fra søstrene. Opslaget slutter med en lille teaser for, at man kommer til at kunne følge hele eventyret på tv næste år. I ægte influencer-stil lover de to søstre selvfølgelig, at der stadig vil være gang i deres sociale medier, da de har 'pre-filmet' content, som bliver lagt ud undervejs. Tidligere har Julia Sofia Aastrup medvirket i tv-programmer som blandt andet 'Vild med dans', 'Over Atlanten' og '24 stjernes julekalender'. Meldingen fra Julia Sofia Aastrup kommer blot en måneds tid efter, at TV 2 meldte ud, at der kommer endnu en sæson af rejseprogrammet 'Først til verdens ende'. Ifølge Her og Nu er der tale om en kendis-sæson, hvor det bliver kendte, der skal medvirke i programmet, hvor det handler om at komme først til en ukendt slutdestination i verden kun ved at rejse til lands og til vands. Om det er det program, som Julia Sofia Aastrup og Ida Imilia Aastrup skal medvirke i er uvist.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:17.053278+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/underholdning/filmogtv/julia-sofia-aastrup-vender-tilbage-paa-skaermen-offline-de-naeste-mange-uger/10981677",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "bb9d17a648867c1507a3d016a39706cf",
    "processed_at": "2025-10-19T23:54:36.385247",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a television personality and her upcoming participation in a TV program, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/underholdning/dkkendte/dennis-knudsen-vil-giftes-med-rig-og-meget-gammel-person-jeg-er-ikke-pengedesperat/10982019",
    "title": "Dennis Knudsen vil giftes med rig og meget gammel person : - Jeg er ikke pengedesperat",
    "text": "Dennis Knudsen har prøvet det før. At folk bliver provokeret af det, han siger eller gør. Og nu er den gal igen. Således er kendisfrisøren hen over weekenden røget i massiv modvind, efter at han på Instagram lagde en video op, hvori han fortalte, at han var på udkig efter en 'meget gammel' mand eller kvinde, som han kunne gifte sig med, således han kunne arve deres penge. For det er - som Dennis Knudsen siger i videoen - dyrt at have børn, og han har fået sine sent. Til Ekstra Bladet understreger Knudsen, at han forstår kritikken, som hans opslag er blevet mødt med, ligesom han også uddyber, hvad han præcist mener. - Jeg er alenefar til tre, og jeg fik mine børn sent. Så jeg vil gerne være sammen med dem så meget, at det svarer til, hvis jeg havde fået dem tidligere i livet. Men jeg vil også gerne på pension på et tidspunkt – og hvis jeg skal det, så kræver det, at jeg arbejder rigtig meget og hårdt. Det tager jo tid væk fra mine børn, lyder det fra Dennis Knudsen, der samtidig understreger, at han altså ikke er 'pengedesperat'. - Det er vigtigt at sige, at jeg altså ikke er pengedesperat. Jeg lever et godt liv, bor i en villa til 12 millioner kroner og mangler ikke noget. Og så er jeg faktisk rigtig god til at være sammen med ældre mennesker – jeg nyder deres selskab. Jeg havde jo Lise Nørgaard som kunde i mange år, som han siger, og tilføjer, at han da nok godt ville kunne overleve i mindre. - Hvis jeg boede i en lille lejlighed langt ude på landet, kunne jeg nok overleve sammen med mine børn uden at arbejde mere. Men jeg ved jo, man skal arbejde hårdt for at have råd til et godt liv, og jeg har knoklet for at have mange penge i dag. Jeg vil gerne give mine børn mulighed for at opleve verden, og det kan jeg nogle år endnu – men ikke i længden, hvis jeg ikke bliver gift med én og dermed økonomisk sikret, siger Dennis Knudsen, inden han slår fast, at han godt kan se, at det lyder både koldt og kynisk. Artiklen fortsætter under billedet ... Rart med flere penge på kontoen Det var en video på Instagram, at Dennis Knudsen for nylig annoncerede, at han gerne ville giftes med en ældre person. Videoen har fået flere hundrede kommentarer, hvoraf flere af dem er negative. Blandt andet bliver det kaldt for både 'pinligt' og 'skamligt'. - Det her opslag er faktisk meget personligt for mig at lave, men det har også en alvor i sig. Og det har det, fordi det ikke har været nogen hemmelighed, at jeg har gået og råbt højt til bladene, at jeg godt kunne tænke mig at blive gift med en meget gammel mand eller kvinde, siger Knudsen i videoen, hvori han uddyber, at han ønsker pengene, som han slår fast, at han egentlig ikke mangler, fordi han har fundet ud af, at det er dyrt at have tre børn - og det bliver ikke billigere i takt med at de bliver ældre. - I takt med at mine børn bliver større, bliver de også dyrere, og jeg bliver jo ældre og ældre og skal på pension, så det ville da være dejligt at have nogle penge på bankkontoen, og dem kunne måske den ældre person, jeg søgte, måske være med til at bidrage til, lyder det fra Dennis Knudsen i videoen. Artiklen fortsætter under billedet ... Ikke kun for pengene Det er dog ikke kun for pengene, at Knudsen ønsker en relation, lader han forstå. - Jeg gør det også, fordi jeg gerne vil bruge min tid og energi på den, jeg gifter mig med. Det skal være en, som søger selskab, omsorg og kærlighed – og som gerne vil tages af. Så kunne jeg pleje personen, tage vedkommende med på ferie med mine børn og lave hår og makeup ude på plejehjemmet til glæde for alle. Jeg kunne faktisk godt finde på at lave en hel charity-organisation for ældre skønhed. Det ville jeg synes var sjovt og spændende, siger han til Ekstra Bladet, hvortil han tilføjer, at han da, hvis han havde overskud og kræfter til det, gerne ville være omsorgsperson for en ældre. - Hvis jeg havde tid og kræfter til at være omsorgsperson for ældre, så havde jeg gjort det. Men det har jeg ikke, når jeg er alenefar til tre små børn. Hvis en ældre person så kan købe sig til den ydelse, så jeg kan droppe mit andet arbejde, så kunne det teknisk set lade sig gøre, siger han.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:17.174847+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/underholdning/dkkendte/dennis-knudsen-vil-giftes-med-rig-og-meget-gammel-person-jeg-er-ikke-pengedesperat/10982019",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9b17efc88758aba2ca90b4864437daf7",
    "processed_at": "2025-10-19T23:54:36.385390",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Dennis Knudsen's personal life and his controversial statements about seeking a wealthy older partner for financial security. It does not mention or relate to artificial intelligence in any way.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/nyheder/Udland/smaragd-halskaede-fra-napoleons-anden-hustru-var-blandt-stjaalne-genstande/10982030",
    "title": "Smaragd - halskæde fra Napoleons anden hustru var blandt stjålne genstande",
    "text": "Det franske kulturministerium har offentliggjort en liste over de otte genstande, der søndag blev stjålet fra kunstmuseet Louvre i den franske hovedstad, Paris. Det skriver nyhedsbureauet AFP. Ifølge ministeriet er der tale om otte smykker, herunder en halskæde med smaragder og diamanter, som Napoleon gav sin anden hustru, Marie-Louise af Østrig, som han blev gift med i 1810. Det franske medie Le Figaro fortæller, at de øvrige smykker på listen er diademer, der har tilhørt dronningerne Marie-Amelie og Hortense. Blandt de stjålne smykker er også andre halskæder, øreringe og brocher, der har tilhørt de franske dronninger. Politiet leder efter fire mistænkte i forbindelse med tyveriet, oplyser den franske anklagemyndighed. - To højsikkerhedsmontrer var målet, og otte genstande af uvurderlig kulturarv blev stjålet, skriver ministeriet i en udtalelse. En niende genstand blev efter tyveriet fundet nær Louvre. Der var tale om kejserinde Eugénies krone. Hun var gift med Napoleon III. Under tyveriet trængte tyvene sig ind i rummet Gallerie d'Apollon på museets første sal, hvor de stjal genstandene fra udstillingsmontrerne. Tyvene ankom til Louvre på scootere omkring klokken 09.30 søndag. De brugte en møbelkran og vinkelslibere til at komme ind i rummet, hvor blandt andet flere af de franske kronjuveler er udstillet. Det tog dem omkring fire minutter at få adgang til de to udstillingsmontrer, hvorefter de tog flugten på scootere. Museet, som har udstillinger fordelt på næsten 73.000 kvadratmeter, blev oprindeligt bygget som et palads til den franske kongefamilie i 1546. I 1682 blev kongeresidensen flyttet til Versailles, og Louvre anvendtes derefter som kongeligt kunstkammer. I 1793 åbnede det som offentligt tilgængeligt nationalt kunstmuseum.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:17.292941+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/Udland/smaragd-halskaede-fra-napoleons-anden-hustru-var-blandt-stjaalne-genstande/10982030",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d534364c8219729dfef2e30668f75e39",
    "processed_at": "2025-10-19T23:54:36.385478",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a theft of jewelry from the Louvre Museum and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/forbrug/Teknologi/ai-invasion-i-kommunerne-man-skal-ikke-lade-sig-rive-med/10974915",
    "title": "AI - invasion i kommunerne : - Man skal ikke lade sig rive med",
    "text": "AI-invasion i kommunerne: - Man skal ikke lade sig rive med Ekstra Bladet har spurgt landets fem største kommuner ind til deres medarbejderes brug af AI-chatbots. Ifølge to eksperter er det ikke uden risici, når kommunerne gør brug af den fremtrædende teknologi Annonce: ChatGPT, Copilot, Gemini, Grok, Claude. Listen over chatbots er lang, og i flere af landets største kommuner har den nye teknologi for alvor gjort sit indtog. Ekstra Bladet har således spurgt de fem største af slagsen; København, Aarhus, Odense, Aalborg og Vejle, om deres brug af AI i den offentlige forvaltning, og resultatet kan give anledning til panderynker, hvis man spørger to af landets fremtrædende eksperter på området. - Det er potentielt en hjælp, men det er potentielt også en kilde til forkerte informationer, siger Thomas Hildebrandt, der er professor ved datalogisk institut på Københavns Universitet. Alle på nær Odense Kommune har svaret på avisens henvendelse inden for deadline. Artiklen fortsætter under faktaboksen ... Hvad er generativ AI? Traditionel kunstig intelligens analyserer typisk data for at finde mønstre, mens generativ AI undersøger den grundlæggende struktur bag dataene og bruger avanceret maskinel indlæring til at generere nyt indhold. Det kan eksempelvis være tekst, billeder og videoer. Når du bruger chatbots som ChatGPT eller Gemini, bruger du en sprogmodel, der er baseret på generativ AI. En sprogmodel er en slags kunstig intelligens, der er trænet på enorme mængder tekst og derfor kan forstå og skrive sprog, som minder om et menneske. Annonce: Én chatbot dominerer I Vejle, Aalborg og Aarhus har alle medarbejdere adgang til Microsofts Copilot-chatbot, mens sidstnævnte kommune ligeledes oplyser, at medarbejderne også bruger ChatGPT og 'andre former for generative AI-værktøjer'. 'Vi har ikke ekskluderet nogle former for AI-værktøjer med undtagelse af DeepSeek,' lyder det i et skriftligt svar fra Aarhus Kommune. I Københavns Kommune bruger man hverken Copilot eller ChatGPT. Man har i stedet udviklet sin en generative chatløsning ved navn K-AI. I Aarhus opfordrer de også medarbejderne til at bruge 'AarhusAI', der er kommunens nye generative AI-løsning. Ifølge Kasper Trolle Elmholdt, der er lektor og forsker i AI og organisation ved Aalborg Universitet, mangler vi specifikke tal på, i hvor stort omfang generativ AI bliver brugt i kommunerne, hvilket gør, at der formentlig er nogle skyggetal på området, vi ikke har kendskab til. - Men jeg tror, det er rimeligt at sige, at det bliver brugt mere i kommunerne i dag, end for et år siden, siger han til Ekstra Bladet. Ifølge Thomas Hildebrandt er det i særdeleshed én chatbot, der bliver brugt i kommunerne. Annonce: - Jeg tror stadig, Microsofts Copilot sidder rimelig tungt på det i kommunerne, lyder det. Artiklen fortsætter under faktaboksen ... Det svarede kommunerne Ekstra Bladet har stillet Københavns Kommune, Aarhus Kommune, Aalborg Kommune, Odense Kommune og Vejle Kommune de samme tre spørgsmål. Alle på nær Odense Kommune svarede inden for avisens deadline. I hvilket omfang bruger jeres medarbejdere generative AI-værktøjer? Københavns Kommune: Københavns Kommune har ikke anskaffet licenser til hverken Microsoft Copilot eller ChatGPT. Kommunen har egenudviklet en generativ chatløsning ved navn K-AI. Formålet er at give medarbejderne et sikkert alternativ til at arbejde med generativ AI på en platform, hvor der er styr på datasikkerheden. K-AI giver medarbejderne mulighed for at chatte med en stor sprogmodel. I øjeblikket bruger vi OpenAI’s GPT-4o, men arbejder på, at også andre sprogmodeller kan anvendes, herunder Open Source-sprogmodeller. Aarhus Kommune: Medarbejdere i Aarhus Kommune anvender både Copilot i Edge, ikke at forveksle med Copilot M365 som vi ikke anvender i Aarhus Kommune, samt ChatGPT og andre former for generative AI værktøjer. Vi har ikke ekskluderet nogle former for AI-værktøjer med undtagelse af DeepSeek. I forbindelse med lancering af Aarhus Kommunes egen generative AI-løsning 'AarhusAI' er alle medarbejdere blevet opfordret til at afprøve og anvende netop denne generative AI-løsning. Aalborg Kommune: I Aalborg Kommune har alle brugere med M365 brugerlicenser adgang til at anvende Microsoft Copilot Chat. De kan både bruge chatbotten, og de kan oprette personlige AI agenter. Vi har ikke konkrete målinger på omfanget af brugen. Vi har også medarbejdere, som anvender Copilot Studio til at udvikle AI agenter. Vejle Kommune: I Vejle Kommune er der adgang til Copilot. Derudover er der implementeret en række interne GenAI-værktøjer, herunder: En intern chatbot (Bertha) på intranettet En generel AI-platform til at udvikle specialiserede AI-assistenter til forskellige fagområder Borgervendte AI-voicebots på Ressourcecentret (affaldshåndtering) samt internt i IT-afdelingens Support En AI-løsning, \"RoboRef\", der genererer referatudkast fra fysiske møder Hvad bruger medarbejderne AI-værktøjerne til? Københavns Kommune: Medarbejderne har mulighed for bl.a. at bruge K-AI til at skrive tekster, få sparring, brainstorme, analysere, oversætte, opsummere eller tilpasse tekster til en bestemt målgruppe. Aarhus Kommune: Vores medarbejdere anvender bl.a. generative AI-værktøjer til udkast til kommunikation, opsummering af et langt dokument, mødeforberedelse, idéudvikling, tekstformuleringer, korrektur og andre administrative opgaver. Derudover arbejder vi løbende på at tilpasse AI-assistenter, der kan bidrage til arbejdsopgaver, der er en del af en større gruppe medarbejderes hverdag, såsom hjælp til at skrive stillingsopslag og ajourføring med lovgivning inden for eksempelvis GDPR. Aalborg Kommune: Vores brug er ikke anderledes end i de andre kommuner. Det kan være udkast, inspiration og korrektur til tekster, fx notater, mails, oplæg og rapporter. Sparring og idéudvikling i det daglige arbejde og i projekter. Vejle Kommune: AI og forskellige AI-assistenter anvendes hovedsageligt til at finde information og interne dokumenter samt til sproglig gennemgang af tekster, herunder grammatik og korrektur. Desuden anvendes AI-voicebot til opgaver som omstilling til specifikke afdelinger eller hurtige besvarelser af spørgsmål. RoboRef benyttes til at generere et udkast til referat fra fysiske møder, både interne møder og for eksempel borgervendte møder i Jobcenteret. Der gennemføres undervisning af medarbejdere og ledere i brugen af løsningerne. Har I en politik/retningslinjer for medarbejdernes brug af generativ AI? Københavns Kommune: Vi har interne retningslinjer for brugen af generativ AI, som opridser, hvad medarbejderne skal være særligt opmærksomme på i brugen af AI. Det omfatter bl.a., at det ikke er tilladt at foretage sagsbehandling, træffe afgørelser eller dele fortrolige og følsomme personoplysninger med AI eller benytte det til behandling af borgeres personoplysninger. Derudover er et af de væsentlige elementer, at medarbejderne generelt skal forholde sig kritisk til brugen. Aarhus Kommune: I sit svar til Ekstra Bladet har Aarhus Kommune vedhæftet et dokument med syv retningslinjer, som medarbejderne skal overholde. Her er overskrifterne på de syv punkter: Personoplysninger - Nej tak Indtast kun information, du kan snakke med en kollega om i bussen eller lægge på aarhus.dk Vær opmærksom på bias og hallucinationer Hav et kritisk tænkende menneske i loopet Hvem har ophavsretten til det, du lægger ind i en chatbot? Hvis du er i tvivl - undlad! Åbenhed om brugen Aalborg Kommune: Ja, vi har retningslinjer for medarbejdernes brug af generativ AI. Vores retningslinjer er restriktive, teknologispecifikke (Copilot) og bærer præg af et bredt forsigtighedsprincip – hvilket reelt er legitimt nok, da fokus har været på at minimere risiko, og at beskytte både medarbejdere og borgere/virksomheder. Elementer er fx: Microsoft Copilot Chat er godkendt generativ AI løsning i Aalborg Kommune. Skal der benyttes andre generative AI løsninger skal der foretages it-arkitekturvurdering, foretages en databeskyttelsesretlig vurdering, herunder bl.a. eventuel indgåelse af databehandleraftale, gennemførelse af risikovurdering ift. de registrerede og eventuelt også udarbejdelse af konsekvensanalyse, samt en nærlæsning af leverandørens privatlivspolitik og vilkår. Tast ikke (eller upload) personoplysninger ind. Hverken offentlige, almindelige, fortrolige eller følsomme personoplysninger. Tast ikke (eller upload) forretningskritiske informationer ind. Guides til hvad man må, info om hallucinationer, info om prompting, opfordre til kritisk tænkning (ansvar), henvisning til KL’s guide om brug af generativ AI, oplysning om Copilot som godkendt løsning i Aalborg Kommune, m.m. Vejle Kommune: Ja, vi har både retningslinjer og vejledningsmateriale til brug af GenAI i organisationen. De væsentligste elementer er.: Beskyt - Pas på følsomme og fortrolige data, og undersøg om den pågældende løsning må behandle disse data ud fra vores AI-dataklassifikationsdiagram. Etik og moral - Anvend ikke GenAI til automatiserede afgørelser, vurderinger eller beslutninger. Vær kritisk - Opmærksomhed på at GenAI kan give upræcise eller forkerte svar. Medarbejderne skal altid sikre fagligheden i det materiale, der produceres. Bliver revet med Alle fem kommuner oplyser til Ekstra Bladet, at de blandt andet bruger chatbots til opgaver som korrektur, idéudvikling og sparring. 'Vores brug er ikke anderledes end i de andre kommuner. Det kan være udkast, inspiration og korrektur til tekster, for eksempel notater, mails, oplæg og rapporter. Sparring og idéudvikling i det daglige arbejde og i projekter,' skriver Aalborg Kommune blandt andet i et svar til Ekstra Bladet. - Når Copilot kommer ind og tilbyder sparring, skal man som kommunal medarbejder passe på, at man ikke lader sig rive med. En ting er at komme med forslag til tekster, en anden ting er at lave en analyse af en tekst. Hvis man ikke selv har læst teksten, kan man ikke tjekke, om den her generative AI har fundet på nogle ting undervejs, siger Thomas Hildebrandt og fortsætter: Annonce: - Samtidig er der også det faktum, at AI kommer ind i alle Microsofts produkter, så det kan nogle gange være svært at gennemskue, hvornår man bruger det. Artiklen fortsætter under billedet ... 'En udfordring i en retsstat' Kasper Trolle Elmholdt peger på endnu flere problemer, der kan opstå, når kommunalt ansatte bruger den slags chatbots. - Der er noget fagligt sprogbrug i kommunerne, som godt kan blive udfordret af de her generative modeller, fordi de som regel er designet til at skabe variationer. Så hvis du laver en prompt til ChatGPT to gange, får du to forskellige formuleringer som svar. Det er en udfordring i bestemte opgaver i en retsstat, hvor du skal være sikker på, at det svar, du får, også er det svar, du får næste gang, så der ikke er forskelsbehandling, siger han og fortsætter. Annonce: - Der kan også opstå det, der hedder automatiseringsbias. Altså man får et svar, som stemmer ret godt overens med det, man ville forvente var svaret, så man vælger at stole på den. Det gør man så ad flere omgange og lige så stille opbygger man tillid til den. Så kan det meget vel være, at man ikke lige opdager, når den rent faktisk formulerer noget vrøvl. Kasper Trolle Elmholdt fra Aalborg Universitet forklarer også, at det kan være problematisk at bruge flere af de store tech-virksomheders chatbots, der er gratis tilgængeligt, fordi vi reelt set ikke ved, hvor de data, vi fodrer dem med, ryger hen eller bliver opbevaret. Når der er tale om kommercielle virksomhedsløsninger, er sagen dog en anden. Det er de adspurgte kommuner dog meget bevidste om. 'Det er ikke tilladt for medarbejderne at foretage sagsbehandling, træffe afgørelser eller dele fortrolige og følsomme personoplysninger med AI eller benytte det til behandling af borgeres personoplysninger,' oplyser Københavns Kommune blandt andet til Ekstra Bladet. Annonce: Her kan de gøre en forskel Generelt har de adspurgte kommuner meget omfattende retningslinjer for brugen af generativ AI. Spørgsmålet er selvfølgelig bare, om medarbejderne følger dem, og det er ikke noget, der ligger tal på. - Det ville være mærkeligt, hvis der i den offentlige sektor ikke er medarbejdere, der nogle gange burger det til ting, som er lidt imod retningslinjerne alene af den grund, at vi stadig er ved at lære, hvad vi kan bruge teknologierne til. Men vi har ikke ordentligt data på det, siger lektor og forsker i AI og organisation Kasper Trolle Elmholdt. - Er de her chatbots overhovedet en hjælp i det kommunale arbejde? - Det afhænger af hvilke opgaver man bruger teknologien til. Det er potentielt en hjælp, men det er potentielt også en kilde til forkerte informationer. Det kommer an på om medarbejderne lærer at håndtere den generative AI’s uundgåelige tendens til at finde på ting, siger Thomas Hildebrandt fra datalogisk institut på Københavns Universitet. Kasper Trolle Elmholdt er dog sikker på, der er områder, hvor man i kommunerne kan hente noget ved at bruge generativ AI. Annonce: - For eksempel når det kommer til referater eller resumeer, der ofte bliver øjet igennem af enkelte personer, der læser det igennem, efter en skretær eller referent har siddet og lavet det. Det kunne man forestille sig kunne gøres ret effektivt af en AI. Så er det måske stadig en sekretær, der sidder og tjekker det, men de bruger altså ikke timer på at skrive et referat. På samme måde med stillingsopslag for eksempel.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:53:17.746919+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/forbrug/Teknologi/ai-invasion-i-kommunerne-man-skal-ikke-lade-sig-rive-med/10974915",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0de3a1a10b90da14924941a655f9e421",
    "processed_at": "2025-10-19T23:54:36.385682",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Language Models and NLP",
      "explanation": "OpenAI: The article extensively discusses the use of AI chatbots in municipal administrations, detailing their applications, risks, and the opinions of experts on generative AI technologies. It focuses on specific AI tools like ChatGPT and Microsoft Copilot, indicating a strong emphasis on AI-related topics.",
      "keywords": [
        "AI",
        "chatbots",
        "generative AI",
        "Microsoft Copilot",
        "ChatGPT",
        "municipalities",
        "data security",
        "language models"
      ]
    }
  },
  {
    "url": "https://www.bbc.com/sport/cricket/articles/cdjrdepjx39o",
    "title": "Women World Cup 2025 : England advance to semis with most important win of Charlotte Edwards era",
    "text": "England hold nerve for most significant win of Edwards era - Published There have been bumps along the way, but it is starting to feel like England have turned a corner. Earlier this year, in the aftermath of Charlotte Edwards' appointment as head coach, a poor West Indies were swept aside with ease but it did little to convince fans and media that much had changed since the Ashes embarrassment. Those concerns came to fruition as they were subsequently outplayed by India, and there have been wobbles here at the World Cup - notably the batting collapses in near-misses against Bangladesh and Pakistan. But at Indore, a four-run win over India in front of a deafening, intimidating home crowd, England produced their most significant win of the Edwards/Nat Sciver-Brunt era as they sealed a semi-final spot with two group games remaining. Previously, they had earned a reputation for buckling under pressure. Consider the T20 World Cup last October, where catch after catch was spilled in a shocking group-stage defeat by West Indies. See also a chase of 181 in the second Ashes one-day international in Melbourne, squandered as Amy Jones lost count of how many balls were left in the over. No, this was not a knockout game, and that challenge is still to come. But England were on the brink of defeat, India needing 55 from 52 balls with Smriti Mandhana batting beautifully on 88. Her soft dismissal creaked the door open, gave England an opportunity to seize - and this time, they pounced. From losing games they should win, they are starting to win games they should lose. - Published3 hours ago - Published4 hours ago England did not need to win this game to reach the semis - they play Australia next on Wednesday, who look close to unbeatable, followed by New Zealand where they would be strong favourites. But they did need the victory to prove to themselves they could win games like this. After removing Pratika Rawal and Harleen Deol early, England were faced with one of the most formidable partnerships in Mandhana and Harmanpreet Kaur - and struggled. Their partnership of 125 was a masterclass, Harmanpreet's power combined with Mandhana's finesse. England bowled too wide to the left-handed opener, who scored heavily on the off-side, but the biggest difference between India and England's other opponents so far is they do not fear Sophie Ecclestone. Mandhana was exceptional in sitting deep in the crease and playing the ball late, while Harmanpreet and later Deepti Sharma took the world's number one bowler down the ground. India threw the game away via their own mistakes but England deserve credit for how they closed it out, because until the hosts needed nine from the last ball, victory was never certain. But a notable difference from the past year is that England's body language did not dip. They held their standards - the fielding fumbles did not creep in, they worked as a unit and fought until the last ball. Ecclestone won the battle with Deepti, who slog-swept to Sophia Dunkley. The ball hung high in the air for what felt like an age, the crowd behind Dunkley roaring for it to be put down. It was a straightforward chance, but we have seen England drop a number of similar catches under pressure in recent times. Both Alice Capsey and Emma Lamb also held on to high-stakes chances earlier to dismiss Mandhana and Harmanpreet. Basics, yes - but executing them has not always been the case for this side. This win is an important hurdle to overcome, one which should serve them well with the pressure cooker turning up a notch from now on. Middle-order worries still remain England's batters must have felt a huge relief to be presented with a flat surface in Indore, a contrast to the tricky, turning ones in Guwahati and Colombo. Their match-winning 288 was lit up by Heather Knight's sparkling 109, the century coming from just 86 balls, and that was the difference. England's former skipper kicked on when Mandhana and Harmanpreet could not. Of course, Edwards will be reluctant to change a winning team but there are still issues to be addressed in the batting line-up. Jones' fifty at the top of the order puts a tick in one box, and though the openers negotiated the new ball and added 73 for the first wicket, Tammy Beaumont looks out of sorts. She scratched her way to 22 from 43 balls before being bowled attempting to sweep Deepti, but Knight and Sciver-Brunt steadied the ship as they so often do. The middle order of Dunkley, Lamb and Capsey were gifted a platform from which they could accelerate - something they have not been blessed with in the previous three matches where they have had to try to rescue perilous situations. But they failed to fire once again here. So far in the tournament, they have scored a combined 103 runs in 12 innings at an average of 8.58 and strike-rate of 55. When India were cruising to the total, it looked like England would rue the loss of three wickets for eight runs, but they were grateful their opponents made a far greater mess of their own innings. Still, England march on to the next challenge unbeaten, no less than the mouth-watering prospect of facing their greatest rivals Australia for the first time since the Ashes hammering. Related topics - Published16 August",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:27.761616+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/sport/cricket/articles/cdjrdepjx39o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "56c059f9f49cdb6f427b4c66f77765a7",
    "processed_at": "2025-10-19T23:54:36.385734",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a cricket match and the performance of the England women's cricket team, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cj3zemk2j4ro",
    "title": "  No King protests : where does Democratic resistance go next ? ",
    "text": "After 'No Kings' protests, where does Democratic resistance go next? This weekend's \"No Kings\" demonstrations drew an estimated crowd of millions across the US to protest President Donald Trump's policies and his willingness to push the boundaries of presidential authority. It was a moment for likeminded Democrats, liberals and some anti-Trump Republicans to rally together at a time when the American left has little formal power in national politics. But where do they go from here? By most accounts, the turnout at Saturday's events - in major US cities like Chicago, New York, Washington and Los Angeles, as well as hundreds of smaller towns – was higher than expected and surpassed the first \"No Kings\" rally in June. Congressional Republicans had warned that the demonstrations would be \"anti-American\", and some conservative governors had put their law enforcement and National Guard on alert in case of violence. The massive rallies turned out to be peaceful – a carnival, not carnage. In New York City, there were no protest-related arrests, and the gathering in Washington DC featured families and young children. \"Today all across America in numbers that may eclipse any day of protest in our nation's history, Americans are saying loudly and proudly that we are a free people, we are not a people that can be ruled, our government is not for sale,\" Senator Chris Murphy of Connecticut said in his speech to the Washington DC rally. Just down the street from the No Kings gathering in the nation's capital, the White House responded to the protests with derision. \"Who cares,\" deputy press secretary Abigail Jackson wrote in response to multiple media inquiries about the marches. Trump shared several AI-generated videos on his Truth Social website of him wearing a crown, including one where he was flying a jet that dumped what appeared to be human waste on the protesters. While Republicans may be downplaying the significance of the marches, the scale of the turnout – along with Trump's net negative approval rating in major opinion polls - hints at a Democratic opportunity to rebound from last year's electoral defeats. The party still has a long way to go, however. Polls suggest only a third of Americans view it favourably - the lowest for decades - and Democrats are divided over how to mount an effective opposition to Trump when they no longer control either chamber of Congress. Liberals took to the streets on Saturday for a variety of reasons. Trump's aggressive immigration enforcement, his tariff policies, his government cuts, his foreign policy, his deployment of National Guard in US cities and his norm-breaking use of presidential authority were all frequent topics of concern and outrage. Some of the frustration was also directed at Democratic leaders. \"We're just taking it on the chin, and we're not speaking out,\" one march attendee in Washington DC told NBC News on Saturday. \"You know, I think we need to throw some more elbows. Unfortunately, the high road doesn't work.\" The Democrats have been more combative over the ongoing government shutdown, which is about to enter its fourth week. They have been unwilling to approve a short-term extension of current federal spending without a bipartisan agreement to address health-insurance subsidies for low-income Americans set to expire at the end of the year. Because of Senate parliamentary rules, Democrats have some power despite being in the minority – and, at least so far, the public seems to be assigning at least as much, if not more, blame for the impasse to Trump and the Republican majority. But the strategy comes with risks too. The pain from the shutdown – particularly for those in the Democratic coalition – is only going to increase as the weeks go by. Many federal workers have missed paycheques and are facing financial hardship. Funding is expected to run out for low-income food support. The US judicial system is scaling back its operations. And the Trump administration is using the shutdown to order new cuts to the federal workforce and suspend domestic spending, targeting Democratic states and cities. The reality is that Democratic leaders in the Senate will ultimately have to find a way out of the crisis. But they may be hard-pressed to reach terms that the protesters who took to the streets on Saturday will find acceptable. \"If we shake hands with President Trump on a deal, we don't want him then next week just firing thousands more people, cancelling economic development projects, cancelling public health funds,\" Democratic Senator Tim Kaine of Virginia said on Sunday in an interview on NBC's Meet The Press. \"So we are trying to get an agreement that a deal is a deal.\" There is a chance the government shutdown will still be happening in early November when voters in some states will head to the ballot box for the first time since last year's presidential contest. Elections for governor and state legislatures could provide a barometer for whether the anti-Trump sentiment on display at the \"No Kings\" protests translates into electoral success for Democrats. Four years ago, a Republican won the governor's race in Virginia, an electoral battleground that has trended left in recent presidential elections, providing an early sign of voter dissatisfaction with President Joe Biden. This time around, the Democrat – former Congresswoman Abigail Spanberger – is leading her Republican opponent in the polls. While Trump lost New Jersey in last year's presidential election, the margin of defeat - less than 6% - was dramatically down from Biden's 16% victory in 2020 and Hillary Clinton's 14% margin in 2017. November's governor's election shows a similarly close race. At the No Kings rally in Montclair, New Jersey, Democratic National Committee Chair Ken Martin urged attendees to vote in the upcoming election. \"It is one thing to show up at these protests,\" he said. \"And it's another to move the needle and get back some power.\" This November's elections will be a test of whether antipathy toward Trump is enough to get left-wing voters to support Democratic candidates. They are, however, just a prelude to next year's midterm elections, which will decide which party controls both chambers of the US Congress and could provide Democrats with a real check on Trump's power for the last two years of his presidential term. The priority at Saturday's protests was to unite around a Stop Trump message. Of less concern, at least for the moment, was what Democrats could do once they get back to power. There have, however, been some indications that cracks remain within the party coalition. Former Vice-President Kamala Harris's book tour, for example, has regularly been interrupted by pro-Palestinian protestors who object to the Biden administration's Middle East policies. Centrist proposals to focus on economic issues over social policies – including trans rights – have prompted condemnations from many on the left. Maine, Massachusetts, California and Michigan are likely to have contentious primary battles to determine Democratic nominees in next year's elections – pitting older establishment politicians against younger candidates and liberals against centrists. These battles could quickly open old political wounds that are hard to heal. In that case, marches alone may not be enough to solve what has ailed the party.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:53:27.802052+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cj3zemk2j4ro",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "92fa467040c897c257fbf7de8ab22f97",
    "processed_at": "2025-10-19T23:54:36.385843",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses political protests and the Democratic party's response to President Trump's policies, with no substantial focus on artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/us-news/2025/oct/19/george-santos-prison-sentence-commuted",
    "title": "George Santos says prison sentence was  disproportionate  but  large slice of humble pie  | George Santos",
    "text": "Disgraced former US congressman George Santos said on Sunday that his prison sentence had been “disproportionate”, but that he had been served “a very large slice of humble pie”, while lashing out at his critics in his first interview since Donald Trump commuted his sentence. Speaking to Dana Bash on CNN’s State of the Union, Santos said he was “all politicked out”, and called for his former campaign staffer, Sam Miele, to also receive a commutation. “This isn’t about ... glitter, stars and glam or going back to Congress,” he said. “This is a very personal journey and road for me ahead.” Trump announced on Friday that he had commuted the sentence for Santos, who was meant to serve more than seven years in federal prison in New Jersey after a whirlwind political career tainted by serial fabrications and fraudulent scheming. “I just signed a Commutation, releasing George Santos from prison, IMMEDIATELY,” Trump said in a lengthy Truth Social post. “Good luck George, have a great life!” Santos, who pleaded guilty last year to wire fraud and aggravated identity theft, was less than three months into serving time before he was released. He said Trump’s decision to commute his sentence came as a surprise. “I had no expectations, I wasn’t even aware until I learned it off of the chyron of mainstream media inside of the prison myself,” he said. “Other inmates saw it and called me over.” Bash pressed Santos on whether he had received favorable treatment as a “loyal ally” of the president. “There’s a lot of people who were upset with President Biden who pardoned his entire family before he left office in an unprecedented move,” Santos quipped back. “Pardon me if I’m not paying too much attention to the pearl-clutching of the outrage of my critics.” Trump has issued several pardons and commutations during his second term so far, beginning with the “full, complete and unconditional” presidential pardons for about 1,500 people who were involved in the January 6 attack on Congress. In February, he pardoned former Illinois governor Rod Blagojevich, who was convicted of corruption based crimes, including trying to sell a US Senate seat vacated by former President Barack Obama. As part of his plea deal, Santos had agreed to pay nearly $375,000 in restitution and $205,000 in forfeiture. When asked on State of the Union if he was planning on paying back the restitution, he said if it is “required of me by the law”. “I’ve been out of prison for two days. I agreed to come here to speak with you candidly and openly and not to obfuscate,” he said, visibly frustrated. “If it’s required of me by the law, yes. If it’s not, then no. I will do whatever the law requires me to do.” In a separate appearance on Fox & Friends Weekend earlier on Sunday, Santos said he no longer had to pay restitution and thanked Trump, praising him for having “such an amazing will for second chances”. Back on CNN, he went on to say he was confident that “if President Trump had pardoned Jesus Christ off the cross, he would have had critics. That’s just the reality of our country.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T210000Z",
    "date_download": "2025-10-19T21:53:29.828570+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/us-news/2025/oct/19/george-santos-prison-sentence-commuted",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "deab9ad6d2326911a137745158b05b30",
    "processed_at": "2025-10-19T23:54:36.385909",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses George Santos and his prison sentence, focusing on political issues and personal statements rather than any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/uk-news/2025/oct/19/mps-urged-to-confront-royal-family-over-prince-andrews-epstein-links",
    "title": "MPs urged to confront royal family over Prince Andrew Epstein links | Prince Andrew",
    "text": "Parliament is under mounting pressure to examine what the royal family knew about Prince Andrew’s links to Jeffrey Epstein and introduce a mechanism to strip him of his titles. There were calls on Sunday night for Andrew to face a police investigation and for ancient rules barring parliament from freely scrutinising royals and formally removing their titles to be revisited. The Metropolitan police confirmed they were looking into claims that Andrew asked his Met bodyguard to dig up information on Virginia Giuffre, who had accused him of sexual assault, hours before the bombshell picture of them was published in 2011. Ed Miliband, the energy secretary, said leaked emails suggesting Andrew passed his close protection officer Giuffre’s date of birth and US social security number were “deeply concerning”. A spokesperson for the Metropolitan police said: “We are aware of media reporting and are actively looking into the claims made.” The developing scandal forced Andrew to relinquish some of his royal titles on Friday, including Duke of York, having already lost the use of his HRH title after ceasing to be a “working royal”. He retains the dukedom, which would take an act of parliament to remove, while his status as a prince could only be removed if a letters patent were issued by the king. Andrew has vigorously denied any wrongdoing, and the FBI formally ended its investigation into his links to Epstein in July. But MPs and campaigners have called for further action including a Metropolitan police investigation into Andrew’s links to Epstein and an act of parliament to formally strip the prince of his titles. Rachael Maskell, the Labour MP for York Central, said she was writing to ministers this week to back her bill giving the king or a parliamentary committee the power to formally remove Andrew’s titles. “Every time this comes up, it clearly must be really traumatising for the victims and survivors, so it’s really important that this matter is dealt with once and for all,” Maskell said. “There are mechanisms which need to be put in place in order to remove a title.” Nadia Whittome, the Labour MP for Nottingham East, said: “It should be a given that the state removes Andrew Mountbatten-Windsor’s titles, rather than allowing him to hide behind voluntarily renouncing them and mealy-mouthed statements blaming his accusers.” Maskell proposed a removal of titles bill in 2022 which would enable the monarch or a parliamentary committee to remove titles in Andrew’s case and in the future. Similar legislation was enacted in 1917 to remove the titles of peers and princes who fought against the British in the first world war. One senior Labour backbencher and select committee chair described Andrew as a “disgrace” and said he “brings shame on himself and those associated with him”. “I would delight in voting for a parliamentary motion to strip him of all his titles,” they said. Asked by the BBC if he would support such legislation, Miliband said “the royal family will have to make its own decisions about what other steps can be taken” but that they had suggested “they didn’t want to take up parliamentary time with this”. Clive Lewis, the Labour MP for Norwich South, called for “a proper thorough investigation into what happened”. “It’s very clear the sense of entitlement that Prince Andrew has comes with being a prince and being part of the monarchy. The bigger story here is the monarchy itself. This is why I think the king has closed up shop. It poses some very difficult questions about how power operates in this country,” he said. George Foulkes, a Labour peer, wrote to the clerks of the Commons and Lords on Sunday night asking them to review rules restricting parliamentarians from asking questions about the royal family. Foulkes said that early this year, the Lords table office rejected questions he tried to ask on Andrew and his 10-year role as a UK special representative for trade and investment, which the prince finally gave up in 2011 after a string of controversies. “I wanted to ask questions about whether he had a security briefing, what his role was and a number of other things,” Foulkes said. “I was told by the table office that questions about the royal family were prohibited in both the Commons and the Lords.” Ultimately Foulkes was allowed to ask some specific questions about royal family expenditure, which parliament is allowed to question. Parliamentary rules state that “questions that cast reflections on the sovereign or the royal family” more broadly are inadmissible. On Sunday Foulkes called for the rules to be reviewed “in light of recent events”. Meanwhile, more than 1,000 letters were sent to MPs over the weekend urging them to push for a “full-blown parliamentary or independent inquiry into the royal Epstein scandal”. Supporters of the campaign group Republic wrote to their MPs accusing them of being complicit in their silence and urging them to call for an immediate investigation. Republic have called for an inquiry to look at actions taken by the Met police and for Andrew to face prosecution. “It is not credible to believe that the Met would not have informed senior royals of Andrew’s attempts to use them to smear Giuffre. There are also questions as to why the Met continues to refuse to investigate, interview or charge Andrew,” said Republic’s Graham Smith. “Public anger is what’s going to push this forward and there is a palpable anger among the public who can see that Andrew being stripped of the use of his titles is no punishment at all.” The Guardian published an extract from Giuffre’s posthumous memoir last week in which she detailed her first encounter with the “entitled” prince and said he “believed having sex with me was his birthright”. The Mail on Sunday published messages Andrew allegedly sent to Ed Perkins, then the queen’s deputy press secretary, in 2011 saying he had asked one of his close protection officers to obtain information about Giuffre. According to the messages, Andrew told Perkins he had given the officer Giuffre’s date of birth and nine-digit social security number and claimed she had a criminal record in the US. The email was sent hours before the publication of an infamous picture of Andrew with 17-year-old Giuffre. Her family has said she had no criminal record. There is no suggestion the police officer complied with the request. Another leaked email obtained by the Mail on Sunday suggests that Andrew’s ex-wife, Sarah Ferguson, took Princesses Beatrice and Eugenie, then 20 and 19, to visit Epstein in New York after he was released from prison. After a newspaper interview given by Ferguson in 2011 in which she said her association with him was a “terrible error of judgment”, Epstein wrote to Paul Tweed, his UK-based lawyer, in April 2011, and said she was “the first to celebrate my release”. A source close to Ferguson said that neither she nor her daughters had any recollection of such a visit.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T210000Z",
    "date_download": "2025-10-19T21:53:30.200337+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/uk-news/2025/oct/19/mps-urged-to-confront-royal-family-over-prince-andrews-epstein-links",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "44a4378c3b7ac6be5401f1878569054f",
    "processed_at": "2025-10-19T23:54:36.386002",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political and legal issues surrounding Prince Andrew and his connections to Jeffrey Epstein, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb",
    "title": "Australia news live : Suspected space debris lands in WA desert ; Albanese en route to US to meet Trump",
    "text": "Joyce says he has spoken to Pauline Hanson but ‘nothing is locked in’ with One Nation Joyce spoke to Sunrise earlier this morning, saying while he had briefly spoken to Pauline Hanson on the phone amid the speculation about his future plans, “nothing is locked in”. He said this morning: Let’s just take it down a step, I have not joined One Nation. I have not actually at this point in time resigned from the Nationals. Joyce said he also spoke to Hanson while the pair were in Canberra about a month and a half ago, but said there was “nothing unusual there”. Joyce said he wouldn’t be “salami sliced” into talking about his plans when he hadn’t yet made them, adding he only rang Hanson out of “politeness” as it was the “decent thing to do” as everyone was talking about them. Kevin Rudd has been touting the Aukus pact before the PM’s visit Australian ambassador to the US, Kevin Rudd, has been working overtime to talk up the Aukus pact to the American government recently. Hosting a defence industry reception focused on Aukus at the Australian embassy in Washington DC, conveniently just days before prime minister Anthony Albanese arrived in town, Rudd is spruiking the military pact as Australia awaits the outcome of a Pentagon review. As Albanese arrived on American soil on Monday (AEDT), Rudd posted on X another glowing endorsement of Aukus and its industrial benefits for the United States, saying “Aukus works because our industries do.” “Aussie and American firms are working together to build the capabilities that keep our region secure,” the caption reads. Posting video of his speech to the Aukus event at the embassy, he thanked members of the defence industry sphere for taking “the idea of Aukus and turning it into a concrete set of engineering and technology innovation enterprises”. Yesterday, Rudd posted online that Aukus was “creating new jobs and building new businesses across our three countries” – Australia, the US and United Kingdom. Officials investigating suspected space debris that landed in remote WA mine site Authorities are assessing suspected space junk found at a mine site in Western Australia. Official said a multi-agency response is under way after mine site personnel found a burning object on a remote access road about 30km east of the town of Newman. Early assessments indicate the object is made of carbon fibre and may be a pressure vessel or rocket tank consistent with aerospace components. The object has been ruled out as being from a commercial aircraft. WA Police said the object remains under investigation, but it has the characteristics of known space re-entry debris. Joyce says he has spoken to Pauline Hanson but ‘nothing is locked in’ with One Nation Joyce spoke to Sunrise earlier this morning, saying while he had briefly spoken to Pauline Hanson on the phone amid the speculation about his future plans, “nothing is locked in”. He said this morning: Let’s just take it down a step, I have not joined One Nation. I have not actually at this point in time resigned from the Nationals. Joyce said he also spoke to Hanson while the pair were in Canberra about a month and a half ago, but said there was “nothing unusual there”. Joyce said he wouldn’t be “salami sliced” into talking about his plans when he hadn’t yet made them, adding he only rang Hanson out of “politeness” as it was the “decent thing to do” as everyone was talking about them. Sussan Ley to say low and middle-income Australians will get tax cuts in a future Coalition government Low and middle-income Australians will be given tax cuts under a future Coalition government, AAP reports. In a major economic speech in Sydney on Monday, the opposition leader, Sussan Ley, will point to personal income tax cuts as the centrepiece of the policy offerings she will take to voters. She will say future tax cuts will be focused on areas where financial burdens are being felt the hardest. Ley will tell the Centre for Independent Studies: We’ll start where the pressure is greatest: low- and middle-income earners who are feeling the squeeze from higher prices and rising living costs. This is not a passing policy preference. It is more than just a commitment to lower taxes. However, the scale of any potential tax cuts is yet to be determined, and firm details will only be announced closer to the next federal election. Michael McCormack says Nationals want Joyce to stay Nationals MP Michael McCormack said the answer was “absolutely” yes, when asked if the party would prefer Joyce to stay. McCormack told RN Breakfast: Barnaby’s been a force of nature for regional Australia and he’s done a lot of good things … I appreciate he’s announced his retirement from the seat of New England at the next election. And he goes, obviously, from that position with a lot of respect. And I also obviously, as I texted him last night, I earnestly and honestly hope he remains with the Nationals until indeed his retirement from public life. McCormack went on to say he doesn’t believe One Nation represents the views of regional Australia. I appreciate Pauline Hanson has been there for a long, long time, and she’s done a lot of things that have given her endurance a healthy tick along. But I’ve got to say, the Nationals have been there for more than 100 years. We’ve turned up, we’ve absolutely made sure that regional Australia has been looked after in the halls of power in Canberra. Barnaby Joyce says ‘obviously’ relationship with David Littleproud ‘less than spectacular’ Barnaby Joyce said his decision to quit the Nationals came amid a relationship with party leader David Littleproud that was obviously “less than spectacular”, saying it was “healthier for all if it’s not working for you to get out”. Joyce spoke to RN Breakfast this morning: Obviously the relationship with David was less than spectacular. I mean, I think if we say anything else, it’s not being truthful. … I wish people all the best. I just, I’m not going to leave sort of bitter and twisted and angry. I just, you know, honestly, I wish people all the very best. That’s what I actually do. Like most things, you feel a lot better when you’re not angry. So I’m not angry now because I’ve said I’m getting out. Joyce said he would not comment on speculation he would join One Nation, but said the party had done a “good job” on some issues, including its stance on net zero. Let’s just pull the horse on this one up straight away. No decisions have been made, and that’s where we are right now. Draft of new laws on supermarket price gouging to come today The federal government will today release a draft of proposed new laws to crack down on supermarkets price gouging promised during the federal election campaign. In March this year, the prime minister said supermarkets would be liable for “heavy fines” if found to be charging excessive prices for products with the consumer watchdog, the ACCC, tasked with finding the best model to determine what constitutes price gouging. The ACCC earlier this year found major supermarket chains had increased their profit margins through the costs of household profits. The watchdog described Australia’s biggest chains – Coles, Woolworths and Aldi – as among the most profitable supermarket businesses in the world. The draft bill will be open for submissions until 3 November. Albanese en route to Washington DC after brief refuelling stop in Hawaii Josh Butler After a brief refuelling stop before sunrise in Honolulu, the prime minister, Anthony Albanese, continues on to Washington DC for his meeting with the US president, Donald Trump. The two men will have their first formal bilateral meeting, after a few phone calls and a brief encounter in New York City last month. The meeting is expected to occur in the very early hours of Tuesday morning, Australian time. Albanese stepped on to his official plane on Sunday, right after arriving back from an overseas holiday. We will look forward to hearing from the PM after we land in Washington DC later today. Albanese is accompanied on this trip by the resources minister, Madeleine King, and industry minister, Tim Ayres – underscoring the likelihood that critical minerals will be a key point of discussion for the Trump-Albanese meeting, alongside issues around Aukus, defence and trade. Albanese said in a written statement before departure he was looking forward “to a positive and constructive meeting with President Trump at the White House”. The defence minister, Richard Marles, is acting as prime minister until Tuesday night, then the foreign affairs minister, Penny Wong, will act as PM from Tuesday night until Albanese’s return later in the week. And welcome to Monday. The sky is falling! Nick Visser here to guide you through the morning’s news. Here’s what’s on deck. Suspected space debris was discovered near a mine site in Western Australia this weekend after workers found a burning object near a remote access road. Early assessments indicate it was made of carbon fibre and may be some kind of pressure vessel or rocket tank. The prime minister, Anthony Albanese, had a brief stop in Honolulu, Hawaii, a few hours ago before continuing on his way to Washington DC for his meeting with the US president, Donald Trump. Their first formal meeting will be very early tomorrow morning Australian time. The federal government is set to release a draft of proposed laws to crack down on supermarket price gouging. The prime minister said earlier this year companies could be liable for “heavy fines” if found to be charging excessive prices.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:30.752810+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "90912ecc4f2c850d61dec8ebc5e4e551",
    "processed_at": "2025-10-19T23:54:36.386529",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses political events, government actions, and space debris, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/australia-news/2025/oct/20/morning-mail-monday-ntwnfb",
    "title": "Morning Mail : Israel launches airstrikes in Gaza ; Bupa bonuses questioned ; crown jewels snatched in Louvre heist",
    "text": "Good morning. Israeli forces have carried out a wave of airstrikes in southern Gaza and closed off the territory to aid supplies amid accusations that Hamas violated their ceasefire agreement. Meanwhile, company records have revealed that Bupa staff were given $14m in bonuses shortly before the insurer admitted to deceptive conduct towards thousands of its Australian customers. And: jewel thieves have pulled off a spectacular heist at the Louvre museum in Paris, Anthony Albanese is set to touch down in the US, and Oscar Piastri faces a tough task to stay ahead of his F1 title rivals. Australia - Bupa bonuses | More than $14m was awarded to senior Australian health insurance staff a year before Bupa admitted to unconscionably causing customers to cancel or delay medical procedures. - Exclusive | The NSW government rejected advice from an expert scientific panel before it attempted a failed reintroduction of koalas to a forest that resulted in the death of more than half the animals. - Catching Zs | Sleep monitoring is a boom industry, but Australian experts are asking how accurate sleep trackers are, how useful the data is – and even what good sleep looks like. - Nationals turmoil | David Littleproud has urged Barnaby Joyce to stay in the party after the former leader announced his intention to quit – prompting talk of a potential defection to Pauline Hanson’s One Nation. - Port Douglas scare | A crocodile discovered lying in a Queensland resort’s pool has been removed by wildlife rangers, with the state’s environment regulator issuing new warnings about the reptiles. World - Gaza crisis | The Israeli air force has carried out airstrikes in Rafah, in what marks the most serious threat so far to the fragile ceasefire in Gaza; Israel reportedly halted supply of aid into Gaza as it launched the attacks; Palestinians in Gaza fear the ceasefire “could collapse at any moment”. - Louvre break-in | “Priceless” historic jewellery – including a necklace that Napoleon gave to his wife – has been stolen from the Louvre in Paris after men used a mechanical ladder to break into one of the museum’s most ornate rooms. - Prince Andrew claims | UK police are looking into claims Prince Andrew asked his taxpayer-funded close protection officer to uncover information about Virginia Giuffre hours before the emergence of a bombshell picture of them together. - Russia-Ukraine war | Ukraine’s president, Volodymyr Zelenskyy, has urged allies against appeasing Russia after returning from a trip to the US, where he failed to secure Tomahawk cruise missiles. - ‘It’s a crucial vote’ | Voters in Turkish-occupied northern Cyprus have been casting ballots in a poll seen as pivotal to determining whether peace talks can be revived on the divided island. Full Story Ex-ambassador to the US on how Albanese can tackle Trump Anthony Albanese is due to have his first face-to-face meeting with the US president at the White House. Reged Ahmad speaks with former ambassador to the US and former Liberal senator Arthur Sinodinos – a man who’s been in the room with Donald Trump – on what Australia should be offering this most unpredictable of presidents. In-depth Peter Drew works swiftly, transforming a blank city wall into a work of art designed to spark questions about what it means to be Australian. He has faced outrage and vitriol from those challenged by his striking “Aussie” posters – and gratitude from new arrivals and those who see hope in his evocative images. So he says he’ll continue his work, as immigration policy debate is again used by some as a front for white nationalism and racism. Not the news Over their mind-boggling 15-year, 27-album career, King Gizzard and the Lizard Wizard have switched gears with the speed and abandon of a stunt driver. And in July, they made their latest hairpin turn: removing all their music from Spotify, in protest of CEO Daniel Ek’s A$1bn investment in military tech. Frontman Stu McKenzie tells Shaad D’Souza the decision to abandon Spotify was an easy one to make – as was making all their music available for free online. Sport - Motorsport | Australian Formula One driver Oscar Piastri is under pressure, starting on sixth on the grid in the US Grand Prix – with his main rivals on the front row. - Cricket | Mitchell Marsh steered Australia to a seven-wicket victory over India in a rain-hit first ODI in Perth; England held off India by four runs to secure a Women’s World Cup semi-final spot. - Football | Manchester United have won at Anfield for the first time in nine years after a Harry Maguire header stunned Liverpool; Marco Silva is emerging as Nottingham Forest’s top target to replace Ange Postecoglou; Rangers’ managerial chaos continues as talks with Kevin Muscat break down. Media roundup Residents in some parts of NSW are being forced to travel almost 300km to see a dentist for check-ups, the Sydney Morning Herald reports. Suspected space debris is believed to have crashed near a WA mine site, with officials confirming the object was not from a commercial aircraft, ABC News reports. Private security guards patrolling housing estates in Melbourne’s outer west will soon start carrying guns, the Age reports. Tasmania’s pioneering green AI factory is set for nationwide expansion in a project that could create thousands of jobs, the Mercury reports. What’s happening today - Foreign affairs | The prime minister, Anthony Albanese, is to arrive in the US ahead of his White House meeting with Donald Trump. - VIC | A public hearing is scheduled in the Victorian parliamentary inquiry into cults and organised fringe groups. - VIC | A hearing is scheduled in the Senate inquiry into the Thriving Kids initiative in Melbourne. Sign up If you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland. Brain teaser And finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:30.825161+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/australia-news/2025/oct/20/morning-mail-monday-ntwnfb",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e9a148c4f69688e6c42d838888685b69",
    "processed_at": "2025-10-19T23:54:36.386614",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses current events and news topics such as airstrikes in Gaza, corporate bonuses, and a museum heist, with no significant focus on artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://knpr.org/npr/2025-10-19/sam-rivers-bassist-and-founding-member-of-limp-bizkit-dies-aged-48",
    "title": "Sam Rivers , bassist and founding member of Limp Bizkit , dies aged 48",
    "text": "Sam Rivers, bassist for rock band Limp Bizkit, has died. He was 48 years old. Rivers' death was confirmed by the band, who wrote online on Saturday: \"today we lost our brother\". \"Sam Rivers wasn't just our bass player — he was pure magic. The pulse beneath every song, the calm in the chaos, the soul in the sound,\" Limp Bizkit said in a social media post Saturday. \"He was a once-in-a-lifetime kind of human. A true legend of legends. And his spirit will live forever in every groove, every stage, every memory.\" The band did not share any details about his death. Rivers' last post on social media was on Friday, in which he shared a \"Save The Date\" video for Limp Bizkit performing at the Rock for People festival in Hradec Králové, a city in the Czech Republic, in June 2026. Rivers and his bandmates last performed in August at the Leeds Festival in the United Kingdom. In 2015, Rivers left the band after suffering from liver disease but rejoined the group in 2018. \"I got liver disease from excessive drinking … I had to leave Limp Bizkit in 2015 because I felt so horrible, and a few months after that I realized I had to change everything because I had really bad liver disease,\" Rivers said during an interview with Variety. \"I quit drinking and did everything the doctors told me. I got treatment for the alcohol and got a liver transplant, which was a perfect match.\" The nu-metal band skyrocketed in popularity in the '90s, being nominated for three Grammys. Their hits, including \"Rollin'\" and \"Nookie,\" also landed on the Billboard Hot 100 singles chart. Fred Durst, fellow bandmate and frontman for Limp Bizkit, remembered the first time he heard Rivers play at a Jacksonville, Florida bar while searching for bandmates to form the group. Rivers was playing in a band at the bar and Durst said he was \"killing it on the bass.\" \"I saw Sam play and I was blown away,\" Durst recalled in a video posted on social media Sunday morning. \"He's playing a five-string bass too. I'd never really seen someone using a five-string bass… he was so smooth and good and he stood out. I could hear nothing else but Sam… everything disappeared besides his gift.\" When he approached Rivers after his performance and told him that he wanted to form a band, Durst said the bassist didn't hesitate. \"He looked at me and he says ,'Killer. I'm in. Let's do it',\" Durst recalled. \"I've gone through gallons and gallons of tears since yesterday and… I'm thinking, 'My God, Sam's a legend….he did it. He lived it.'\" Limp Bizkit's new single, \"Making Love to Morgan Wallen,\" topped several Billboard charts in September. Copyright 2025 NPR",
    "domain": "knpr.org",
    "domain_category": "unknown",
    "language": "English",
    "date_publish": "20251019T201500Z",
    "date_download": "2025-10-19T21:53:35.732119+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "knpr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://knpr.org/npr/2025-10-19/sam-rivers-bassist-and-founding-member-of-limp-bizkit-dies-aged-48",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "b2da71f3a2fb7d1341d9edb42a7f2343",
    "processed_at": "2025-10-19T23:54:36.386763",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about the death of Sam Rivers, a musician, and does not discuss any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/hit-run-driver-crashes-birthday-party-injuring-9-126662108",
    "title": "Hit - and - run driver crashes into birthday party , injuring 9 kids",
    "text": "Hit-and-run driver crashes into birthday party, injuring 9 kids Police say a girl and a toddler suffered critical injuries in Bladensburg, Md. BLADENSBURG, Md. -- BLADENSBURG, Md. (AP) — A hit-and-run driver slammed into an outdoor birthday party in suburban Washington, D.C., injuring nine kids and two adults on Saturday evening, police said. A girl and a toddler had critical injuries from the crash in Bladensburg, Maryland, according to statements from the city's police department and the Prince George's County Fire and EMS Department. Video of the scene posted on social media showed a white tent with its front torn off on a lawn outside a home. Seven other kids and two adults had serious but not life-threatening injuries, officials said. The children ranged in age from 2 to 9 years old, Bladensburg Police said in a statement. The driver got out of the vehicle and ran away, authorities said, and has not been found. Investigators have not determined what caused the vehicle to run off Maryland Highway 450 at around around 10:15 p.m. Saturday.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T204500Z",
    "date_download": "2025-10-19T21:53:40.460554+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/hit-run-driver-crashes-birthday-party-injuring-9-126662108",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "502206e7c4aca02a09ac4fefa22daa3c",
    "processed_at": "2025-10-19T23:54:36.386812",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a hit-and-run incident involving a driver crashing into a birthday party, which is unrelated to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/news/north-korean-soldier-defects-to-south-korea-dmz/",
    "title": "North Korean soldier defects to South Korea across the rival heavily fortified border",
    "text": "North Korean soldier defects to South Korea across the rivals' heavily fortified border A North Korean soldier defected to South Korea across the rivals' heavily fortified border on Sunday, South Korea's military said. The military took custody of the soldier who crossed the central portion of the land border, South Korea's Joint Chiefs of Staff said in a statement. It said the soldier expressed a desire to resettle in South Korea. It was the first reported defection by a North Korean soldier since a North Korean staff sergeant fled to South Korea via the border's eastern section in August 2024. Despite the two border crossings, it isn't common for North Koreans to defect via the land border. Unlike its official name, the Demilitarized Zone, the 248-kilometer (155-mile) -long, 4-kilometer (2.5-mile) -wide border is guarded by land mines, tank traps, barbed wire fences and combat troops. Satellite imagery from last year shows North Korea had started construction on what appears to be tranches of wall near its border with South Korea. In 2017, when a fleeing North Korean soldier sprinted across the border, North Korean soldiers fired about 40 rounds before South Korean soldiers could drag the wounded soldier to safety. A vast majority of about 34,000 North Koreans who have fled to South Korea since the end of the 1950-53 Korean War came via China, which shares a long, porous border with North Korea. Relations between the two Koreas remain strained, with North Korea repeatedly rejecting outreach by South Korea's liberal President Lee Jae Myung, who took office in June with a vow to restore reconciliation between the rivals. Earlier this month, North Korean leader Kim Jong Un rolled out his nuclear-armed military's most powerful weapons at a massive military parade attended by foreign leaders. Joined by high-level Chinese, Vietnamese and Russian officials at a podium, Kim said in a speech that his military \"should continue to grow into an invincible entity that destroys all threats,\" but made no direct mention of the United States or South Korea.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T204500Z",
    "date_download": "2025-10-19T21:53:42.784499+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/news/north-korean-soldier-defects-to-south-korea-dmz/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6a631491b18432f9a2aaf57c31e7536c",
    "processed_at": "2025-10-19T23:54:36.386854",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the defection of a North Korean soldier to South Korea and the geopolitical context surrounding it. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/entertainment/kevin-costners-ex-marries-family-friend-year-half-after-finalizing-divorce-from-yellowstone-star",
    "title": "Christine Baumgartner marries Joshua Connor after Kevin Costner divorce",
    "text": "Christine Baumgartner, who finalized her divorce from ex-husband Kevin Costner in February 2024, has married family friend Joshua Connor. The couple, who got engaged in January, tied the knot on Saturday at the Santa Ynez Ranch, a private vineyard in Santa Barbara, Calif., according to People magazine. The outdoor ceremony was attended by 100 of their closest family and friends, including their children. Baumgartner shares three children with Costner, while Connor shares three children with his ex-wife. \"It was magical – truly,\" a guest told People. \"The setting was gorgeous, but what made it special was the intimacy of it all. This wasn’t a big production. It was authentic, heartfelt, and so very them. Everyone there felt like they were witnessing something really precious.\" \"The joy and laughter were infectious, from the welcome celebration Friday night to the last dance Saturday evening,\" another guest said. \"Christine and Josh were glowing. And there wasn’t a dry eye in the crowd during the ceremony.\" CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER Romance rumors between Baumgartner and Connor sparked in July 2023 when the couple was spotted on vacation in Hawaii. Nearly one year later, the pair confirmed their relationship while walking hand-in-hand together in Santa Barbara, Calif., shortly after she finalized her divorce with Costner. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS Baumgartner filed for divorce on May 1, 2023, citing irreconcilable differences. In documents obtained by Fox News Digital, Christine cited April 11 as the date of separation. The purse designer took Costner to court over child support and the validity of their prenuptial agreement. The former couple eventually agreed to joint legal and physical custody, according to the documents obtained by Fox News Digital. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital's Tracy Wright contributed to this post.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:46.936599+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/entertainment/kevin-costners-ex-marries-family-friend-year-half-after-finalizing-divorce-from-yellowstone-star",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "72b82620e1b8cb464352486be82f7424",
    "processed_at": "2025-10-19T23:54:36.386906",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the marriage of Christine Baumgartner and Joshua Connor, focusing on personal and family details, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/california/story/2025-10-19/hakeem-jeffries-la-church-visit",
    "title": "Hakeem Jeffries campaigns for Proposition 50 at L . A . Black churches",
    "text": "Top House Democrat campaigns for Proposition 50 at L.A.’s Black churches - Share via - House Minority Leader Hakeem Jeffries returned to California and stopped at three L.A. Black churches on Sunday. - The top House Democrat campaigned for the state’s redistricting measure Proposition 50. - “The African American church-going community has always been the foundation of the Black experience in the United States of America,” Jeffries said. U.S. House Minority Leader Hakeem Jeffries (D-N.Y.) visited three Black churches in Los Angeles on Sunday morning to campaign for California’s redistricting effort, which could add five or six Democratic representatives to his ranks. Amid a congressional deadlock over healthcare subsidies that has left the government shut down for more than two weeks, the minority leader returned to the Golden State to campaign for Proposition 50. The ballot measure would give his party more power against Republicans, who Jeffries said have refused to negotiate in the shutdown and otherwise. “This is trouble all around us,” Jeffries told the congregation at First African Methodist Episcopal Church of Los Angeles in West Adams — after poking fun at President Trump’s 2016 gaffe misspronouncing a book of the Bible. “Folks in the government who would rather shut the government down than give healthcare to everyday Americans. Wickedness in high places. And now they want to gerrymander the congressional maps all across the country to try to rig the midterm elections.” The packed congregation — most wearing pink to support Breast Cancer Awareness Month — were receptive to his message. “This is a way of trying to keep things equal,” said Kim Balogun, who was in Sunday’s crowd. “A level playing field.” For many of its members, First AME is more than just a church. As the city’s oldest African American congregation, it has been at the forefront of the fight for civil rights since its founding in 1872. “This is family,” said Toni Scott, a retired special-education teacher who has been with First AME for 52 years. “As one of the church’s previous ministers used to say, ‘This is a hospital. People are sick; we come to be healed,’” she said. When news reached L.A. that Nelson Mandela would be released from prison, South African immigrants and anti-apartheid activists flocked to the church, anxiously awaiting the first sights of Mandela walking free. During the 1992 riots, First AME was a bastion of hope amid a sea of chaos. “We thank you, God, for bringing us through dark times and chaotic times,” the Rev. Charolyn Jones said to the congregation on Sunday, “knowing that our church, the African Methodist Episcopal Church, was born out of protest.” For Jeffries, the first Black person to lead a major political party in Congress, the West Coast trip amid a congressional impasse was important. “The African American churchgoing community has always been the foundation of the Black experience in the United States of America,” Jeffries said, who also visited the congregations of Mt. Sinai Missionary Baptist Church in South L.A. and Resurrection Church of Los Angeles in Carson. “It’s an honor and a privilege to spend time worshiping at Black churches here with Congresswoman Sydney Kamlager-Dove to reinforce the message of the importance of voting yes on Proposition 50.” The state’s redistricting effort, Proposition 50, is part of a national fight over control of the U.S. House of Representatives, instigated by President Trump. Republicans hold a slim majority in the House, but in June, Trump began pushing Texas Republicans to redraw the state’s congressional maps to yield five more likely GOP seats. In response, Newsom proposed California temporarily depose of its independent redistricting commission, led by 14 citizens, to redraw the state’s maps and add five Democratic seats, effectively canceling out Texas’s move. The Democratic-controlled state Legislature quickly produced redrawn maps and scheduled a Nov. 4 special election to put them up for a vote. Mail-in ballots are already in the hands of voters. Changes to the United States Postal Service mean that some ballots mailed on election day may not be postmarked the same day. California Republicans, including former governor Arnold Schwarzenegger, have slammed the initiative as a “big scam.” Schwarzenegger called Democrats hypocritical, arguing that while they call Trump a “threat to democracy,” they want to “tear up the Constitution of California” and “take the power away from the people and give it back to the politicians.” Jeffries noted that California was letting its citizens ultimately decide — unlike some Republican-led states. “We said from the very beginning that we want to find bipartisan common ground whenever possible, but unfortunately, Republicans, from the beginning of this presidency, have adopted a take-it-or-leave-it, go-at-it-alone strategy,” he said, which is part of why, he added, Proposition 50 is so important. In the current shutdown, Democrats said they will not vote for a funding bill unless it extends tax credits in the Affordable Care Act that are set to expire for many Americans at the end of the year and reverses cuts to Medicaid that Republicans passed in July’s so-called Big Beautiful Bill. If the ACA credits expire, premiums would on average more than double for Americans on the enhanced tax credit, one health policy research firm found. But Republicans point out they come with a price: The Congressional Budget Office estimates they would cost the government $350 billion over the next decade. The bill, which is now law, will cut Medicaid spending by $793 billion, the CBO estimated, and lead to 7.8 million Americans losing their insurance. Ninety-nine stolen election ballots were found among a trove of stolen mail in a homeless encampment in Sacramento on Wednesday. Officials said those ballots have been voided, and new ones sent to affected voters. On the government shutdown, Richard Balogun, a member of Sunday’s First AME congregation, thinks fighting for healthcare is a worthwhile cause. “Isn’t it amazing that in England, Australia … you can have national healthcare? Maybe you don’t get treated within the first hour, but you get treated,” he said. In America, “you have to ask yourself sometimes, if I’m going to the emergency room, can I afford that thousands of dollars I’m going to have to pay? That should not be the case in this country.” A government shutdown has consequences: 2.3 million civilian federal employees are going without pay — roughly 750,000 of whom are furloughed. When the employees are back-paid after the government reopens, that’ll correspond to roughly $400 million of taxpayer money spent every day of the shutdown to pay employees who were not working, the CBO estimates. Beyond National Park closures and air travel delays, food programs for low-income families could run dry without a funding bill. The Women, Infants and Children Program (WIC) can see effects as soon as one week after a shutdown, the CEO of the National WIC Assn. said. Meanwhile, SNAP (formerly known as food stamps) could also run out of funding further down the line. Republicans blame Democrats for shutting down the government over their healthcare concerns, but Jeffries pinned it on Republicans, who’ve refused to negotiate. To Scott, the pink her congregation was wearing to support breast cancer survivors only emphasized the importance of access to healthcare. (Jeffries sported a pink tie.) “More people need to know what’s going on, so just having him go from church to church, mostly in the Black neighborhoods — that’s where we have the most people: in our churches,” Scott said. “Some may hear the word, see something on fake news, but we know in the church you’re going to hear truth.”",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:49.232142+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/california/story/2025-10-19/hakeem-jeffries-la-church-visit",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e40706341ca525ead4b8f544d800c161",
    "processed_at": "2025-10-19T23:54:36.387186",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Hakeem Jeffries' campaign for Proposition 50 and its implications for redistricting and healthcare, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/california/story/2025-10-19/kaiser-healthcare-worker-strike-ends-after-5-days",
    "title": "Healthcare workers strike at Kaiser Permanente ends after 5 days",
    "text": "Kaiser healthcare worker strike ends after five days. Bargaining resumes this week - Share via - A five-day strike by 30,000 Kaiser healthcare workers in California and Hawaii ended Sunday. Negotiations resume Wednesday. - The union seeks a 25% wage increase over four years and mandatory staffing standards, while Kaiser disputes staffing is the primary issue. A five-day strike that affected hundreds of Kaiser Permanente clinics and hospitals in California and Hawaii came to an end after the union representing workers said it had “new momentum” to head back to the bargaining table, but no apparent agreement has been reached. “This strike may be over — but the fight for patient safety is not,” the United Nurses Assns. of California/Union of Healthcare Professionals, known as UNAC/UHCP said in a statement. “Caregivers are returning to work united, energized, and ready to keep up the pressure for a fair contract that puts patients first.” Kaiser and union officials are set to resume bargaining on Wednesday and Thursday. The union requested a wage increase of 25% over four years, an ask that union officials have said was needed to compensate for the smaller 2% increases workers received in the first year as part of their 2021 contract negotiations. The Kaiser strike is set to last five days. It involves nurses, pharmacists, anesthetists, midwives, physician assistants, rehab therapists and others. The union has also pushed for the additional hiring of more staff, and proposed an internal registry of on-call union nurses, so that the company doesn’t rely on contracted traveling nurses. Kaiser officials have argued that employees on average earn 16% more than peers in the industry, and that the wage increases proposed raised their “already above-market wages over the 4-year contract.” Company officials said the company offered a 21.5% wage increase over four years before the strike was called, as well as additional improvements to medical plans and retiree benefits. Kaiser officials said workers returned to work Sunday at 7 a.m. During the strike, facilities were staffed with doctors, managers and nearly 6,000 contracted nurses and clinicians to minimize disruption to care, officials said. On Sunday, the UNAC/UHCP announced the end of the strike, stating that the labor action was “sending a resounding message that patient care and safe staffing must come first.” The union pointed to new staffing standards released by the Joint Commission, a nonprofit that accredits healthcare organizations, that recognized adequate staffing as a component of providing needed care. The new standard moves staffing levels away from an employer’s choice that could be affected by budget constraints, to a patient safety standard, the union said in a statement. “The Joint Commission has finally said what nurses have known all along: Unsafe staffing is unsafe care,” said Charmaine S. Morales, president of the UNAC/UHCP in the statement. “It’s now a national patient safety mandate — and UNAC/UHCP will make sure it’s enforced.” Officials at Kaiser said it was welcoming back the 30,000 employees who went on strike, but in a statement said the main point of contention at the bargaining table has been wages, not staffing. “While the Alliance has publicly emphasized staffing and other concerns, wages are the reason for the strike and the primary issue in negotiations,” said Terry Kanakri, spokesperson for Kaiser, in a statement. During bargaining, “the focus will be on economic issues,” Kanakri said in the statement. “At a time when the cost of healthcare continues to go up steeply, and millions of Americans are having to make the difficult choice to go without coverage, it’s critical that we keep quality, accessible healthcare coverage affordable.” Meanwhile union officials have blasted the company for holding $66 billion in reserves and expanding projects in other states.",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:49.352631+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/california/story/2025-10-19/kaiser-healthcare-worker-strike-ends-after-5-days",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "854a5acc20370a750ccc236e05c6d20a",
    "processed_at": "2025-10-19T23:54:36.387254",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a strike by healthcare workers at Kaiser Permanente, focusing on labor negotiations, wages, and staffing issues. It does not mention artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/business/commentary/article-florida-snowbirds-property-real-estate-mamdani/",
    "title": "As New Yorkers again look to Florida , Canadian snowbirds have found the moment to sell",
    "text": "Gus Carlson is a U.S.-based columnist for The Globe and Mail Some people are calling it the potential Covid 2.0 of Florida real estate – for better or worse. The prospect of Zohran Mamdani becoming New York’s next mayor – and his promises to raise taxes sharply on wealthy city dwellers – has some in Florida expecting another mass migration to the Sunshine State that could drive up house prices to levels not seen since the pandemic. Florida Governor Ron DeSantis has publicly predicted that a win by Mr. Mamdani, a democratic socialist who has repeatedly declared his distaste for the rich, will spark a rush of moneyed New Yorkers to Florida, and see prices in tony enclaves such as Palm Beach rise as much as 20 per cent. Last month, Mr. DeSantis underlined his point, sarcastically naming Mr. Mamdani Palm Beach realtor of the year. Opinion: Dear New York, you are no longer the centre of the world Eric Adams drops bid for re-election in New York City mayoral campaign Florida real estate sales agents got a hint of the anxiety among wealthy New Yorkers when inquiries about relocating to Florida spiked after Mr. Mamdani easily won the Democratic primary in June. His winning platform was built on plans to raise taxes on those earning $1-million or more a year, increase corporate taxes, and target what he calls “richer white neighbourhoods.” With the Nov. 4 election about two weeks away, and Mr. Mamdani enjoying a comfortable lead at the polls – some put him ahead by 20 points – the inquiries are spiking again. Some Miami agents report a 50-per-cent increase. The last time activity was so vigorous was during the pandemic, when hundreds of thousands of people left New York, the bulk of them for states like Florida, which has no state income tax. A buying frenzy drove down inventories of resale houses and prices skyrocketed, as relocating executives took advantage of remote work flexibility and the fact that if they were needed back at the office, most Florida destinations are less than a three-hour flight from New York-area airports. The migration of New Yorkers was a main contributor to Florida surpassing Texas as the fastest growing state in the U.S. last year. The potential boom may be a selling opportunity for Canadians who own property in Florida. They have been buffeted by high condominium homeowners association fees, sky-high insurance premiums, displeasure with U.S. President Donald Trump’s posture toward Canada, as well as a Canadian dollar hovering around US$0.70. Canadians have consistently been the largest foreign owners of Florida real estate over the last several years. But Mr. Trump’s tariffs and teasing about Canada becoming the 51st state have soured many Canadians on the U.S. The number of Canadian tourists choosing Florida as a getaway is down sharply so far this year, with many citing Mr. Trump as the reason. It’s not inconceivable that Canadians who own property in Florida might decide that the combination of Trump fatigue and a thundering herd of cash-heavy newcomers eager to pay top dollar make now the time unload. But not all Floridians are happy about the prospect of having even more New Yorkers in town. Particularly in South Florida, the pandemic rush and its hangover have put infrastructure under enormous pressure. Miami has become the new Los Angeles in terms of drive-times and congestion. Construction of office and condominium towers in Broward and Palm Beach counties has snarled arteries and strained public services. And then there’s New Yorkers’ legendary rudeness. As one Palm Beach elementary school father said as he watched a car with New York licence plates cut into the drop-off line of cars: The best thing about New Yorkers used to be that they arrived at Thanksgiving and left after Easter. Now they stay all year long. Whether or not Mr. Mamdani‘s policies will indeed trigger a mass exodus is unclear. What is clear, though, is that the candidate has not backed off his war-on-the-wealthy posture, presumably because his messages resonate with a lot of voters and have driven up his poll numbers. But polls are not necessarily a reliable indication of reality, as the last few U.S. presidential elections have proved. Despite his popularity, Mr. Mamdani and his advisers might heed the warning signals from Florida and consider Margaret Thatcher’s suggestion that the problem with socialism is that eventually you run out of other people’s money. If the predictions of another migration out of the city are correct, Mr. Mamdani may run out of wealthy people before he has the chance to run out of their money.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T211500Z",
    "date_download": "2025-10-19T21:53:52.180136+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/business/commentary/article-florida-snowbirds-property-real-estate-mamdani/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "742446b74b1db3c21636a5ef47d1074a",
    "processed_at": "2025-10-19T23:54:36.387323",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses real estate trends and migration patterns related to New Yorkers moving to Florida, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/film/reviews/the-choral-review-ralph-fiennes-1236556557/",
    "title": "  The Choral  Review : Ralph Fiennes Conducts an Anti - War Oratorio",
    "text": "“God Save the King” has never been the loveliest or most melodic of national anthems, and its somewhat chiding, aggressive tenor is brought to the fore early in “The Choral.” Upon delivery of some good news from the front in the grim midst of the First World War, an English village choir’s lusty, spontaneous rendition of the song disrupts their rather shabbier rehearsal of Edward Elgar’s complex, haunting oratorio “The Dream of Gerontius,” prompting refined choirmaster Dr. Henry Guthrie (Ralph Fiennes) to roll his eyes to the back of his head. “If only you sang Elgar with the confidence you sing the national anthem,” he mutters. Art counts for a lot more than patriotism to Guthrie, and the happy surprise of Nicholas Hytner‘s film — despite its twee, veddy English trappings — is that it largely takes his side. Perhaps that’s not such a surprise. “The Choral” is, after all, the first original screenplay in over 40 years by Alan Bennett, a 91-year-old national treasure whose place in the British cultural firmament has never been tidily defined: A queer, agnostic, working-class Northerner, he’s a staunch royalist who declined a knighthood, and whose politics have traveled along a spectrum he once described as “conservative socialism.” Many of those contrasts and conflicts are present in “The Choral” — some for better, some for worse, but quite interestingly in all cases — even if Hytner, the director who previously filmed Bennett’s scripts for “The Madness of King George,” “The History Boys” and “The Lady in the Van,” gives the overall package a deceptively buttery gloss of tea-and-crumpets nostalgia. Popular on Variety At first glance, the film seems a twinkly fusion of two brands of British feelgood crowdpleaser: the keep-calm-and-carry-on portrait of wartime resilience, and the let’s-put-on-a-show underdog story, like “The Full Monty” with the radio dial tuned to “Land of Hope and Glory” rather than “You Sexy Thing.” The year is 1916, the setting the picturesque (and fictional) Yorkshire mill town of Ramsden — the rolling hills and cobbled, honey-filtered streets of which seem safely sheltered from the war raging over on the Continent, but for its depleting effect on the town’s young menfolk. With each wave of conscription, they depart from the town’s quaint train station, bright-eyed and crisply uniformed, only to return embittered and incomplete, if at all. Until his own name is called, 17-year-old postboy Lofty (Oliver Briscombe) spends his days delivering messages of tragedy to newly bereaved women around Ramsden, though his randy pal Ellis (Taylor Uttley) looks on the bright side: “Grief, it’s an opportunity,” he says cheerily. There’s an opportunity for the boys, too, in the village chorus, sorely deprived by the draft of male voices — and soon its young choirmaster too. Enter Guthrie, an urbane, prodigious conductor formerly of some renown, though much disapproved of by the locals on several counts, not least among them the fact that he spent several years living and studying in Germany. His unapologetic atheism doesn’t help; nor do further “peculiarities” that nobody precisely wants to name. “Let’s just say I’d prefer a family man,” says priggish board member Duxbury (Roger Allam), and leaves it at that. Guthrie’s gayness remains more or less covert throughout Bennett’s script, though Fiennes plays him with a typically graceful, understated air of melancholy, his mourning turned inward for loves and lovers he can never name. There are unanswered overtures from the choir’s pianist Horner (Robert Emms), a soft, vulnerable young man whose conscientious-objector status renders him a fellow outsider. But “The Choral” is more preoccupied with the romantic lives of its younger characters, as Ellis, Lofty and their fellow teen soldiers-to-be desperately seek to lose their virginities before potentially losing their lives. Those in their sights include Mary (Amara Okereke), a golden-voiced Salvation Army officer yet to loosen so much as one button, and Bella (Emily Fairn), a pluckier sort anxiously awaiting the return of her wounded boyfriend Clyde (heartbreaking ensemble standout Jacob Dudman), though perhaps not equipped to nurse his trauma. Bennett’s script flits inconsistently between generations, foregrounding certain perspectives before they suddenly recede, though the film is never less than diverting — with Guthrie’s ambitious plan to stage Elgar’s elevated work (with an off-key choir and a three-person orchestra) lending proceedings a satisfying narrative thrust. If it doesn’t culminate in the against-the-odds artistic triumph you might expect, there’s a more nuanced, honest moral here in favor of artistic aspiration, integrity and compromise all at once, via a hilariously deflating, supercilious cameo from Simon Russell Beale as Elgar himself. But then the film is best when it chafes quietly against our expectations of gentle British comfort viewing, whether sharing in Guthrie’s dry exasperation at demonstrations of national pride, or eschewing dewy romanticism for its sole, unlikely sex scene: a passionless, reluctant handjob on the moors, discreetly depicted but tenderly illustrative of bodies and souls broken by war and English reserve. There are ugly open wounds in “The Choral,” even if they’ve been carefully and handsomely dressed by Mike Eley’s pristine, wheaty lensing, George Fenton’s luxurious scoring and Jenny Beavan’s perfectly pressed costumes. At its best, Bennett’s writing cuts through the gauze.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T204500Z",
    "date_download": "2025-10-19T21:54:13.633032+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/film/reviews/the-choral-review-ralph-fiennes-1236556557/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c5f75837517d40e2fdeddffdf138ccab",
    "processed_at": "2025-10-19T23:54:36.387399",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a film review centered around themes of war, music, and personal relationships, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/film/news/the-choral-review-ralph-fiennes-1236556557/",
    "title": "  The Choral  Review : Ralph Fiennes Conducts an Anti - War Oratorio",
    "text": "“God Save the King” has never been the loveliest or most melodic of national anthems, and its somewhat chiding, aggressive tenor is brought to the fore early in “The Choral.” Upon delivery of some good news from the front in the grim midst of the First World War, an English village choir’s lusty, spontaneous rendition of the song disrupts their rather shabbier rehearsal of Edward Elgar’s complex, haunting oratorio “The Dream of Gerontius,” prompting refined choirmaster Dr. Henry Guthrie (Ralph Fiennes) to roll his eyes to the back of his head. “If only you sang Elgar with the confidence you sing the national anthem,” he mutters. Art counts for a lot more than patriotism to Guthrie, and the happy surprise of Nicholas Hytner‘s film — despite its twee, veddy English trappings — is that it largely takes his side. Perhaps that’s not such a surprise. “The Choral” is, after all, the first original screenplay in over 40 years by Alan Bennett, a 91-year-old national treasure whose place in the British cultural firmament has never been tidily defined: A queer, agnostic, working-class Northerner, he’s a staunch royalist who declined a knighthood, and whose politics have traveled along a spectrum he once described as “conservative socialism.” Many of those contrasts and conflicts are present in “The Choral” — some for better, some for worse, but quite interestingly in all cases — even if Hytner, the director who previously filmed Bennett’s scripts for “The Madness of King George,” “The History Boys” and “The Lady in the Van,” gives the overall package a deceptively buttery gloss of tea-and-crumpets nostalgia. Popular on Variety At first glance, the film seems a twinkly fusion of two brands of British feelgood crowdpleaser: the keep-calm-and-carry-on portrait of wartime resilience, and the let’s-put-on-a-show underdog story, like “The Full Monty” with the radio dial tuned to “Land of Hope and Glory” rather than “You Sexy Thing.” The year is 1916, the setting the picturesque (and fictional) Yorkshire mill town of Ramsden — the rolling hills and cobbled, honey-filtered streets of which seem safely sheltered from the war raging over on the Continent, but for its depleting effect on the town’s young menfolk. With each wave of conscription, they depart from the town’s quaint train station, bright-eyed and crisply uniformed, only to return embittered and incomplete, if at all. Until his own name is called, 17-year-old postboy Lofty (Oliver Briscombe) spends his days delivering messages of tragedy to newly bereaved women around Ramsden, though his randy pal Ellis (Taylor Uttley) looks on the bright side: “Grief, it’s an opportunity,” he says cheerily. There’s an opportunity for the boys, too, in the village chorus, sorely deprived by the draft of male voices — and soon its young choirmaster too. Enter Guthrie, an urbane, prodigious conductor formerly of some renown, though much disapproved of by the locals on several counts, not least among them the fact that he spent several years living and studying in Germany. His unapologetic atheism doesn’t help; nor do further “peculiarities” that nobody precisely wants to name. “Let’s just say I’d prefer a family man,” says priggish board member Duxbury (Roger Allam), and leaves it at that. Guthrie’s gayness remains more or less covert throughout Bennett’s script, though Fiennes plays him with a typically graceful, understated air of melancholy, his mourning turned inward for loves and lovers he can never name. There are unanswered overtures from the choir’s pianist Horner (Robert Emms), a soft, vulnerable young man whose conscientious-objector status renders him a fellow outsider. But “The Choral” is more preoccupied with the romantic lives of its younger characters, as Ellis, Lofty and their fellow teen soldiers-to-be desperately seek to lose their virginities before potentially losing their lives. Those in their sights include Mary (Amara Okereke), a golden-voiced Salvation Army officer yet to loosen so much as one button, and Bella (Emily Fairn), a pluckier sort anxiously awaiting the return of her wounded boyfriend Clyde (heartbreaking ensemble standout Jacob Dudman), though perhaps not equipped to nurse his trauma. Bennett’s script flits inconsistently between generations, foregrounding certain perspectives before they suddenly recede, though the film is never less than diverting — with Guthrie’s ambitious plan to stage Elgar’s elevated work (with an off-key choir and a three-person orchestra) lending proceedings a satisfying narrative thrust. If it doesn’t culminate in the against-the-odds artistic triumph you might expect, there’s a more nuanced, honest moral here in favor of artistic aspiration, integrity and compromise all at once, via a hilariously deflating, supercilious cameo from Simon Russell Beale as Elgar himself. But then the film is best when it chafes quietly against our expectations of gentle British comfort viewing, whether sharing in Guthrie’s dry exasperation at demonstrations of national pride, or eschewing dewy romanticism for its sole, unlikely sex scene: a passionless, reluctant handjob on the moors, discreetly depicted but tenderly illustrative of bodies and souls broken by war and English reserve. There are ugly open wounds in “The Choral,” even if they’ve been carefully and handsomely dressed by Mike Eley’s pristine, wheaty lensing, George Fenton’s luxurious scoring and Jenny Beavan’s perfectly pressed costumes. At its best, Bennett’s writing cuts through the gauze.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:13.708736+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/film/news/the-choral-review-ralph-fiennes-1236556557/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c5f75837517d40e2fdeddffdf138ccab",
    "processed_at": "2025-10-19T23:54:36.387470",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a film titled 'The Choral' and its themes related to war, music, and personal relationships, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/music/news/taylor-swift-stays-number-1-week-2-billboard-album-chart-1236556554/",
    "title": "Taylor Swift  Showgirl  Strong in Week 2 With 338 , 000 Album Units",
    "text": "No one would have expected Taylor Swift‘s “The Life of a Showgirl” to lose its grip on the album chart in week 2, and it indeed held on at the top of the Billboard 200, with 338,000 equivalent album units in its second week out. Last week, Swift set a record in the Luminate/Soundscan-era data-keeping books with 4.002 million units. Although this week’s figure marked a predictably significant drop-off from that record-buster, even the second week for “Showgirl” ranked as the fifth best week for any album this year, per Billboard and Luminate. The only albums that had a higher number than 338,000 units in a single frame this year were first-week figures for releases from Wallen (who opened with 493,000), the Weeknd (who started with 490,000), Sabrina Carpenter (which started with 366K) and, of course, Swift’s own debut tally. Breaking down that 338K figure for Swift’s second week, 101,000 of those units came in the form of pure album sales, Billboard reported. That sales figure represented the biggest drop for “Showgirl” in week 2, down 97%, after a first week that included all the pre-sales for the album, plus a number of release-week-only variants. Nonetheless, 101,000 is a pure-sales figure that few contemporary albums ever reach in a week, and “Showgirl” had little competition in easily standing atop Billboard’s separate Top Album Sales chart for a second week. Popular on Variety Streaming had a stronger hold, down from the juggernaut first-week figure by only 55%. The album’s tracks picked up a still-staggering 307.59 million on-demand official streams, which calculated out in the chart formula to 236,000 SEA (streaming equivalent album) units. Needless to say, “Showgirl” didn’t have any challengers in returning to No. 1 on Billboard’s Top Streaming Albums chart. Wallen’s “I’m the Problem” spent a dozen nonconsecutive weeks at No. 1 this year. That’s a run at the top of the Billboard 200 that Swift will no doubt be hoping to match in the coming months. Looking at the release schedule, it appears as if there won’t be a lot standing in the way of an extended reign, as there are no further obvious pop blockbusters currently scheduled to come out between now and the end of 2025, barring any last-minute surprises from a superstar. With no music stars interested in putting albums out right now in Swift’s shadow, there were no new entries in the top 10 of the Billboard 200 for the week ending Oct. 10. The only relatively fresh blood on the chart is in Olivia Dean’s “The Art of Loving,” which debuted at No. 8 two weeks ago, then rose one spot to No. 7 last week, and is up yet one more spot to No. 6 in week 3. The latest weekly tally for the album is 36,000 equivalent album units, up 5% from the previous week. Everything else in the top 10 is very familiar fare — perhaps overly familiar, for some tastes. Following Swift near the top of the list are the “KPop Demon Hunters” soundtrack at No. 2 (104,000 units), Wallen’s “I’m the Problem” at No. 3 (79,000 units), Cardi B’s “Am I the Drama?” in fourth place (50,000) and Sabrina Carpenter’s “Man’s Best Friend” in the No. 5 spot (45,000) Following Dean at No. 6 are Bad Bunny’s “DeBÍ TiRAR MáS FOToS” in seventh place (33,000 units), SZA’s “SOS” at No. 8 (32,000), Alex Warren’s “You’ll Be Alright, Kid” — not to be confused with Swift’s “You’re on Your Own, Kid,” of course — at No. 9 (32,000) and, finally, a second Wallen mega-seller, “One Thing at a Time,” in 10th place (31,000). Results for the Hot 100 will come in Monday, with Swift’s “The Fate of Ophelia” expected to repeat at the top there as well.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:13.835803+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/music/news/taylor-swift-stays-number-1-week-2-billboard-album-chart-1236556554/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0eee2f80f1166f1147a1e3f6d8dfcf3c",
    "processed_at": "2025-10-19T23:54:36.387531",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is focused on the performance of Taylor Swift's album on the Billboard charts and does not discuss any artificial intelligence topics or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/shopping/news/how-to-watch-ina-garten-be-my-guest-online-streaming-1236555749/",
    "title": "How to Stream Ina Garten  Be My Guest  Season 7 Online",
    "text": "If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission. Ina Garten’s “Be My Guest” returns this Sunday with an all-star lineup and the kind of cozy, conversational charm that made the series a daytime staple. The seventh season premieres Oct. 19 at 11 a.m. ET on Food Network, with new episodes featuring Tina Fey, “Gilded Age” star Christine Baranski, violin virtuoso Itzhak Perlman and fashion designer Daniel Roseberry. For fans looking to stream the new season, the best option is DIRECTV, which offers access to Food Network’s live broadcast and HBO Max, where new episodes become available on demand. DIRECTV’s PREMIER package includes HBO Max at no additional cost, while other DIRECTV streaming and satellite TV plans let subscribers add it for $16.99 a month and they get the first 3 months included at no extra cost. DIRECTV offers three months of HBO Max and along with other premium channels — like Paramount+ with Showtime, Cinemax and STARZ — when signing up for select packages.1 Per Food Network’s description for “Be My Guest” Season 7, “In the season premiere, Ina knows Tina Fey loves custard desserts – so she greets her with Breakfast Panna Cotta. Tina then shares childhood revelations, standout standup moments and stories about life on the road with her best friend Amy Poehler. Finally, the duo team up in the kitchen to make a dream dinner of Tina’s Greek Lemon Potatoes served with Ina’s Chicken Thighs with Creamy Mustard Sauce.” Popular on Variety Later in the season, Baranski will stop by for Maple-Oatmeal Scones, Perlman will try Potato Galette with Smoked Salmon and Roseberry will try Tri-Berry Ricotta Cake. Since premiering in 2022, “Be My Guest” has helped Garten transcend her Food Network roots to become a full-fledged lifestyle and entertainment figure, blurring the line between culinary television and celebrity interview. The show’s relaxed format — equal parts chat, cooking demo and introspective sit-down interview — has drawn comparisons to longform celebrity conversations like “My Next Guest Needs No Introduction” and “Hot Ones,” positioning Garten as a kind of Hamptons-set cultural interviewer. Stream “Be My Guest” Season 7 on DIRECTV here.2 - *w/eligible pkg. Must select offers. Premiums included for first 3 mos., then auto-renew monthly at then-prevailing rates unless canceled (curr. $16.99/mo. for HBO Max, $12.99/mo. for Paramount+ with SHOWTIME, $10.99/mo. each for STARZ and Cinemax, and $7.99/mo. for MGM+). Cancel anytime. Offer subj. to change. ↩︎ - Access HBO Max only on HBO Max app or hbomax.com. Paramount+ with SHOWTIME subscription incl. access to Paramount+ with SHOWTIME streaming plan, avail. on Paramount+ app or paramountplus.com/link. Online acct. reg. may be req’d. Offer not avail. to existing DIRECTV or U-verse TV customers. New approved residential customers only. Service renews monthly unless you cancel. Cancel anytime. Add’l fees may apply to non-qualified customers. Device subject to Equipment Lease agmt. Add’l fee(s) may apply if equip. not returned. Credit card req’d. Restr’s apply. For full details, go to directv.com/affiliates/stream. ↩︎",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:14.599674+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/shopping/news/how-to-watch-ina-garten-be-my-guest-online-streaming-1236555749/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5bb65f39d400a5bf1ac66c7dc2fe1ef0",
    "processed_at": "2025-10-19T23:54:36.387586",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a cooking show and its streaming options, with no mention or relevance to artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/robert-de-niro-keep-fighting-trump-midterms-1236591764/",
    "title": "Robert De Niro Says  To Keep Fighting  Trump Ahead Of Midterms",
    "text": "Following this weekend’s No Kings protests, Robert De Niro is continuing to hold Donald Trump‘s feet to the fire and drive home the messages of the nationwide demonstrations. The 2x Oscar winner, who helped mobilize ahead of Saturday’s protests, went on to warn fellow Americans that “we have to keep fighting” as the president continues to deploy the National Guard to major cities under the guise of keeping peace, ahead of the midterm elections on Tuesday, Nov. 3. “I’m very happy to see that because we need much more of it going forward,” he said of the protests on MSNBC’s The Weekend. “Because that’s the only thing that the politicians are going to recognize, they either face the wrath of Trump or the wrath of the people. And they have to be more afraid of the wrath of the people and realize, ‘This is not good. I better strap on my balls and do something about it.'” Watch on Deadline De Niro added, “We can’t let up. We cannot let up on them, because he is not gonna leave the White House. He does not wanna leave the White House, he will not leave the White House. Anybody who thinks [he will] is just deluding themselves, they Republicans most of all, because they know. But they’re going along with it. It’s a classic bully situation. We see it, and there’s no other way to face a bully. You have to face him and fight it out, and back him off, and back him down. That’s the only way this is going to work.” After Trump deployed 300 California National Guard troops to Oregon, in addition to boots on the ground in Chicago and other major cities, De Niro warned that the military presence is “gonna wear on people” until they don’t have “the freedom to walk into the polling station and vote without being intimidated.” “We have to have a defense against that, an oppositional offense,” he said. “We have to be strong to counter that situation when it comes, because you know that’s what he’s trying. It’s better to neutralize it now than to worry about it later.” De Niro added that when Trump’s term is ultimately up, the Supreme Court will “find a way to go after him for what he’s done, all the awful, monstrous things that he’s done. He’s not gonna wanna leave. Why should he?” The Killers of the Flower Moon star previously appeared in a video for Indivisible to help mobilize for Saturday’s No Kings protest, which the grassroots organization said attracted a turnout of more than 7 million people across all 50 states.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:20.871742+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/robert-de-niro-keep-fighting-trump-midterms-1236591764/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "88c6773b220b58c66932c5ffe4b2e05f",
    "processed_at": "2025-10-19T23:54:36.387650",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Robert De Niro's political statements and activism regarding Donald Trump and the upcoming midterm elections. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591751/",
    "title": "Deadline",
    "text": "Neon Steers Its Latest Palme D’Or Winner Into Awards Season – Specialty Box Office Neon opened its sixth consecutive Cannes Palme d’Or winner It Was Just An Accident by Iranian director Jafar Panahi to a $68k weekend on three screens. That’s $115k over five days following it’s Wednesday debut at Film at Lincoln Center and Film Forum in NYC, and AMC Century City in LA. The distributor has had the top Cannes prize winners since Parasite in 2019, followed by Titane (2021), Triangle of Sadness (2022), Anatomy of a Fall (2023) and Anora last year. Panahi, who has been imprisoned in Iran several times, is Stateside for the first time in two decades for the opening, doing a flurry of Q&As. He was forbidden to travel abroad for years and had to film the darkly comic film in secret, the topic of a heartfelt conversation with Martin Scorsese at the New York Film Festival where It Was Just An Accident screened. While every film is unique, requiring a been a nuanced campaign and release strategy, Neon has mostly opened its Cannes winners in the same timeframe and subtitled U.S. releases like Triangle Of Sadness and Anatomy Of A Fall a slow rollout, a pattern it will follow with It Was Just An Accident screened recently. Neon also sees Sony Pictures Classics’ opening of awards magnet I’m Still Here by Walter Salles last year as a nice comparison. The Cannes prize signifies something special and brings out a core audience quickly. Neon is looking for a snowball effect with strong press and word of mouth as the season picks up. Accident will add a couple more runs in LA and open in San Francisco and a few other markets next week but is keeping a small footprint, trusting to awards buzz to help build a long tail for a film that’s not just a hopeful Best Picture and Best Director as well as International Feature. New indie openings by gross (screen counts vary widely): Angel Studios’ latest, Truth & Treason, was no. 6 this weekend in about 2,100 theaters with $2.7 million for the WW2 drama. Viva opened animated family adventure Pets on a Train in 1,300 locations to $814k. The Met: Live In HD’s transmission of Bellini’s La Sonnabula grossed an estimated $626k on about 800 screens for its solo Saturday show, ranking no., 9 for the day. Presented by Fathom Entertainment and the Met. Prathyangira Cinemas opened Dude in 275 locations to a debut of $600.1k, as per Comscore. Stars Pradeep Ranganathan. The Mastermind from Mubi opened at 5 theaters to $104k for a PTA of $20.8k. The drama starring Josh O’Connor represents a career high opening for director Kelly Reichardt. Ethan Hawke-starring Bue Moon from Sony Pictures Classics saw $67k on five screens. F*** My Son from Cartuna, X-rated and one of the most divisive films of the year, opened at the IFC Center in NYC to $8.5k from four late-night shows after screening at TIFF Midnight Madness, Fantastic Fest, Beyond Fest and Sitges. Expands to the Alamo Drafthouse Downtown LA next weekend, ahead on a theatrical roadshow opening in one new city each week. Cartuna says it’s booked through early February. By keeping this movie screening in movie theaters for as long as possible, “we’re working to build an audience gradually,” said director Todd Rohal (Uncle Kent 2). “Thankfully, movie houses like IFC Center have a history of midnight programming dating back to the heyday of the Waverly and can see the risk-reward benefit of screening a film as out-there as F*** My Son!” Holdovers: Amazon MGM’s After The Hunt starring Julia Roberts grossed $1.56 million in a week 2 expansion to 1,238 locations for an estimated cume of $1.77 million. IFC’s Good Boy added $555k in week 3 at 1,020 theaters for a cume of $6.1 million. Jennifer Lopez-starring Kiss Of The Spider Woman from Roadside Attractions is at an estimated $181.9k gross on 740 screens in week 2 for a $1.44 million cume. Mary Bronstein’s If I Had Legs I’d Kick You from A24, staring Rose Byrne, grossed $171.5 on 25 screens in a week 2 expansion for a $301.8k cume.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:21.441128+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591751/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "68196bf55384f9441dd73fbd6a0c23ca",
    "processed_at": "2025-10-19T23:54:36.387706",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the release and performance of films, particularly those that have won awards at Cannes, and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/tag/no-kings-protests/",
    "title": "No Kings protests",
    "text": "site categories Latest in No Kings protests Robert De Niro: “We Have To Keep Fighting” Trump As POTUS “Intimidates” Voters Ahead Of Midterms Following this weekend’s No Kings protests, Robert De Niro is continuing to hold Donald Trump‘s feet to the fire and drive home the messages of the nationwide demonstrations. The 2x Oscar winner, who helped mobilize ahead of Saturday’s protests, went on to warn fellow Americans that “we have to… - By Glenn Garner - WGA West President Michele Mulroney Delivers Speech At No Kings Protest: “When Our Words Are Powerful, We Cannot Be Silenced” Recently elected Writers Guild of America West President Michele Mulroney delivered a rousing speech at the No Kings protest in Los Angeles, decrying President Donald Trump and his administration’s recent actions curtailing Hollywood writers’ freedom of expression, specifically via the targeting of… Glenn Close, Spike Lee, Jean Smart & More Voice Support For No Kings Protests: “The Most Patriotic Thing That You Can Do” UPDATED: As millions of Americans take to the streets — from New York to Los Angeles, Washington, D.C. to Chicago — Hollywood is voicing its support for the nationwide No Kings protests, with prominent figures like Glenn Close, Spike Lee, Jean Smart and many others praising the day of… Protesters Fill Streets As Part Of “No Kings” Demonstrations To Oppose Donald Trump; Police Try To Clear Crowds In Downtown Los Angeles — Update UPDATED: Los Angeles Police officers tried to clear downtown protest crowds in the late afternoon on Saturday, as tensions escalated after a day of No Kings protests. The LAPD said, “A DISPERSAL ORDER has been issued at Alameda South of Aliso North of Temple. A DISPERSAL ORDER has been issued on… - By Ted Johnson - Mark Ruffalo, Kerry Washington, Julia Louis-Dreyfus & More Celebrities Attend “No Kings” Protests: “Our Democracy’s In Real Trouble” Celebrities like Mark Ruffalo, Jimmy Kimmel, Kerry Washington and more are stepping out in support of the “No Kings” protests happening nationwide against president Donald Trump’s increasingly authoritarian behavior. They join thousands of marchers across cities from New York City to Austin to… What To Know About Saturday’s Army Parade, Donald Trump’s Birthday And The No Kings Protests We are coming to the end of one of the most tumultuous and eventful weeks of Donald Trump’s second term so far, but it’s not over yet. On Saturday, the U.S. Army will hold a military parade to celebrate its 250th anniversary, with more than 6,000 soldiers in current and historic uniforms… - By Ted Johnson - Sidebar Newswire PMC Deadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved. Powered by WordPress.com VIPSite ad",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:22.178997+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/tag/no-kings-protests/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "f6743f6fdcee916e4d617da702190202",
    "processed_at": "2025-10-19T23:54:36.387814",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses protests against Donald Trump and does not mention artificial intelligence or related topics. It focuses on political activism and celebrity involvement in protests, which are unrelated to AI.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/indie-film-box-office-neon-cannes-palme-dor-awards-season-1236591751/",
    "title": "Indie Film Box Office : Neon Steers Its Latest Palme DOr Winner Into Awards Season",
    "text": "Neon opened its sixth consecutive Cannes Palme d’Or winner It Was Just An Accident by Iranian director Jafar Panahi to a $68k weekend on three screens. That’s $115k over five days following it’s Wednesday debut at Film at Lincoln Center and Film Forum in NYC, and AMC Century City in LA. The distributor has had the top Cannes prize winners since Parasite in 2019, followed by Titane (2021), Triangle of Sadness (2022), Anatomy of a Fall (2023) and Anora last year. Panahi, who has been imprisoned in Iran several times, is Stateside for the first time in two decades for the opening, doing a flurry of Q&As. He was forbidden to travel abroad for years and had to film the darkly comic film in secret, the topic of a heartfelt conversation with Martin Scorsese at the New York Film Festival where It Was Just An Accident screened. While every film is unique, requiring a been a nuanced campaign and release strategy, Neon has mostly opened its Cannes winners in the same timeframe and subtitled U.S. releases like Triangle Of Sadness and Anatomy Of A Fall a slow rollout, a pattern it will follow with It Was Just An Accident screened recently. Neon also sees Sony Pictures Classics’ opening of awards magnet I’m Still Here by Walter Salles last year as a nice comparison. Watch on Deadline The Cannes prize signifies something special and brings out a core audience quickly. Neon is looking for a snowball effect with strong press and word of mouth as the season picks up. Accident will add a couple more runs in LA and open in San Francisco and a few other markets next week but is keeping a small footprint, trusting to awards buzz to help build a long tail for a film that’s not just a hopeful Best Picture and Best Director as well as International Feature. New indie openings by gross (screen counts vary widely): Angel Studios’ latest, Truth & Treason, was no. 6 this weekend in about 2,100 theaters with $2.7 million for the WW2 drama. Viva opened animated family adventure Pets on a Train in 1,300 locations to $814k. The Met: Live In HD’s transmission of Bellini’s La Sonnabula grossed an estimated $626k on about 800 screens for its solo Saturday show, ranking no., 9 for the day. Presented by Fathom Entertainment and the Met. Prathyangira Cinemas opened Dude in 275 locations to a debut of $600.1k, as per Comscore. Stars Pradeep Ranganathan. The Mastermind from Mubi opened at 5 theaters to $104k for a PTA of $20.8k. The drama starring Josh O’Connor represents a career high opening for director Kelly Reichardt. Ethan Hawke-starring Bue Moon from Sony Pictures Classics saw $67k on five screens. F*** My Son from Cartuna, X-rated and one of the most divisive films of the year, opened at the IFC Center in NYC to $8.5k from four late-night shows after screening at TIFF Midnight Madness, Fantastic Fest, Beyond Fest and Sitges. Expands to the Alamo Drafthouse Downtown LA next weekend, ahead on a theatrical roadshow opening in one new city each week. Cartuna says it’s booked through early February. By keeping this movie screening in movie theaters for as long as possible, “we’re working to build an audience gradually,” said director Todd Rohal (Uncle Kent 2). “Thankfully, movie houses like IFC Center have a history of midnight programming dating back to the heyday of the Waverly and can see the risk-reward benefit of screening a film as out-there as F*** My Son!” Holdovers: Amazon MGM’s After The Hunt starring Julia Roberts grossed $1.56 million in a week 2 expansion to 1,238 locations for an estimated cume of $1.77 million. IFC’s Good Boy added $555k in week 3 at 1,020 theaters for a cume of $6.1 million. Jennifer Lopez-starring Kiss Of The Spider Woman from Roadside Attractions is at an estimated $181.9k gross on 740 screens in week 2 for a $1.44 million cume. Mary Bronstein’s If I Had Legs I’d Kick You from A24, staring Rose Byrne, grossed $171.5 on 25 screens in a week 2 expansion for a $301.8k cume.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:22.795417+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/indie-film-box-office-neon-cannes-palme-dor-awards-season-1236591751/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8343f4d949bb3c67bb1a32a4d8124e72",
    "processed_at": "2025-10-19T23:54:36.387888",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the indie film box office and the release strategies of films, focusing on specific titles and their performance. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/debbie-harry-wants-florence-play-her-biopic-1236591696/",
    "title": "Debbie Harry Wants Florence Pugh To Play Her In Biopic",
    "text": "Following Madonna‘s biopic bootcamp, Debbie Harry has an idea for a movie about her own life and musical legacy. The Blondie frontwoman recently revealed Florence Pugh as the “great actor” she would love to portray her in a biopic, and the Oscar-nominated actress has previously expressed interest in playing Harry. “If it were somebody like Florence Pugh, I would be in heaven,” Harry told The Sunday Times. “I just think she’s a great actor and she could do anything.” Watch on Deadline Pugh has also campaigned to play Harry, when asked what famous figures she would like to portray. “Blondie, just because she’s so cool,” said the actress at the Santa Barbara International Film Festival in 2020, according to Entertainment Weekly. Although known for her roles in the MCU and films like Midsommar (2019), Don’t Worry Darling (2022) and We Live in Time (2024), Pugh is also a musician, performing cover songs under the name Flossie Rose as a teenager on YouTube.Ha With Pugh also appearing on her musician brother Toby Sebastian’s 2021 song ‘Midnight‘, as well as writing and performing the songs ‘The Best Part’ and ‘I Hate Myself’ for her 2023 movie A Good Person, perhaps she already has the vocal chops to take on the ‘Call Me’ artist’s biopic. Harry’s casting nomination comes after she released Face It: A Memoir in 2019, charting her rise in the downtown New York City scene of the 1970s to become a global superstar, as well as how she overcame heroin addiction, bankruptcy and Blondie breaking up. Back in 2007, Kirsten Dunst said she met with Harry about a biopic that never came to fruition. 3 Comments Submit a comment - Anonymous This isn’t a story. Everyone should want Florence Pugh to portray them in their biopic. I want her to portray me in my biopic too. She’s that good. I’m a fat, hairy dude with almost black hair. - Anonymous Lol true - - Anonymous Michelle Pfeiffer should play the older version.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:23.363717+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/debbie-harry-wants-florence-play-her-biopic-1236591696/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ede7429e0542d52285d0ed2c662e98e5",
    "processed_at": "2025-10-19T23:54:36.387932",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Debbie Harry's desire for Florence Pugh to portray her in a biopic, focusing on the entertainment industry and personal stories rather than any artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/tag/the-boy-is-mine-tour/",
    "title": "The Boy Is Mine Tour",
    "text": "site categories Latest in The Boy Is Mine Tour Brandy Suffered Dehydration, “Wanting To Faint” Before Exiting Chicago Show: “I Sincerely Apologize” After abruptly leaving the Chicago stop of her and Monica‘s The Boy Is Mine Tour, Brandy Norwood is explaining her exit and apologizing to fans. The artist explained that she “experienced dehydration and feelings of wanting to faint” before stepping off stage during Saturday’s performance at… - By Glenn Garner - Brandy Abruptly Exits Chicago Show, Leaving Monica To Finish Performance Solo Three stops into The Boy Is Mine Tour this week, fans of Brandy Norwood and Monica were left confused by the abrupt end to Saturday’s concert. Concertgoers on social media complained that the show at Chicago’s United Center was reportedly cut short after Norwood abruptly walked off-stage early… - By Glenn Garner - Sidebar Newswire PMC Deadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved. Powered by WordPress.com VIPSite ad",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:23.972398+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/tag/the-boy-is-mine-tour/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ca31a4b92f87770aebd625e2ecc39ba0",
    "processed_at": "2025-10-19T23:54:36.387990",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a concert tour and the health issues of a performer, with no mention or relevance to artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591727/",
    "title": "Deadline",
    "text": "Brandy Abruptly Exits Chicago Show, Leaving Monica To Finish Performance Solo Three stops into The Boy Is Mine Tour this week, fans of Brandy Norwood and Monica were left confused by the abrupt end to Saturday’s concert. Concertgoers on social media complained that the show at Chicago’s United Center was reportedly cut short after Norwood abruptly walked off-stage early in the performance, leaving Monica to finish the concert solo, without getting to the tour’s eponymous 1998 duet. “Give me one second y’all I gotta get my—” said Norwood in a video, going backstage after apparently struggling with sound issues, never to return. Deadline has reached out to Norwood’s team for comment. One audience member on X said they “never saw her again,” adding: “Monica came out, monologued, sat, sung and left. No bye, no nothing. Screen went off. Lights came on and they told us to get out.” Another shared a video of the clearly frustrated audience after the lights came on. “#Brandy just threw a fit and left the stage 75% before the show was over and #Monica had to finish the show by herself!” they wrote. After announcing their reunion in June, Brandy and Monica’s The Boy Is Mine Tour kicked off Thursday at Cincinnati’s Heritage Bank Center, featuring appearances from Kelly Rowland and Muni Long.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:24.460325+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591727/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8ce6aea260a3fe95a3ed2a815c7ffec8",
    "processed_at": "2025-10-19T23:54:36.388026",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a concert incident involving Brandy and Monica, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591764/",
    "title": "Deadline",
    "text": "Robert De Niro: “We Have To Keep Fighting” Trump As POTUS “Intimidates” Voters Ahead Of Midterms Following this weekend’s No Kings protests, Robert De Niro is continuing to hold Donald Trump‘s feet to the fire and drive home the messages of the nationwide demonstrations. The 2x Oscar winner, who helped mobilize ahead of Saturday’s protests, went on to warn fellow Americans that “we have to keep fighting” as the president continues to deploy the National Guard to major cities under the guise of keeping peace, ahead of the midterm elections on Tuesday, Nov. 3. “I’m very happy to see that because we need much more of it going forward,” he said of the protests on MSNBC’s The Weekend. “Because that’s the only thing that the politicians are going to recognize, they either face the wrath of Trump or the wrath of the people. And they have to be more afraid of the wrath of the people and realize, ‘This is not good. I better strap on my balls and do something about it.'” De Niro added, “We can’t let up. We cannot let up on them, because he is not gonna leave the White House. He does not wanna leave the White House, he will not leave the White House. Anybody who thinks [he will] is just deluding themselves, they Republicans most of all, because they know. But they’re going along with it. It’s a classic bully situation. We see it, and there’s no other way to face a bully. You have to face him and fight it out, and back him off, and back him down. That’s the only way this is going to work.” After Trump deployed 300 California National Guard troops to Oregon, in addition to boots on the ground in Chicago and other major cities, De Niro warned that the military presence is “gonna wear on people” until they don’t have “the freedom to walk into the polling station and vote without being intimidated.” “We have to have a defense against that, an oppositional offense,” he said. “We have to be strong to counter that situation when it comes, because you know that’s what he’s trying. It’s better to neutralize it now than to worry about it later.” De Niro added that when Trump’s term is ultimately up, the Supreme Court will “find a way to go after him for what he’s done, all the awful, monstrous things that he’s done. He’s not gonna wanna leave. Why should he?” The Killers of the Flower Moon star previously appeared in a video for Indivisible to help mobilize for Saturday’s No Kings protest, which the grassroots organization said attracted a turnout of more than 7 million people across all 50 states.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:24.871416+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591764/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "307fd02dea3373e6fc3c1cefa3424d55",
    "processed_at": "2025-10-19T23:54:36.388083",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political issues and statements made by Robert De Niro regarding Donald Trump and the upcoming midterm elections. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591659/",
    "title": "Deadline",
    "text": "‘Black Phone 2’ Rings Up $42M Global Bow; ‘Tron: Ares’ Squeaks Past $100M & ‘One Battle After Another’ Tops Century Mark Overseas To Reach $163M WW – International Box Office Refresh for latest…: Blumhouse’s Black Phone 2 dialed up a $42M start globally, including $15.5M from the international box office – the latter above The Black Phone and Sinners in the same markets. The Universal release of the Scott Derrickson-directed Ethan Hawke-starrer is playing in 71 offshore markets, led by Mexico at $4.3M. It was No. 1 for the weekend there with a 58% share. The launch is above the first film, as well as Weapons, and more than 3x Smile 2 and Sinners. In the UK & Ireland, $1.48M placed it at No. 2 behind Uni’s other opener, Gabby’s Dollhouse: The Movie. The UK bow for Black Phone 2 is 19% above the first film. Brazil was another highlight at $1.2M, and with Saturday over-indexing as cinemagoing was boosted by cool and rainy weather. Black Phone 2 ranked as the clear No.1 title in the market and came in above the first film, as well as topping Smile 2, Weapons and Sinners. Australia and France round out the Top 5. In Oz, the sequel did $908K at No. 1 with business continuing to build throughout the frame. France captured $569K as Blumhouse’s first 16-rated film in the market. Upcoming releases include Germany, Spain, Korea and Japan. The sophomore session for Disney’s Tron: Ares was down 54% internationally with an additional $14.1M from 52 material markets. The overseas cume to date is $48.4M, lagging domestic’s $54.6M for a $103M global total through Sunday. China was new this weekend, but, as expected, did not light up, giving the movie a $2.8M launch. Tron: Ares was the top non-local title, slightly edging the arrival of One Battle After Another ($2.5M). It was No. 1 again in a handful of smaller markets, and No. 2 in Australia, Brazil and Mexico. The Top 5 after two weekends are: Mexico ($4.9M), UK ($4.3M), France ($3.3M), China ($2.8M) and Germany ($2.7M). The global Imax total so far is $17.6M including $7.1M from overseas. Warner Bros’ Paul Thomas Anderson critical darling One Battle After Another continued to hold strongly with a 38% drop for another $11.8M from 78 overseas markets in release. The offshore cume has crossed the century mark with $100.6M through today. Global is now $162.5M. The Top 5 international markets are: UK ($13M), France ($10.1M), Germany ($7.7M), Italy ($5.2M) and Australia ($4.6M). Universal/DreamWorks Animation’s Gabby’s Dollhouse: The Movie notably added the UK and Spain this session, bringing the number of overseas markets in release to 60. The frame was $6.8M to reach an international cume through Sunday of $28.2M, above Captain Underpants on a like-for-like basis. Holdovers were down 46%. UK & Ireland had a No. 1 start with $2.3M including Thursday’s strong “Purrsday” previews, and also the highest screen average in the market. There was especially strong performance in Scotland, where schools are at the back end of their early October half term, ahead of holidays rolling out across the rest of the UK. The weekend result is in line with the openings of both Bad Guys films, above Paw Patrol: The Mighty Movie, Captain Underpants and Paw Patrol. Spain also had a No. 1 start with $1M including last Saturday’s previews. The opening result excluding previews is in line with Captain Underpants, and above Sonic 3 and Paw Patrol. Still to release is Japan in March next year. MORE…",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:25.334807+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591659/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c7e30364d4a9ee0342930a8a4f3849ec",
    "processed_at": "2025-10-19T23:54:36.388201",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses box office performance and film releases, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591742/",
    "title": "Deadline",
    "text": "Brandy Suffered Dehydration, “Wanting To Faint” Before Exiting Chicago Show: “I Sincerely Apologize” After abruptly leaving the Chicago stop of her and Monica‘s The Boy Is Mine Tour, Brandy Norwood is explaining her exit and apologizing to fans. The artist explained that she “experienced dehydration and feelings of wanting to faint” before stepping off stage during Saturday’s performance at United Center, noting that she left the venue to “see a doctor nearby” and get checked out. “To my dear fans in Chicago, Thank you all for the overwhelming love, support, and—most importantly—your prayers,” she said in a statement. “I sincerely apologize for the abrupt end to last night’s performance in Chicago. After weeks of nonstop rehearsals, last night I experienced dehydration and feelings of wanting to faint, everyone involved agreed that prioritizing my well-being was of the utmost importance.” Norwood continued, “I still made the decision to try and return and give it my all despite not feeling ok. With having to make some adjustments and the show being very technical. Unfortunately, it was impossible to fully connect sonically with the production, I really appreciate everyone’s best efforts.” The I Know What You Did Last Summer actress added that she’s “deeply grateful to my sister, Monica, for stepping up with such grace and professionalism and the entire crew for their continued care and support. “I went from the arena to see a doctor nearby and have taken the proper precautions to help moving forward. Your understanding, patience, and unwavering belief mean the world to me,” said Norwood. “I look forward to returning to the stage—stronger and more grateful than ever—alongside my girl, Monica, tonight in Indianapolis. With all my love, Brandy” Fans of Norwood and Monica were left confused by the abrupt end to Saturday’s concert, after Norwood abruptly walked off-stage early in the performance, leaving Monica to finish the concert solo, without getting to the tour’s eponymous 1998 duet. “Give me one second y’all I gotta get my—” said Norwood in a video, going backstage after apparently struggling with sound issues, never to return. After announcing their reunion in June, Brandy and Monica’s The Boy Is Mine Tour kicked off Thursday at Cincinnati’s Heritage Bank Center, featuring appearances from Kelly Rowland and Muni Long.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T213000Z",
    "date_download": "2025-10-19T21:54:25.907636+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591742/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5d7acd40e3251a31e40ca9904d1f0e75",
    "processed_at": "2025-10-19T23:54:36.388246",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Brandy Norwood's health issues during a concert and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  }
]