[
  {
    "url": "https://www.dr.dk/nyheder/udland/overblik-hvad-er-op-og-ned-i-usa-s-fredsplan-i-gaza",
    "title": "OVERBLIK Hvad er op og ned i united states fredsplan for Gaza ? ",
    "text": "Planen begyndte allerede at sive i sidste uge. Den amerikanske præsident havde tilsyneladende nedfældet 21 punkter, der i sidste ende skulle skabe fred i Gazastriben. I næste uge, den 7. oktober 2025, har krigen varet i to år, og det internationale pres mod Israels regering er sjældent set større. Derfor har mange regeringsledere på tværs af kloden udtrykt begejstring for Trumps plan. Men vejen mod fred er belagt med meget uforudsigelighed - eksempelvis måtte Israels premierminister i dag trække lidt i land i forhold til hans accept af amerikanernes planer. Så hvad er op og ned? Hvor står vi? Og hvad er der blevet sagt de seneste par dage? Lad os kigge på det. Sådan begynder forløbet I slutningen af sidste uge begynder flere medier at skrive om en lækket 21-punkts-plan, der er nedfældet af Trump-administrationen. Planen skal ifølge de medier, der mener at have set den, bane vejen for en sikker og vedvarende fred mellem Israel og Hamas i Gazastriben. I aftes kommer nyhedsbureauet Reuters på banen. Nu har Det Hvide Hus helt officielt offentliggjort planen, der skal \"ende Gaza-konflikten\". De 21 punkter er kogt ned til 20. Punkterne kredser om flere problemstillinger i krigen, men blandt de mest opsigtvækkende er der først og fremmest et krav om, at krigen straks skal afsluttes, hvis begge parter accepterer. Det gælder altså en komplet indstilling af eksempelvis luftangreb. Et andet punkt stiller krav til Israel om, at landet hverken må annektere eller besætte Gaza som en del af krigens afslutning. Samtidig kræves det af Hamas, at samtlige tilbageværende gidsler - både levende og døde - skal tilbage til Israel indenfor tre døgn, hvis aftalen accepteres. Det vurderes ifølge BBC, at 20 gidsler i Gaza stadig er i live. Desuden får Hamas-medlemmer amnesti, hvis de lægger våbnene og forpligter sig til en fremtidig fredelig sameksistens mellem palæstinensere og israelere. Netanyahu siger ja, men... I aftes står Donald Trump side om side med Israels premierminister, Benjamin Netanyahu, under et pressemøde, der folder amerikanernes fredsplan ud. Her lyder det fra Netanyahu, at Israel støtter Trumps plan for \"at afslutte krigen i Gaza\". - Det vil sikre, at Gaza aldrig igen udgør en trussel mod Israel, siger han. Netanyahu siger også, at Trumps plan på mange måder stemmer overens med Israels. Det understreges dog fra Netanyahu, at Israel vil \"færdiggøre\" arbejdet, hvis Hamas afviser aftalen. Det kan gøres \"på den nemme eller den hårde måde\", lyder det. Men her til morgen får den israelske pibe en anden lyd. Nu siger Netanyahu blandt andet, at en fremtidig palæstinensisk stat ikke indgår i 20-punkts-planen. Men punkt 19 i Trumps plan siger netop, at mens genopbygningen af Gaza skrider frem, kan betingelserne endelig være til stede for en troværdig vej mod palæstinensisk selvbestemmelse og statsdannelse. Hvad siger Hamas? Spørgsmålet til 1.000 kroner er nu, hvad Hamas siger til planen. Indtil videre er der få meldinger fra bevægelsen, der opererer med en både politisk og militær gren i Gaza. Men spørger man Sune Haugbølle, professor i mellemøststudier på Roskilde Universitet, så siger hans mavefornemmelse, \"at de seriøst vil overveje det den her gang\". Der er dog punkter i planen, som kan vokse sig til så store kameler, at de kan blive svære at sluge for Hamas, siger professoren. - De vil nok stejle over, at den langsigtede plan for Gaza skal overtages af en bestyrelse ledet af Donald Trump og med den tidligere britiske premierminister Tony Blair som medlem. Det passer ikke så godt med Hamas' idé om palæstinensisk suverænitet, lyder det fra Sune Haugbølle om punkt 9 i planen. Seneste melding fra Trump er ifølge BBC, at Hamas får \"tre til fire dage\" til at komme med et respons. Trump har tidligere udtalt, at Israel har hans fulde opbakning, hvis Hamas afviser. Sådan reagerer resten af verden Mens mange lige nu venter på at høre, hvad Hamas siger, har andre prominente statsledere blandet sig. Det gælder blandt andre udenrigsministrene fra De Forenede Arabiske Emirater, Saudi-Arabien, Qatar, Egypten, Jordan, Tyrkiet, Indonesien og Pakistan, der i en fælles erklæring byder Trumps \"lederskab og oprigtige bestræbelser på at afslutte krigen i Gaza\" velkommen. Det Palæstinensiske Selvstyre (PA) på Vestbredden har i en erklæring også udtrykt støtte til forslaget. Fra europæisk side er der også positive tilkendegivelser. Storbritanniens premierminister, Keir Starmer, \"opfordrer alle parter til at samles og samarbejde med den amerikanske administration for at færdiggøre aftalen\". Frankrigs Emmanuel Macron siger, at de er \"klar til at bidrage\", mens Spaniens premierminister, Pedro Sánchez, udtaler, at det er på tide, at \"volden ophører, at gidsler frigives, og at der gives humanitær adgang til civilbefolkningen\". Fra dansk side lyder det fra udenrigsminister Lars Løkke Rasmussen (M), at der \"endelig er håb for både israelere og palæstinensere om, at lidelserne og krigen snart kan være slut\". - Jeg opfordrer på det kraftigste alle parter og ikke mindst Hamas til at gribe chancen for fred nu, skriver han i en skriftlig kommentar til DR Nyheder.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:32.781906+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/udland/overblik-hvad-er-op-og-ned-i-usa-s-fredsplan-i-gaza",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c8432e21a457df25c66fcc425bd0a16b",
    "processed_at": "2025-09-30T17:33:10.383701",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a political plan for peace in Gaza and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/krimi/18-aarig-faengsles-for-roeveri-af-guldsmykker-paa-bornholm/10962130",
    "title": "18 - årig fængsles for røveri af guldsmykker på Bornholm",
    "text": "Retten på Bornholm har tirsdag varetægtsfængslet en 18-årig mand i to uger for et røveri af guld mandag. Det skriver TV 2 Bornholm. Den unge mand brugte ifølge sigtelsen en gaspistol til at frarøve sit offer en plade af guld, en dertilhørende guldkæde og en guldring. Røveriet skal være foregået på en adresse i Rønne. Mediet skriver, at den 18-årige i øvrigt er sigtet for besiddelse af et knojern, en totenschlæger, en jagtkniv og en isoleringskniv. Den unge mand erkendte, at han havde haft totenschlægeren, men ellers nægtede han sig skyldig. Ifølge den 18-årige var totenschlægeren til selvforsvar, lyder det. Mediet Bornholm.nu skriver, at offeret for røveriet var en 26-årig mand. Røveriet blev anmeldt til politiet klokken 22.35, lyder det videre. Den sigtede kærede varetægtsfængslingen på stedet, skriver TV 2 Bornholm.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:34.887816+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/krimi/18-aarig-faengsles-for-roeveri-af-guldsmykker-paa-bornholm/10962130",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "57d05c0f54b46fec4b381094d86a5001",
    "processed_at": "2025-09-30T17:33:10.383772",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a robbery and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293057/skynd-dig-fristen-for-nis2-registrering-af-din-virksomhed-udloeber-om-faa-timer",
    "title": "Skynd dig : Fristen for NIS2 - registrering af din virksomhed udløber om få timer",
    "text": "- Læs om fristen for NIS2. Få ubegrænset adgang til Computerworld Premium Opret et gratis intro-abonnement eller køb fuld adgang Allerede abonnent? Log ind her Gratis adgang i 14 dage Premium Intro Opret et gratis prøveabonnement og få adgang til alt Premium-indhold i 14 dage. Uden binding eller kreditkort. Kreditkort ikke nødvendigt Opret abonnement Det er gratis at oprette et Intro-abonnement, og du får adgang til Premium-artikler lige bagefter. Læs mere om Intro her. Vi sender et link til dig, som du skal anvende til at bekræfte oprettelsen. Indtast din og tryk opret. Tak for oprettelsen Vi har sendt dig en mail Du skal trykke på linket i mailen, for at færdiggøre oprettelsen. Premium i 1 måned 375 kr./mdr Ubegrænset adgang til alt Premium-indhold i 1 måned. Kan opsiges med kort varsel. Premium i 12 måneder 2.850 kr./år Billigste adgang til tusindvis af Premium-artikler. Ubegrænset adgang i 12 måneder. Hvis du vil vide mere om, hvad Computerworld Premium, så kan du læse om det her. Annonceindlæg fra DE-CIX Edge computing revolutionerer den måde, data behandles på, ved at bringe kapacitet og ydeevne tættere på dér, hvor der er behov for det. Navnenyt fra it-Danmark Signifly Netip A/S Norriq Danmark A/S Netip A/S Mest læste",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20250930T140000Z",
    "date_download": "2025-09-30T15:31:39.772074+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293057/skynd-dig-fristen-for-nis2-registrering-af-din-virksomhed-udloeber-om-faa-timer",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "89b5864e847719cb0739bb6b20a9deb3",
    "processed_at": "2025-09-30T17:33:10.383838",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the NIS2 registration deadline and related subscription services, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g2vy37j0vo",
    "title": "Nottingham Post launches legal challenge over Reform press ban",
    "text": "Newspaper launches legal challenge over Reform ban A local newspaper has launched a legal challenge against a Reform UK council leader's decision to refuse to speak to its reporters. Nottinghamshire County Council leader Mick Barton has not spoken to journalists from the Nottingham Post and its online arm, Nottinghamshire Live, since August. Now law firm CMS LLP has served the council with a legal letter on behalf of Reach, the organisation that runs the publisher, calling for the ban to be withdrawn. It comes after Barton lifted the ban for the three BBC-funded Local Democracy Reporting Service (LDRS) journalists, who work out of the publication. The context and scope of the ban has been unclear since it was introduced. 'Irrationality' According to the Post, an article about local government reorganisation, written by its agenda editor Oliver Pridmore, prompted the ban. The council previously told the BBC the ban barred Barton and his party's councillors from speaking to the Post and the LDRS reporters \"with immediate effect\". The authority also stopped sending press releases to the publication and inviting them to council events. But Barton later clarified the ban only applied to press releases and him personally. At the time, senior editor Natalie Fahy said she was \"very concerned\" by the \"unprecedented ban\". In response, Barton said the party would not \"allow misinformation to shape the narrative of our governance\". On Tuesday, the Post said the legal letter called for the ban to be withdrawn in full. It added the Post believed the decision to issue the ban was without legal basis \"due to its irrationality\". The Post believes the ban is in breach of local government regulations, Article 10 of the European Convention on Human Rights - in relation to freedom of expression - and the council's own councillor code of conduct. The publication did not wish to make further comment when contacted by the BBC. Meanwhile, on Monday, the LDRS confirmed Barton had lifted the ban for its three reporters following a private meeting between them and the authority's cabinet. It means these reporters will be added back into the authority's press mailing list, and will be able to engage in interviews with Reform councillors, as well as receiving invitations to events, according to the LDRS. Jason Gibbins, BBC Local News Partnerships editor, said: \"We welcome the reinstatement of Nottinghamshire Live's Local Democracy Reporters by the Reform-led council, but continue to urge for the full lifting of the ban on their remaining journalists. \"Free and fair journalism is vital to local democracy and must be upheld.\" Senior political figures - including deputy Reform leader Richard Tice and leader Nigel Farage - have commented on the ban, but so far no resolution has been found. Barton and the council have been contacted for comment, but neither responded at the time of publication. Follow BBC Nottingham on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:46.154580+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/c4g2vy37j0vo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "7d0c453212c30a53dcf31b6623c09737",
    "processed_at": "2025-09-30T17:33:10.383884",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a legal challenge regarding a local newspaper's access to a council leader and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/ce32dew3zxgo",
    "title": "Dad jailed after Kirkby shaken baby died four years later",
    "text": "Dad jailed after shaken baby died four years later The mother of a boy who died four years after his father shook him as a baby told the killer in court how their son \"suffered and struggled\" after the attack. Mehmet Tufan, 30, left five-week-old Leo Williams severely disabled and needing permanent round-the-clock care while looking after him alone at an address in Kirkby in April 2018. He previously admitted unlawfully causing grievous bodily harm (GBH) in 2019 and was jailed. However, in December 2022 Leo died at Claire's House Hospice in Liverpool from his injuries. Tufan, of Dovecot in Knowsley, Liverpool, has since admitted an additional charge of manslaughter and was jailed for six-and-a-half years at Liverpool Crown Court on Monday. Tufan had already served part of a two-year sentence imposed in 2019. The infant remained in intensive care for months, with his family not knowing if he was going to survive. However, Leo recovered to the point that he could go home, where he was cared for by his mother and her family. 'My everything' In a victim impact statement read in court on Monday, his mother said \"life would never be the same\" without her son. \"He was my everything and in a way he still is,\" she said. \"I suffered greatly following this incident but knew I had to get up each day and continue fighting just like my boy.\" She said she would \"forever walk around with a piece of my heart missing\" and hoped to one day meet Leo again \"in a world where Leo no longer has pain, where he is free to run up to me and hug me just like it always should have been\". Addressing Tufan, she said: \"I want you to know how Leo struggled. I need you to know how he was left to live after that night. \"I lived every single day caring for Leo making him as comfortable and as loved as he possibly could be. \"It was incredibly painful for me and my family to see Leo in so much pain and suffering and knowing I could not take that pain way from him.\" Speaking after the sentencing, Det Sgt David Bruce called Leo a \"courageous young boy\". \"The injuries sustained by Leo changed his life and also the lives of his family, who continued to love and care for him in the most challenging of circumstances until the very end,\" he said. Listen to the best of BBC Radio Merseyside on BBC Sounds and follow BBC Merseyside on Facebook, X, and Instagram, and watch BBC North West Tonight on BBC iPlayer.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:46.639854+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/ce32dew3zxgo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "06621dc6b3b77bd5c966a61fbf1bb8a3",
    "processed_at": "2025-09-30T17:33:10.383925",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a father who was jailed for causing harm to his son, which is not related to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/sport/athletics/articles/cz9j079njejo",
    "title": "Laura Muir former coach Andrew Young banned for three years",
    "text": "Muir's former coach Young banned for three years - Published Olympic silver medallist Laura Muir has said she has put a \"difficult chapter firmly behind\" her after her former coach Andrew Young was banned for three years for \"serious misconduct\". A UK Athletics disciplinary panel found that Young - who Scotland's Muir stopped working with in 2023 - \"ignored medical advice\" and \"used manipulative and coercive behaviour towards those he coached\". One incident highlighted was when Young, \"following a disagreement, drove at speed with an athlete in his car before abandoning them at the roadside, disregarding their safety and wellbeing\". Other examples included \"requiring an athlete to compete against the clear advice of a physiotherapist, threatening to exclude athletes from training or races if they did not comply with his demands, and emotionally undermining those who raised concerns about injuries\". Young faced 39 charges and, in September 2024, a UKA disciplinary panel found nine of those proven \"wholly or in part\", with seven of them serious. He was then suspended for five years in a ban backdated to April 2023. Young appealed against the ruling and, while an independent panel expressed \"a slightly lesser view of the gravity of the misconduct overall\" in August 2025 and reduced his ban to three years, \"it rejected claims of bias, legal error and unfairness, and it confirmed the misconduct findings in full\". \"It agreed that seven of the breaches were serious and that revocation of his licence was necessary to protect athletes,\" said UKA. The governing body also said that Young would be required to \"complete training on athlete welfare, injury management and bullying/harassment before a return to coaching could be considered\". Muir, who won a silver medal in the 1,500m at the Olympics in Tokyo in 2021, is now being coached by Laura Weightman, while world indoor silver medallist Jemma Reekie - who had also been coached by Young - is now working with Jon Bigg. \"I have chosen to waive my anonymity and confirm my involvement in this case,\" said Muir. \"I fully support the decisions reached by both independent panels and I am grateful that the process has been followed through so thoroughly. \"I want to thank those who came forward and those who contributed to the process - it has not been easy, but it was necessary. \"Athletics has always been my passion, and I am pleased to say that I have rediscovered the love of my sport and the enjoyment of training and working within a supportive and positive coaching environment. \"I am now focused on the future, looking forward to the next few years of my career, and putting this difficult chapter firmly behind me.\"",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:31:47.746902+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/sport/athletics/articles/cz9j079njejo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2901cd66a5fc5cf82fd59c9c28b32920",
    "processed_at": "2025-09-30T17:33:10.383967",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the disciplinary actions taken against a coach in athletics and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/c0lke54g78jo",
    "title": "Church pastor who raped woman and abused children jailed for 14 years",
    "text": "Church pastor who raped woman and abused eight children jailed A church pastor who raped a woman and abused eight children across four decades has been jailed for 14 years. Rev James Haram, who had been with the Free Church of Scotland (Continuing), was found guilty of 19 charges of physical and sexual abuse. The attacks took place between 1997 and 2020 at addresses in Glasgow, Dumbarton and South Ayrshire. The 51-year-old from Dumbarton was found guilty after a trial at the High Court in Glasgow in August. The Free Church of Scotland (Continuing) is separate to the Free Church following a split in 2000. The court had heard how Haram raped, attacked and verbally abused the woman. This included suggesting she should kill herself. He also pressured her into sex while making biblical references. Jurors also heard evidence of Haram's child abuse, with one girl recalling how she was regularly beaten by the pastor. He also hit children with a wooden spoon or a rod and carried out \"modesty checks\" on girls to see what they were wearing. Betrayal of trust Judge Tom Hughes praised the victims for their \"brave testimonies\". He told Haram: \"During the time you were committing these offences, you were actively involved in religious practices. \"The congregation trusted you. They looked to you as their leader. While that was going on and you were doing your ministry work, you were actually committing appalling offences. \"You were betraying that trust and your position as a man of the cloth. \"You should have been a role model but, in reality, there was a darker, deeper side to you whereby you were involved in sexual and physically violent abuse.\" Haram was put on the sex offenders list for an indefinite period. He has also banned from approaching or contacting any of the victims.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:31:48.166186+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/c0lke54g78jo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "b41446284c357ebf61e11702c7c272b2",
    "processed_at": "2025-09-30T17:33:10.384005",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a church pastor who committed sexual abuse and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cx27drz0kg1o",
    "title": "Ibiza flooding : Rain deluges streets as red weather alert issued",
    "text": "Ibiza flooding: Rain deluges streets as red weather alert issued A red alert for rain has been issued by Spain's meteorological agency for the holiday islands of Ibiza and Formentera, with as much as 180mm (7in) of rainfall expected in a 12-hour window. The red alert for rain began at 11:00 local time (10:00 BST; 09:00 GMT) on Tuesday and is in place for several hours until 16:00. The Spanish island also issued a yellow alert for thunderstorms, from 08:00 until 18:00 on Tuesday. Firefighters in Ibiza were deployed to rescue people believed to be trapped inside their vehicles and homes, the island's local authorities said. Access to the towns of Sant Antoni de Portmany and Santa Eulària are closed, local media report, and Ibiza's E-10 main road is flooded. Mallorca, another Balearic island, is also at risk of heavy rainfall and floods with Spain's weather agency, known as Aemet, placing it under a yellow alert for rain and thunderstorms. Emergency services have warned of the risk of flooding and have urged people to avoid travelling and outdoor activities. Spanish media report that emergency services issued a telephone alert to those covered by the red alert, with people urged to avoid flood-prone areas, including low-lying ground and basements. They have also been warned to seek higher ground if water enters their homes. On Monday, an alert was in place on the Spanish mainland in Valencia as Storm Gabrielle struck the region. Aemet reported that between 160mm and 200mm of rain had fallen in six to eight hours around the Ebro delta. Schools were forced to close across the region. Authorities downgraded the threat of downpours there on Tuesday from a red alert to a yellow. It comes a year after Valencia experienced deadly and devastating floods, which claimed the lives of more than 230 people.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:31:48.204853+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cx27drz0kg1o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1556baad209e782f45a1852cdee984a0",
    "processed_at": "2025-09-30T17:33:10.384055",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses flooding in Ibiza and related weather alerts, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cx2j97n9ezlo",
    "title": "MSP Foysol Choudhury suspended by Labour over harassment claim",
    "text": "Suspended Labour MSP Foysol Choudhury accused of harassment MSP Foysol Choudhury has been suspended by Labour over an allegation of harassment, BBC Scotland News understands. The complaint against him was made by an individual who works in the Scottish Parliament. Choudhury, who has represented Lothian as an MSP for Labour since 2021, was suspended by the party at the weekend following an allegation of inappropriate conduct. A Labour Party spokesperson said that the party \"takes all complaints seriously\" and that they are investigated in line with its rules and procedures. Choudhury, who is sitting as an independent MSP, has been asked to comment. The Scottish Labour leader Anas Sarwar said on Monday that he could not provide any information about the complaint. He told BBC Radio's Good Morning Scotland programme that it was an independent process as he cited potential safeguarding and confidentiality issues. 'Swift action' Sarwar denied that Scottish Labour had issues with the behaviour of some of its MSPs, with Choudhury's suspension coming a month after MSP Colin Smyth was arrested and charged with possessing indecent images of children. Sarwar said his party had taken \"swift action\" after receiving a complaint about Smyth. He added: \"Now that we have had complaints come in about Foysol Choudhury and they merit an investigation, we've moved swiftly, the same day to suspend him and he now sits as an independent MSP.\" Choudhury, who was born in Bangladesh, is chairman of the Edinburgh and Lothians Regional Equality Council. He was one of the founding directors and is vice chairman of the multi-cultural festival Edinburgh Mela.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:31:48.803306+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cx2j97n9ezlo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9b27da925459491154f7e911bde40a4a",
    "processed_at": "2025-09-30T17:33:10.384115",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the suspension of a Labour MSP due to harassment allegations, which is unrelated to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/books/2025/sep/30/liverpool-poet-brian-patten-dies-at-79",
    "title": "Liverpool poet Brian Patten dies at 79",
    "text": "Brian Patten, who made his name in the 1960s as one of the most prominent Liverpool poets, has died, his agent has confirmed. He was 79. His poetry often featured lyrical explorations of love and relationships and he also wrote books for children. With his fellow Liverpool poets Roger McGough and Adrian Henri Patten published The Mersey Sound in 1967, which has sold more than a million copies. It has been credited as the most significant anthology of the 20th century in bringing poetry to a new audience, and is now a Penguin Classic. Patten was born in 1946 in Bootle, a working-class neighbourhood of Liverpool. “I was one of the last children to read at my primary school,” he said in 2014. “There was quite a violent, tense background at home … such claustrophobia. I just started writing to get things down, since there was no one to speak to.” Leaving Sefton Park secondary school at 15, he worked as a cub reporter on the Bootle Times and wrote occasional columns for the music paper the Mersey Beat. In one of his first pieces, he wrote about McGough and Henri. At 16, he edited a magazine, underdog, which published the work of Liverpool poets and was the first home of many of the poems that would appear later in the Mersey Sound anthology. The magazine also published Allen Ginsberg, the US beat poet who, arriving in Liverpool in May 1965, called the city “the centre of consciousness of the human universe”. Patten later said he thought Ginsberg “believed the centre of human consciousness to be wherever he was at the time”. Patten left at 18 and lived in Paris, earning money by writing poems on pavements in coloured chalk. In the late 60s he lived in Winchester with Brian Eno while he was at art college. In later life he moved to Devon. In 1967, aged 21, Patten published his first solo collection, Little Johnny’s Confession. His many later collections included Armada, an exploration of grief written in the wake of his mother’s death, and Love Poems, which his fellow poet Charles Causley remarked revealed a “sensibility profoundly aware of the ever-present possibility of the magical and the miraculous, as well as of the granite-hard realities”. Patten wrote many books for children including the poetry collection Gargling With Jelly and the novel Mr Moon’s Last Case. He edited The Puffin Book of Modern Children’s Verse. In a Guardian review of his 2000 children’s collection Juggling With Gerbils, Lindsey Fraser wrote that young readers would “love the whimsical musing” and Patten’s “airy brushes with anarchy”. Patten was awarded the freedom of the city of Liverpool together with McGough and Henri and in 2003 was made a fellow of the Royal Society of Literature. He is survived by his wife, Linda Cookson, the author of a critical evaluation of his work published by Liverpool University Press. “Every generation rebels against the one before”, Patten said in 2023. “It is necessary. One only hopes our best poems survive.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:50.769881+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/books/2025/sep/30/liverpool-poet-brian-patten-dies-at-79",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a6d49813680e7f99a3ed4b7a73063d6f",
    "processed_at": "2025-09-30T17:33:10.384466",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about the life and work of poet Brian Patten, focusing on his contributions to poetry and literature. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/2025/sep/30/afd-politician-former-aide-spying-china-maximilian-krah",
    "title": "AfD politician former aide convicted of spying for China | Germany",
    "text": "A former aide to a member of parliament for the far-right Alternative für Deutschland party has been sentenced to almost five years in prison for spying on behalf of China. Jian Guo was convicted on Tuesday of acting as an agent for the Chinese intelligence service while working for Maximilian Krah, a former member of the European parliament who now sits for the AfD in Germany’s Bundestag. The case has stirred concern about the extent to which Europe is being targeted by Chinese spymasters. Guo, a German national, was found to have gathered information including confidential documents when he worked in Krah’s office in the European parliament between 2019 and 2024, and passed them on to Chinese authorities. He had denied the charges. The court in Dresden heard he had collected personal information about top AfD figures, including its leaders, Alice Weidel and Tino Chrupalla, as well as keeping watch on Chinese dissidents in Europe. Sentencing Guo to four years and nine months in prison, the presiding judge, Hans Schlüter-Staats, told him: “There is no question that you were an employee of a Chinese intelligence service.” A female Chinese accomplice, identified only as Yaqi X in line with German privacy laws, received a suspended sentence of one year and nine months. She admitted to having given Guo information about flights, cargo and passengers from the Leipzig/Halle airport where she worked. In particular, the information had focused on the transport of military vehicles, troops and military drones, the court heard. Krah, 47, told the court he had employed Guo on the basis of his language skills and experience of running an import-export firm. Following Guo’s arrest, he said, he had “taken the necessary steps and significantly increased the security in my office”. The MP said he was not surprised by the prison sentence and had welcomed the trial, which had helped him to gain more clarity about people he said “of whom I have become a victim”. Separately, Dresden’s public prosecutor’s office is investigating Krah on suspicion of bribery and money laundering in connection with payments he is alleged to have received from China when he was an MEP. Earlier this month, the Bundestag lifted his immunity, allowing investigators to search his offices in the Bundestag, in Brussels and Dresden, and at his home. Krah has denied wrongdoing and called the investigation an “attempt at political intimidation”. Krah was excluded from the AfD’s European parliament delegation in 2024 due to the accusations against Guo, as well as comments he himself had made to the Italian newspaper La Repubblica that the SS, the Nazis’ main paramilitary force, were “not all criminals”. However, Krah was effectively rehabilitated seven months ago when he took a seat as an MP in the Bundestag after the AfD achieved its highest result yet in a national election. Beijing has previously denied accusations of espionage in Europe. Its foreign ministry last year said reports in Europe about Chinese spying were all “hyping up with an aim to smear and suppress China”.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:31:50.820341+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/2025/sep/30/afd-politician-former-aide-spying-china-maximilian-krah",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "29782d1b368239720d49479a694c615f",
    "processed_at": "2025-09-30T17:33:10.384537",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a political espionage case involving a former aide convicted of spying for China, with no mention or relevance to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/fashion/2025/sep/30/saint-laurent-ysl-old-threads-spins-something-new-paris-anthony-vaccarello",
    "title": "Saint Laurent takes YSL old threads and spins them into something new | Saint Laurent",
    "text": "The Saint Laurent show, which opened Paris fashion week on Monday night, began with a pussy-bow blouse and ended with a ruffled dress you could fold up, pac-a-mac style, and pop in your handbag. The label’s creative director, Anthony Vaccarello, is not known for practicality. But he can spin a story using clothes within 10 minutes. Here, under a perfectly clear night sky in front of the Eiffel Tower, an army of “mesdames” stalked a Parisian garden dressed – by the designer’s own admission – for cruising. The fashion industry is preoccupied with the run of new designers making their debuts at big brands this autumn, including Dior and Chanel in Paris. By contrast, this is Vaccarello’s 30th collection. But “while the clothes have been fab, in terms of set and concept, the debuts haven’t been what’s delivering the spectacle”, said Elektra Kotsoni, the deputy director of Vogue Business and Runway, before the show. “Perhaps then Paris is where it’s at?” Not many shows could build a catwalk in the shape of the famous YSL logo using white hydrangeas, and not many designers could draw Madonna, Catherine Deneuve and Carla Bruni Sarkozy, wearing a faux-fur coat (the brand banned fur in 2022) shortly after her husband, Nicolas Sarkozy, was sentenced to five years in prison. Vaccarello likes to take old codes from Yves Saint Laurent himself and spin them into something new. Pussy-bow blouses – so named because people tied ribbons around their cats in the 30s – were popularised by Yves when he dressed women in suits in the 1960s. Later worn by Margaret Thatcher, Nancy Reagan and Kamala Harris, they came to symbolise an “invasion” of typically male-dominated workplaces, particularly in politics. Paired here with voluminous leather blousons and caps, they took on a more sexualised overtone. Elsewhere, jewel-coloured nylon trench coats with just a pair of knickers underneath were a playful – if voyeuristic – spin on the classic YSL trench. As for the nylon gowns, which ballooned like parachutes as models walked, there was a small nod to Marie Antoinette. Practicality will only get Saint Laurent so far. If Saint Laurent gave us eveningwear, then Louis Vuitton decided what women want were nice clothes to wear at home. Labelled an “indoor wardrobe” by the designer backstage, the biggest brand in the world shut down the entire Louvre on Tuesday morning to hold the collection in the summer apartments of Anne of Austria, Louis XIV’s mother. “Comfort is not just about joggers,” said Louis Vuitton’s creative director, Nicolas Ghesquière, backstage. “It’s about intimacy.” On the clothes that meant nightgowns with relaxed corseting, ruffled bed jackets in buttery silk, removable collars and coffee-coloured bathrobes worn as coats. Flat shoes made of tapestry mimicked a carpet, the bright socks were fun, and shoulders were the main skin on show. Waistbands came loose or loosely tied with scarves or tassels, and there wasn’t a heel in sight. Louis Vuitton is a brand known for travel, and may struggle to sell the idea of indoor clothing at four-figure prices. “You can of course go outside in this,” added Ghesquière. “You have to imagine this is a trip around your apartment, though I know not every apartment is the Louvre.” Ghesquière has been at Louis Vuitton for over a decade, but is no stranger to viral attention. This year, the brand launched an absurdly expensive lipstick, a Labubu-esque bag charm, and dressed Melania Trump in a caramel leather suit at Windsor Castle. Down the road from the show venue is a Louis Vuitton cafe, which sells boiled eggs with monogrammed toast soldiers. You cannot afford Louis Vuitton, but you cannot avoid it either.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:31:50.865968+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/fashion/2025/sep/30/saint-laurent-ysl-old-threads-spins-something-new-paris-anthony-vaccarello",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "7ed441fc395e47ba2625640eef287cf8",
    "processed_at": "2025-09-30T17:33:10.384606",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a fashion show and the designs presented by Saint Laurent and Louis Vuitton, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cnn.com/2025/09/30/world/iran-deportation-us-intl",
    "title": "Dozens of Iranians to be deported from US to Iran , Tehran says",
    "text": "The United States will deport 120 Iranians back to Iran over the next two days, Iran’s state-affiliated media reported Tuesday, citing a foreign ministry official. Most of the group entered the US “illegally” through Mexico, the head of consular affairs at Iran’s foreign ministry, Hossein Noushabadi, told Tasnim news agency, adding that those deported will arrive to Iran through Qatar. The official said that the Iranian government has asked the US government to “be sensitive in respecting the rights of Iranian immigrants.” Iran has an “interest protection office” in the Pakistani embassy in Washington, DC. The New York Times first reported that the Trump administration will deport “around 100” Iranians after a deal was reached between the US and Iranian governments. The Times cited two senior Iranian officials involved in the negotiations and a US official familiar with the plans. The group is among 400 Iranians who “mostly entered the US illegally” and are slated for deportation, Noushabadi said. The official claimed that some of those being deported have valid residency permits in the US while the discussion to deport the immigrants was “on the agenda for several months.” Noushabadi said the group left Iran legally, and there will be no problem with their return. “How they entered the United States is another matter, but they left Iran legally. There is no obstacle to their return to their homeland, but Iran supports its own citizens,” he added. CNN has reached out to the Iranian government for comment.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:31:53.450924+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/09/30/world/iran-deportation-us-intl",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4fe9da6b445e00593a073a691c2c7ffc",
    "processed_at": "2025-09-30T17:33:10.384667",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the deportation of Iranians from the US to Iran and does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/drones-police-presence-utah-campus-kirk-shot-lacked-126065099",
    "title": "From drones to police presence , Utah campus where Kirk was shot lacked key public safety tools",
    "text": "From drones to police presence, Utah campus where Kirk was shot lacked key public safety tools The Utah university where Charlie Kirk was assassinated lacked several key public safety measures and practices that are standard security for events around the country The Utah college where conservative leader Charlie Kirk was assassinated lacked several key public safety measures and practices that have become standard safeguards for security at events around the country, an Associated Press review has found. Utah Valley University's outdoor courtyard, where Kirk showed up on Sept. 10 to debate students, was surrounded by several tall buildings, leaving Kirk vulnerable. That was made all the more potent because campus police didn't fly a drone to monitor rooftops or coordinate with local law enforcement to secure the event. It deployed only six officers from a force that was already small for a campus its size. There were no bag checks or metal detectors. A sniper took position on a nearby roof and killed Kirk with a single shot about 20 minutes after the event began, escaping notice from campus police. Security at Utah Valley University will come into sharper focus in the coming months as lawmakers and the public seek answers about what could have been done differently. “Absolutely there were security failures; it left him exposed,” said Greg Shaffer, who oversaw Kirk’s security from 2015 to 2022. “It was egregious enough that someone was able to take advantage and kill him.” In an interview, the AP asked the university president, Astrid Tuminez, if there was a security failure on campus surrounding the Kirk assassination. “Somebody was killed and that’s a tragedy, I think that’s what I would say right now,” she responded. Tuminez declined to answer more detailed questions about campus security, citing a pending external review. A university spokesperson also declined to answer questions about staffing, equipment, security planning and budgets. The day Kirk spoke at UVU, it was clear and sunny — the perfect weather for a drone to have had a clear view of the roofs of the surrounding buildings, including where the assassin fired a deadly shot from a bolt action rifle at Kirk from about 400 feet (122 meters) away. But no drone had been deployed, though security experts said rooftop sniper attacks were a clear threat. That was evident as recently as last year when a rooftop gunman in Butler, Pennsylvania, fired shots at a rally held by President Donald Trump during his campaign, killing one, injuring two and wounding Trump. Ty Richmond, president of event services for security firm Allied Universal, said the attempted assassination Trump exposed the risk of failing to secure elevated areas. He said drones, which cost as little as $2,000, and video surveillance should be part of the tools used to assess and address threats at any outdoor event. “It was either not done comprehensively or not done at all, because that should have been a natural ability to identify and detect any high ground risk and exposures that you would have in a situation like that,” Richmond said. The UVU campus had numerous cameras, including at least one overlooking the buildings around the courtyard. A university spokesperson declined to say whether someone was actively monitoring it or if it was operating. UVU has an enrollment of 48,000 students, though Tuminez said that includes 16,000 students who are in high school and don't take classes on campuses. The university has 23 police officers, or one for every 1,400 on-campus students, according to a 2024 UVU report. The average public university has around one officer for every 500 students, according to a 2024 U.S. Department of Justice study. “There is not a campus police department in this country that could provide the level of security necessary for a large scale outdoor event with 3,000 people,” said S. Daniel Carter, a campus safety consultant. “They would need help, typically from a local law enforcement agency.” UVU had six campus police officers present at the event along with Kirk’s personal security detail, campus police Chief Jeffrey Long said after the shooting. Utah County Attorney Jeffrey Gray said during a news conference that a UVU police officer had been watching the crowd from an “elevated position.” Officials at the Utah County Sheriff’s Office and Orem Police Department, both of which have drones, said they were not involved in security for the event. A UVU spokesperson said unlike other schools with larger security staffs, they don’t have dormitories to secure. However, other Utah schools of similar size with largely commuter populations have higher ratios of officers to students. Weber State University, a mostly commuter public school with more than 33,000 students, about half of whom are also enrolled in high school, has a public safety drone and 41 full and part-time police officers. And the University of Utah, with 36,000 primarily commuter students, has 46 officers. Overall spending on public safety varied at those universities in 2025 — $2.3 million at Weber State and $16.2 million at the University of Utah where a 2018 murder of a student led to more spending on security. UVU officials declined to share a current budget for their department, but a legislative audit showed $1.6 million was earmarked for public safety in 2020 out of a nearly $250 million campus budget. UVU, located between Salt Lake City suburbs and Brigham Young University in Provo, grew from a community college of less than 9,000 in the early 1990s to roughly 48,000 this year thanks to the addition of four-year degrees and campus expansions. But public safety failed to keep up, said two former campus public safety leaders. Both spoke on condition of anonymity because they feared repercussions. Val Peterson, UVU’s vice president for administration & strategic relations, rejected pleas for more safety resources, including hiring more officers and offering higher salaries to keep skilled personnel, the former public safety leaders said. Peterson, who is also a Republican state lawmaker leading state appropriations, oversees UVU’s public safety and has been with the university for more than 30 years. Both former campus public safety officials each recalled Peterson telling them multiple times in meetings related to public safety funding about a decade ago that because a shooting had not occurred on campus in decades, it would not happen in the future. Peterson believed the sleepy campus was safe from harm, they said. UVU's president declined to comment on Peterson's alleged remarks. Former UVU police Sgt. Bryan Cunningham also recalled those comments and, he said, officers warned the administration in budget discussions related to public safety that the campus could be the scene of an “active shooter nightmare” due to its layout and understaffed police department. Peterson did not respond to requests for comment sent by phone and email to his private and public offices. At the time of the shooting, the university was without a fire marshal to help plan for safety at large events. And as recently as 2023, two of the university’s three emergency radio channels did not meet state standards for signal strength, according to an internal review shared with the AP. The review did not include information about the third channel. Patchy reception was a serious problem that could hamper public safety personnel from coordinating during emergencies, one of the former campus public safety officials noted. The university boosted the signal at one building in the past year, Utah Communications Authority Executive Director Tina Mathieu said. She was not aware of any other improvements. A university spokesperson didn’t respond to questions about campus emergency radio signal strength. Utah lawmakers pushed to improve public school security after the deadly 2022 elementary school shooting in Uvalde, Texas, by creating a task force, appointing a state security chief and requiring an “armed guardian” be present at every public school. They also mandated all K-12 schools conduct rigorous safety assessments. Rep. Ryan Wilcox, a Republican who chairs the task force, introduced legislation this year to require public universities to conduct the same assessments, but the provision was removed by the state senate. “I don’t believe the provision in the bill would have changed the outcome of the current situation,” said Republican Sen. Ann Millner, who co-chairs the task force. She said that public universities should be entrusted to implement their own public safety practices “aligned with institutional realities\" and that any assessments would likely have taken a long time to complete. But Wilcox said the lack of mandatory security assessments can allow for vulnerabilities to go unnoticed: “Because those assessments haven’t been done, I don’t know what I don’t know about how prepared we are.\" \"We're going to learn everything we can possibly learn from that,\" he said of Kirk's death. \"It's a complete disaster.” ___ Associated Press reporter Claudia Lauer in Philadelphia contributed to this report. Brook is a corps member for The Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:32:00.555663+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/drones-police-presence-utah-campus-kirk-shot-lacked-126065099",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "89588a516f4e9440a637f58db810cfed",
    "processed_at": "2025-09-30T17:33:10.384779",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses public safety measures and security failures related to a shooting incident at a university. While it mentions the use of drones for monitoring, it does not focus on artificial intelligence or its applications, making it non-AI related.",
      "keywords": [
        "drones",
        "public safety",
        "security measures",
        "shooting incident"
      ]
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/doordash-expanding-restaurant-reservations-robot-deliveries-126075351",
    "title": "DoorDash is expanding into restaurant reservations and robot deliveries",
    "text": "DoorDash is expanding into restaurant reservations and robot deliveries DoorDash is adding restaurant reservations and robot deliveries to its menu in some U.S. markets SAN FRANCISCO -- SAN FRANCISCO (AP) — DoorDash is expanding its offerings, adding restaurant reservations and robot deliveries in some U.S. markets. The San Francisco-based company, already the largest U.S. delivery provider, announced its expansion plans Tuesday, saying it wants to bring even more business to the merchants it works with and stay ahead of ever-increasing customer demand. DoorDash's total orders jumped 20% to 761 million in the second quarter of this year. DoorDash's robots will bring new challenges to the company as it takes on the responsibility for storing and maintaining the devices. But DoorDash Co-Founder Stanley Tang said the company needs more delivery options to help fuel its future growth. “The shift to autonomy is happening right now, and DoorDash is uniquely positioned to do something like this,” Tang said Monday during an interview at the company’s San Francisco headquarters. “We need to find ways to keep up with the demand. The complexity of the deliveries being made on our platform is increasing too.\" But DoorDash's plans also threaten other delivery and reservation platforms like OpenTable and Instacart. On Monday, after DoorDash said it would expand its partnership with Kroger to offer delivery from the grocer’s 2,700 U.S. stores, DoorDash's shares jumped 4% while Instacart's fell 10%. DoorDash said Tuesday that its new “Going Out” tab will let users book tables at restaurants. Reservations will be offered first in New York and Miami, with other cities to be added later this year. In cities without restaurant reservation capabilities, the “Going Out” tab will let DoorDash customers earn rewards and in-store offers. DoorDash said its DashPass members – who pay $9.99 for free deliveries on most orders – will also get extra perks, like the ability to reserve exclusive tables. DoorDash signaled its interest in adding reservations with its recent purchase of SevenRooms, a New York company that makes reservation and hospitality management software. DoorDash announced the $1.2 billion purchase in March. DoorDash said adding reservations and deals helps it deepen its relationship with restaurants and bring them new patrons. During testing in San Francisco, the company found that 80% of customers using “Going Out” visited a restaurant they had never ordered food from before. DoorDash also said Tuesday it will soon begin providing deliveries in Phoenix with an autonomous robot. The robot, which was designed by DoorDash and is dubbed Dot, can reach speeds of up to 20 miles per hour and travel on streets, sidewalks and driveways. DoorDash has spent the last seven years developing the robot. The company decided to develop its own after finding that other delivery robots on the market, which are mostly designed for short runs on college campuses or urban sidewalks, weren’t capable of operating in the suburban neighborhoods where DoorDash makes many of its deliveries. The company said it could also use its own data to optimize the robot. “After 10 billion deliveries, we have data on what works, what breaks and what scales,” said Tang, who leads DoorDash's autonomy and robotics division. Dot is bright red and resembles a big baby stroller. It’s 3 feet wide, 4.5-feet tall and large enough to handle up to six large pizza boxes or 30 pounds of cargo. Tang said DoorDash has already made hundreds of successful deliveries with Dot during the past few months in the greater Phoenix area. If things continue to progress smoothly, DoorDash plans to bring Dot to more markets across the U.S. as quickly as possible, Tang said. DoorDash executives view Dot’s development as the next major step in an evolution that has already seen the company expand from a shoestring operation that was making a few restaurant deliveries in Palo Alto, California, 13 years ago. DoorDash has become a ubiquitous service that now operates in more than 30 countries. DoorDash has also been testing drone delivery for several years in Australia, Texas and North Carolina. Tang said the company is developing a system that will automatically determine the best mode of delivery depending on the order and where it's going. “Our vision is hybrid, human delivery and autonomy working together to expand access to more people,” Tang said. ___ Durbin reported from Detroit.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:32:00.794926+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/doordash-expanding-restaurant-reservations-robot-deliveries-126075351",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "100db5282e163cbb036a636068e1cb11",
    "processed_at": "2025-09-30T17:33:10.384855",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.9,
      "topic": "AI Robotics and Automation",
      "explanation": "OpenAI: The article discusses DoorDash's expansion into robot deliveries and the development of their autonomous delivery robot, Dot. It highlights the company's efforts to integrate robotics and automation into their delivery services, which are key aspects of AI technology.",
      "keywords": [
        "robot deliveries",
        "autonomous robot",
        "DoorDash",
        "delivery",
        "automation"
      ]
    }
  },
  {
    "url": "https://abcnews.go.com/Politics/wireStory/eric-adams-exit-means-nyc-mayors-race-126055336",
    "title": "What Eric Adam exit means for the NYC mayor race",
    "text": "What Eric Adams' exit means for the NYC mayor's race The race to be the next mayor of New York City is down to three main candidates after incumbent Eric Adams dropped his reelection bid over the weekend The race to be the next mayor of New York City is down to three main candidates after incumbent Eric Adams dropped his reelection bid over the weekend. Democratic nominee Zohran Mamdani, former Gov. Andrew Cuomo and Republican Curtis Sliwa are already looking to capitalize on Adams' exit, as the contest heads into its final stretch. It’s hard to predict what effect Adams’ departure will have on the race, but the impact could be minimal. Adams will remain on the ballot since the deadline to withdraw his name has passed, and polls conducted in September indicated that his support among New York City voters was low. Here is a look at what the contest's latest shakeup means going forward: Mamdani, a 33-year-old state lawmaker and self-described democratic socialist, became the presumed favorite in the race after beating Cuomo decisively in the primary. Cuomo and his supporters had called on both Adams and Sliwa to drop out of the race to set up what they argue would be a more favorable one-on-one rematch with Mamdani. Even Republican President Donald Trump has said he thinks the former Democratic governor has a better chance than Sliwa, deriding his own party’s candidate as “not exactly prime time.” Experts say Adams' exit alone might be too little too late to help Cuomo catch up. “I don’t know if this dramatically changes the overall narrative of the race,” said Basil Smikle, a Democratic political strategist and professor at Columbia University. “If it were earlier in the summer or after primary, I think there would have been a lot more time to frame that matchup between Cuomo and Mamdani.” But Cuomo said on Sunday night that the incumbent mayor dropping out “changes the entire dynamic of the race.” “There’s now more attention on just me and just Mr. Mamdani,\" he said. “It is a two-person race.” Trump waded into the race again Monday, threatening that New York City “won’t be getting any” federal money if frontrunner Mamdani is elected. “Remember, he needs the money from me, as President, in order to fulfill all of his FAKE Communist promises,” Trump wrote on social media. “He won’t be getting any of it, so what’s the point of voting for him?” Cuomo has repeatedly sought to send a similar message. After the president announced he was sending the National Guard into Washington, D.C., Cuomo warned that Trump will do the same thing to New York City if Mamadani takes office. “Trump will flatten him like a pancake,” Cuomo wrote on social media in August. Meanwhile, on Monday, Mamdani had already begun a renewed blitz to cast Cuomo as Trump’s candidate of choice in the heavily Democratic city. “We know that Andrew Cuomo will be the greatest thing that can happen for Donald Trump, because he isn’t simply clearing the way or looking to Andrew Cuomo out of a sincere belief in what Cuomo will present for the people of the city, that he, Cuomo will clear the way for Donald Trump’s agenda,” Mamdani told reporters Monday. Sliwa, the colorful founder of the Guardian Angels crime patrol group, has refused to end his campaign, even amid Trump's comments. “If you're going to do anything for Cuomo you've got to get Sliwa out, and Sliwa's not getting out,” said George Arzt, a veteran Democratic political consultant in New York. “It's not going to do anything unless you get Sliwa out, then it becomes interesting.” Sliwa, who lost the last mayoral election to Adams by almost 40 percentage points, cheered the mayor's exit from this year's contest. “I'm not sitting Shiva for Eric Adams,” he said Monday on Fox 5's “Good Day New York,” referring to the Jewish period of mourning. Asked if he would drop out, Sliwa pointed out that people had called on him after the Democratic primary to “drop out for Eric Adams.” “How did that work out?” he said, pointing directly into the camera. “I'm the only consistent candidate, and I'm in it to win it.” In his announcement Sunday, Adams said he was dropping out of the race because a now-dismissed federal corruption case made some in the city wary of him, while blaming \"constant media speculation” about his future for his inability to raise money and campaign. In the weeks before his exit, Adams had been approached by Trump administration intermediaries to see if he would end his campaign in exchange for a job in the federal government, in order to narrow the field for Cuomo. Adams will continue to serve out his term as mayor, campaign spokesperson Todd Shapiro said in a statement, but added that he will “take time to be with family and friends” over “the next few days.” Adams did not say what he plans to do after he leaves office, but said in his announcement video: “Although this is the end of my reelection campaign, it is not the end of my public service.”",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:32:01.092101+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/Politics/wireStory/eric-adams-exit-means-nyc-mayors-race-126055336",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "46377160f8bb138290ac3606caa1a93e",
    "processed_at": "2025-09-30T17:33:10.384924",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the political landscape of the NYC mayoral race and the implications of Eric Adams' exit, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/ukraine-begins-sharing-drone-expertise-denmark-deployment-zelenskyy-126073056",
    "title": "Ukraine begins sharing drone expertise with Denmark deployment , Zelenskyy says",
    "text": "Ukraine begins sharing drone expertise with Denmark deployment, Zelenskyy says Ukraine is sharing its expertise in drone defense with European countries KYIV, Ukraine -- The Ukrainian military is sharing with European countries its expertise in fighting Russian drones, sending a mission to Denmark for joint exercises, Ukraine President Volodymyr Zelenskyy said Tuesday. “Our military has begun deploying a mission in Denmark to disseminate Ukrainian experience in drone defense,\" Zelenskyy said. European defense ministers agreed last week to build what they called a “drone wall” along their borders with Russia and Ukraine to better detect, track and intercept drones violating Europe’s airspace. Europe’s readiness and technology are lagging far behind Ukraine and Russia, however, as cutting-edge drone warfare has become a hallmark of their three-year war since Moscow’s full-scale invasion of its neighbor. “Ukrainian (drone) experience is the most relevant in Europe right now, and it is our experience, our specialists, and our technologies that could become a key element of the future European ‘drone wall’ — a large-scale project that will guarantee safety in the sky,” Zelenskyy added in a post on Telegram. Denmark has in recent days reported drone sightings at military facilities and over Danish airports. Danish intelligence officials, though careful not to directly accuse a specific country, said they regarded the risk of Russian espionage and sabotage in Denmark as high. Poland has also turned to Ukraine for expertise after Russian drones entered Polish airspace. “The results of the (Ukrainian) mission in Denmark will shape the framework for cooperation with other European countries as well,” Zelenskyy said. The NATO military alliance is troubled, too, by European airspace violations by Russia warplanes that are further straining relations with Moscow and fueling fears that the fighting could spill beyond Ukraine’s borders. At the same time, there is uncertainty about peace negotiations that were set in motion by the United States months ago but appear to be making no headway. Ahead of two summits in the Danish capital Copenhagen this week, NATO is stepping up aerial surveillance in the Baltic Sea, while France, Germany and Sweden are bolstering Denmark’s air defenses. A Russian drone strike killed an entire family of four in a village in Ukraine’s northeastern Sumy region overnight, authorities said. The family was made up of a young married couple and their two sons, aged 4 and 6, regional administration head Oleh Hryhorov wrote on Telegram. “This is a terrible and irreparable loss for the entire community and the region,” Hryhorov said. “The death of the family … is a tragedy we will never forget or forgive.” Reacting to European plans to build a “drone wall” to protect itself from Russia, Kremlin spokesman Dmitry Peskov said Tuesday that “history shows that building walls is always bad.” “We are continuing to see such militarist approach instead of thinking how to engage in a dialogue and jointly search for security guarantees,” he told reporters. ___ Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:32:01.307322+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/ukraine-begins-sharing-drone-expertise-denmark-deployment-zelenskyy-126073056",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ebdc94b03ee0fa1c54d407e98bc41b11",
    "processed_at": "2025-09-30T17:33:10.385070",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses Ukraine's sharing of drone defense expertise with Denmark and European countries in the context of military operations and defense strategies. While drones are mentioned, the focus is on military tactics rather than artificial intelligence technology or applications.",
      "keywords": [
        "drone",
        "defense",
        "military",
        "Ukraine",
        "Denmark"
      ]
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/lally-weymouth-journalist-daughter-washington-posts-graham-family-126065834",
    "title": "Lally Weymouth , journalist and daughter of The Washington Post Graham family , has died",
    "text": "Lally Weymouth, journalist and daughter of The Washington Post's Graham family, has died Washington Post journalist Lally Weymouth has died at the age of 82 Lally Weymouth, the daughter of the late Washington Post publisher Katharine Graham who forged her own journalistic career that included interviewing Iraq's Saddam Hussein and Libya's Muammar Gaddafi among other world leaders, has died. She was 82. Weymouth died Monday at her home in Manhattan. The cause was pancreatic cancer, her daughter Katharine Weymouth told The Washington Post. Born Elizabeth Morris Graham, Lally Weymouth was most recently a senior associate editor at the paper. Her latest piece was an interview with Qatari Emir Mohammed bin Abdulrahman Al Thani that ran shortly before President Donald Trump visited his country in May. It appeared in the opinion section in her preferred question-and-answer format. Weymouth interviewed every Israeli prime minister since 1981, a biography posted on the paper's website said. She also interviewed Britain's then-Prime Minister Boris Johnson and Argentine President Javier Milei. She told the Washingtonian magazine in 2011 that her mother picked her brother Donald E. Graham to run the paper in the 1970s. “I didn’t want to go to the Post. I wanted to make it on my own,” she said. She said an editor for Newsweek — owned by her family — asked her to interview foreign leaders and suggested she make it her specialty. She also wrote for the Los Angeles Times. In 2015, the May Chidiac Foundation, a Lebanon-based nonprofit organization, awarded Weymouth their Antoine Choueiri Special Tribute for Lifetime Achievement. She edited and compiled “Thomas Jefferson: The Man, His World, His Influence” which was published in 1973. A book she authored, “America in 1876: The Way We Were,” was published three years later. Weymouth's grandfather, Don Graham, bought the venerable Washington Post at a 1933 bankruptcy sale. He boosted the paper’s reputation and tripled circulation before handing control in the 1940s to son-in-law, Philip L. Graham. Weymouth's mother took over after her husband's death in 1963. She was at the helm when the newspaper uncovered the Watergate story that led President Richard Nixon to resign. The family sold the paper to Amazon founder Jeff Bezos in 2013.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:32:01.597272+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/lally-weymouth-journalist-daughter-washington-posts-graham-family-126065834",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8389043c95dd515c5660d342ed763e98",
    "processed_at": "2025-09-30T17:33:10.385125",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about the life and career of journalist Lally Weymouth and does not discuss artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/Technology/wireStory/amazons-flying-rivers-weaken-tree-loss-scientists-warn-126075383",
    "title": "Amazon  flying river weaken , scientists warn of worsening droughts",
    "text": "Amazon's 'flying rivers' weaken, scientists warn of worsening droughts Scientists warn that “flying rivers” — invisible streams of moisture that carry rain from the Atlantic Ocean westward across the Amazon — are weakening as deforestation and climate change advance BOGOTA, Colombia -- Droughts have withered crops in Peru, fires have scorched the Amazon and hydroelectric dams in Ecuador have struggled to keep the lights on as rivers dry up. Scientists say the cause may lie high above the rainforest, where invisible “flying rivers” carry rain from the Atlantic Ocean across South America. New analysis warns that relentless deforestation is disrupting that water flow and suggests that continuing tree loss will worsen droughts in the southwestern Amazon and could eventually trigger those regions to shift from rainforest to drier savanna — grassland with far fewer trees. “These are the forces that actually create and sustain the Amazon rainforest,” said Matt Finer, a senior researcher with Amazon Conservation’s Monitoring of the Andean Amazon Project (MAAP), which tracks deforestation and climate threats across the basin and carried out the analysis. “If you break that pump by cutting down too much forest, the rains stop reaching where they need to go.” Most of the Amazon’s rainfall starts over the Atlantic Ocean. Moist air is pushed inland by steady winds that blow west along the equator, known as the trade winds. The forest then acts like a pump, effectively relaying the water thousands of miles westward as the trees absorb water, then release it back into the air. Brazilian climate scientist Carlos Nobre was among the early researchers who calculated how much of the water vapor from the Atlantic would move through and eventually out of the Amazon basin. He and colleagues coined the “flying rivers” term at a 2006 scientific meeting, and interest grew as scientists warned that a weakening of the rivers could push the Amazon into a tipping point where rainforest would turn to savanna. That's important because the Amazon rainforest is a vast storehouse for the carbon dioxide that largely drives the world's warming. Such a shift would devastate wildlife and Indigenous communities and threaten farming, water supplies and weather stability far beyond the region. The analysis by Finer's group found that southern Peru and northern Bolivia are especially vulnerable. During the dry season, flying rivers sweep across southern Brazil before reaching the Andes — precisely where deforestation is most intense. The loss of trees means less water vapor is carried westward, raising the risk of drought in iconic protected areas such as Peru’s Manu National Park. “Peru can do everything right to protect a place like Manu,” Finer said. “But if deforestation keeps cutting into the pump in Brazil, the rains that sustain it may never arrive.” Nobre said as much as 50% of rainfall in the western Amazon near the Andes depends on the flying rivers. Corine Vriesendorp, Amazon Conservation’s director of science based in Cusco, Peru, said the changes are already visible. “The last two years have brought the driest conditions the Amazon has ever seen,” Vriesendorp said. “Ecological calendars that Indigenous communities use — when to plant, when to fish, when animals reproduce — are increasingly out of sync. Having less and more unpredictable rain will have an even bigger impact on their lives than climate change is already having.” Farmers face failed harvests, Indigenous families struggle with disrupted fishing and hunting seasons and cities that rely on hydroelectric power see outages as the rivers that provide the power dry up. MAAP researchers found that rainfall patterns depend on when and where the flying rivers cross the basin. In the wet season, their northern route flows mostly over intact forests in Guyana, Suriname and northern Brazil, keeping the system strong. But in the dry season — when forests are already stressed by heat — the aerial rivers cut across southern Brazil, where deforestation fronts spread along highways and farms and there simply are fewer trees to help move the moisture along. “It’s during the dry months, when the forest most needs water, that the flying rivers are most disrupted,” Finer said. Finer pointed to roads that can accelerate deforestation, noting that the controversial BR-319 highway in Brazil — a project to pave a road through one of the last intact parts of the southern Amazon — could create an entirely new deforestation front. For years, scientists have warned about the Amazon tipping toward savannah. Finer said the new study complicates that picture. “It’s not a single, all-at-once collapse,” he said. “Certain areas, like the southwest Amazon, are more vulnerable and will feel the impacts first. And we’re already seeing early signs of rainfall reduction downwind of deforested areas.” Nobre said the risks are stark. Amazon forests have already lost about 17% of their cover, mostly to cattle and soy. Those ecosystems recycle far less water. “The dry season is now five weeks longer than it was 45 years ago, with 20 to 30% less rainfall,” he said. “If deforestation exceeds 20 to 25% and warming reaches 2 degrees Celsius, there’s no way to prevent the Amazon from reaching the tipping point.” Protecting intact forests, supporting Indigenous land rights and restoring deforested areas are the clearest paths forward, researchers say. “To avoid collapse we need zero deforestation, degradation and fires — immediately,” Nobre said. “And we must begin large-scale forest restoration, not less than half a million square kilometers. If we do that, and keep global warming below 2 degrees, we can still save the Amazon.” Finer said governments should consider new conservation categories specifically designed to protect flying rivers — safeguarding not just land but the atmospheric flows that make the rainforest possible. For Vriesendorp, that means regional cooperation. She praised Peru for creating vast parks and Indigenous reserves in the southeast, including Manu National Park. But, she said, “this can’t be solved by one country alone. Peru depends on Brazil, and Brazil depends on its neighbors. We need basin-wide solutions.” ___ The Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:32:01.853784+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/Technology/wireStory/amazons-flying-rivers-weaken-tree-loss-scientists-warn-126075383",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4d6c4d2d0f55b3675b275b18885a4cb1",
    "processed_at": "2025-09-30T17:33:10.385207",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses environmental issues related to the Amazon rainforest, specifically the impact of deforestation and climate change on 'flying rivers' and droughts. It does not mention artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/nepal-chooses-2-year-girl-new-living-goddess-126068153",
    "title": "Nepal chooses a 2 - year - old girl as new living goddess worshipped by both Hindus and Buddhists",
    "text": "Nepal chooses a 2-year-old girl as new living goddess worshipped by both Hindus and Buddhists A two-year-old girl has been chosen as Nepal's new living goddess, known as the Kumari KATHMANDU, Nepal -- A two-year-old girl chosen as Nepal’s new living goddess was carried by family members from their home in an alley in Kathmandu to a temple palace Tuesday during the country's longest and most significant Hindu festival. Aryatara Shakya, at 2 years and 8 months, was chosen as the new Kumari or “virgin goddess,” replacing the incumbent who is considered by tradition to become a mere mortal upon reaching puberty. Living goddesses are worshipped by both Hindus and Buddhists. The girls are selected between the ages of 2 and 4 and are required to have unblemished skin, hair, eyes and teeth. They should not be afraid of the dark. During religious festivals the living goddess is wheeled around on a chariot pulled by devotees. They always wear red, pin up their hair in topknots and a “third eye” is painted on their forehead. Family, friends and devotees paraded Shakya through the streets of Kathmandu on Tuesday, before entering the temple palace which will be her home for several years. Devotees lined up to touch the girls’ feet with their foreheads, the highest sign of respect among Hindus in the Himalayan nation, and offered her flowers and money. The new Kumari will bless devotees including the president on Thursday. “She was just my daughter yesterday, but today she is a goddess,” said her father Ananta Shakya. He said there were already signs she would be the goddess before her birth. “My wife during pregnancy dreamed that she was a goddess and we knew she was going to be someone very special,” he said. The former Kumari Trishna Shakya, now aged 11 years old, left from a rear entrance on a palanquin carried by her family and supporters. She became the living goddess in 2017. Tuesday is the eighth day of Dashain, a 15-day celebration of the victory of good over evil. Offices and schools are closed as people celebrate with their families. Kumaris live a sequestered life. They have few selected playmates and are allowed outside only a few times a year for festivals. Former Kumaris can face difficulties adjusting to normal life, learning to do chores and attending regular schools. According to Nepalese folklore, men who marry a former Kumari will die young, and so many girls remain unmarried. Over the past few years, there have been many changes in tradition and the Kumari is now allowed to receive an education from private tutors inside the temple palace and even have a television set. The government also now offers retired Kumaris a small monthly pension.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T144500Z",
    "date_download": "2025-09-30T15:32:02.135768+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/nepal-chooses-2-year-girl-new-living-goddess-126068153",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2fc07833b0c1613486a62ffe25c26172",
    "processed_at": "2025-09-30T17:33:10.385257",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the selection of a new living goddess in Nepal, focusing on cultural and religious practices rather than any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/news/tariffs-coffee-prices-gregorys-coffee/",
    "title": "Coffee chain grapples with tariffs as java prices boil over",
    "text": "Coffee chain grapples with tariffs as java prices boil over The first Gregory's Coffee opened in 2006 on Manhattan's Park Avenue. Nineteen years later, the family-owned business has expanded to over 54 locations around the U.S. as well as a roastery in Queens, New York, that handles coffee beans from Brazil, Rwanda, Nicaragua and other major global producers. For Gregory Zamfotis, founder of the New York City-based chain, the business is about more than just dollars and cents — it's also about recognizing the special place coffee has long had in American culture as a driver of social connections. \"Coffee is built into the fabric of our society,\" Zamfotis told CBS News. \"People come together over coffee. When it's a meeting or interview, or we just want to get some work done, coffee tends to be the centerpiece of those conversations.\" With many Americans still feeling the effects of elevated inflation, for many coffee drinkers one of those conversations is likely to center on the drink's soaring costs. Prices have leaped nearly 21% over the past 12 months, with the average retail price of 100% ground roast coffee recently reaching a record high of $8.87 per pound, up from $7.02 in January USDA data shows. Several factors are behind the spike in coffee prices, including droughts in Brazil and volatile weather in other regions where the bean is cultivated. More recently, heavy U.S. tariffs on coffee-producing countries — including a hefty 50% levy on Brazil — have also driven up prices. Though coffee is a staple of American daily life, the vast majority of the beans is imported. Much of that is sourced from Latin America, with Brazil alone accounting for 35%, according to the U.S. Department of Agriculture. By contrast, the U.S. produces relatively little coffee compared to the rest of the world. Hawaii, the top-producing state, harvested 21 million pounds during the 2024–25 season, according to the USDA. Yet Americans consumed a whopping 3.3 billion pounds of coffee during the same period, the agency said. \"Prices are going to have to go up\" Jake Leonti, director of coffee at Gregory's Coffee, said it's also far pricier to grow and produce coffee in the U.S. \"It's exponentially [more] expensive because it's Americans farming,\" he said. \"Whereas we can get super high-quality coffee from different parts of the world at a price that's much more friendly to the consumer.\" Gregory's Coffee has not raised prices yet despite the jump in costs. But Leonti said that could change soon. \"Prices are going to have to go up — there's no other way around it,\" he said. \"We're seeing tariffs from the places where we get our bags printed as well. So everything around the coffee business is getting tariffs at some point.\" Like other retailers, Gregory's prices vary depending on where a store is located, reflecting regional labor and other costs. In New York City, the chain charges $3.45 for a regular cup of coffee, while at its New Jersey and Washington, D.C., outlets the same item runs $3.15. Other retailers are also preparing for increased coffee costs. Mark Smucker, CEO of The J.M. Smucker Co., whose portfolio includes the Folgers Coffee, Café Bustelo and Dunkin' at-home brands, said during the company's fourth-quarter earnings call in June that prices will likely increase for a third time this year \"due to higher green coffee costs.\" Meanwhile, Starbucks Chief Financial Officer Catherine R. Smith said during the company's third-quarter earnings call in July that, due to the company's coffee buying and hedging practices, customers shouldn't expect price increases until the first half of fiscal 2026. At Gregory's Coffee, \"The last thing we want to do is just keep raising prices on our guests,\" Zamfotis said. \"We're hoping that if prices go up a few pennies across the board, that doesn't turn off our everyday customers. We're not doing this to make more money — we're doing this to protect our business.\"",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:04.391247+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/news/tariffs-coffee-prices-gregorys-coffee/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8c1d03e6882b0dd77b1950c6109ac169",
    "processed_at": "2025-09-30T17:33:10.385323",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the coffee industry, pricing, tariffs, and the cultural significance of coffee in American society. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/news/poland-ukrainian-nord-stream-gas-pipeline-explosions-arrest/",
    "title": "Poland detains Ukrainian over 2022 Nord Stream gas pipeline explosions",
    "text": "Poland detains Ukrainian over 2022 Nord Stream gas pipeline explosions A Ukrainian man suspected of being involved in causing undersea explosions that damaged the Nord Stream gas pipelines between Russia and Germany in 2022 was arrested in Poland, a spokesperson for the District Prosecutor's Office in Warsaw said Tuesday. Volodymyr Z. was detained in Pruszkow, central Poland, according to Polish radio station RMF FM, which first reported his capture. He has been transferred to prosecutors in Warsaw. The man, whose full name wasn't released due to privacy rules, was detained on a European arrest warrant issued by German authorities, said Piotr Antoni Skiba, a spokesperson for the Warsaw prosecutor's office. Tymoteusz Paprocki, the suspect's lawyer, confirmed the arrest, according to local media and the AFP news agency. \"In the morning hours, my client was detained in one of the towns near Warsaw as a result of a European Arrest Warrant, which was issued by the German side and pertains to matters related to Nord Stream 2,\" Paprocki told local broadcaster TVN24. A spokesperson for Germany's federal prosecutor did not immediately return a request for comment Tuesday. Another Ukrainian man was arrested in Italy last month in connection with the explosions on the undersea pipelines, which were built to carry Russian natural gas to Germany under the Baltic Sea. \"Taking into consideration the full-scale war in Ukraine and the fact that Nord Stream is owned by the Russian company Gazprom, which finances these activities, the defense currently does not see any possibility of pressing charges against anyone who participated in these events,\" Tymoteusz Paprocki, Volodymyr Z.'s lawyer, told RMF FM. The lawyer said it was not certain whether his client was involved in the sabotage act and he was awaiting official information about the intentions of the German justice system in pressing charges. The defense would fight his extradition from Poland, the lawyer said. The undersea explosions on Sept. 26, 2022, damaged the Nord Stream pipelines and added to tension over the war in Ukraine as European countries moved to wean themselves off Russian energy sources. According to RMF FM, German authorities say Volodymyr Z. is a diving instructor who, in September 2022, sailed to the Baltic Sea on a yacht, from which he dove underwater and placed explosives on the pipeline.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:04.430098+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/news/poland-ukrainian-nord-stream-gas-pipeline-explosions-arrest/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d4e168ee6e4fb4093ef79f2d80c0e735",
    "processed_at": "2025-09-30T17:33:10.385357",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the detention of a Ukrainian man in connection with the Nord Stream gas pipeline explosions, which is unrelated to artificial intelligence. It focuses on legal and geopolitical issues rather than AI topics.",
      "keywords": []
    }
  },
  {
    "url": "http://www.cbsnews.com/news/mortgage-rate-pros-and-cons-october-2025/",
    "title": "Mortgage rate pros and cons to know this October",
    "text": "Mortgage rate pros and cons to know this October Mortgage interest rates plunged to their lowest level in three years in September, and while they've ticked up slightly since the middle of the month, they now enter October at a significantly lower position than they were at earlier in 2025. According to FreddieMac, the average rate on a 30-year mortgage term is now just 6.30%, materially lower than the plus-7% range mortgage rates hovered near at the start of the year. So there's understandable motivation for homebuyers to become reengaged, especially if they've been sitting on the sidelines in recent years in anticipation of a cooler mortgage rate climate. However, that doesn't mean they should rush into the process either. Rates are still significantly higher than they were at the start of the decade, when they were cut repeatedly during the height of the pandemic. And there's no way to tell exactly where they're headed long-term, either. Understanding this dynamic, homebuyers should familiarize themselves with some timely mortgage rate pros and cons this October, specifically. By understanding these four items, they can better determine their next steps (or lack thereof). Below, we'll detail four that are worth knowing right now. Start by seeing how low your current mortgage rate offers are here. Mortgage rate pros and cons to know this October While each homebuyer's circumstances and goals are different, many can benefit from understanding these timely mortgage rate pros and cons this October: Pro: Mortgage rates are lower than they've been in years Mortgage rates briefly fell to an average of 6.13% on a 30-year term earlier this month, and while they did tick up in the week after, they're still lower overall than they've been in years, offering homebuyers new, more affordable opportunities. Take the time, then, to pull your credit report and review your credit score to make sure you're in as favorable a position as possible to take advantage. Today's rates could easily change, perhaps even sooner than expected, so it makes sense to exploit the cooler rate climate while you still can. Compare rates and lenders online to learn more. Con: Volatility could cause them to spike again Mortgage rates are driven by more than just the Federal Reserve. Factors such as the 10-year Treasury yield, inflation, unemployment and more can all impact the rates lenders offer borrowers. And volatility in one or more of these spaces could cause rates to spike again, effectively closing this brief window of opportunity. It's worth remembering that mortgage rates plunged to a two-year low in September 2024, also following a Fed rate cut then, before rising again. So be aware of the potential risks of waiting, as today's low rates aren't guaranteed, even for creditworthy borrowers. Pro: Another rate cut looks likely for the end of October Around 90%. That's the chance the Fed cuts rates again at the end of its next meeting on October 29, according to the CME Group's FedWatch tool. And while the Fed is just one factor influencing mortgage rates, it's a significant one. Many lenders may not even wait for that cut to become official before adjusting their rate offers downward. Keep an eye on the rate climate in the weeks leading up to the central bank's next meeting, then, for an opportunity to act. Con: Homebuying in the fall can be difficult The most popular time traditionally to buy a home is in the spring. This allows for better house hunting weather and, when timed right, an opportunity to close and move into the new house during the summer months when school is out and vacation is robust. But the fall isn't that. Home inventory may weaken as many existing homeowners elect to keep their plans as they are through the upcoming holiday season. Opportunities to view homes, attend open houses and complete the banking requirements needed for home purchasing can also be limited during this season. That all said, today's low rates may not last much longer, so this con will need to be weighed against the cost-effectiveness of a home purchase now, anyway. The bottom line New, low mortgage rates offer new chances for homebuyers. However, they will need to be viewed through the prism of homebuying in October 2025, which is markedly different compared to October 2020 and a bit different than October 2024, too. By evaluating these pros and cons, and by speaking with a mortgage broker or real estate agent, prospective buyers can better determine if waiting is the smart move or if they can finally feel confident reentering the purchasing climate.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:04.765120+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "http://www.cbsnews.com/news/mortgage-rate-pros-and-cons-october-2025/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6f3cc8e7c3cf8bcf204f4ce1fd6707eb",
    "processed_at": "2025-09-30T17:33:10.385395",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses mortgage rates and homebuying, with no mention of artificial intelligence or related topics. It focuses entirely on financial aspects and market conditions.",
      "keywords": []
    }
  },
  {
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/youtube-settlement-trump-lawsuit-rcna234660",
    "title": "YouTube $24 million settlement with Trump is part of an unsettling pattern",
    "text": "In the immediate aftermath of the Jan. 6 attack, Donald Trump was short on friends. Congressional Republicans kept their distance; businesses denounced the political violence he instigated; and tech giants scrambled to take down his accounts, fearing that the outgoing president might use their platforms to further destabilize the United States. That included YouTube, which banned Trump in the immediate aftermath of his riot at the Capitol, concluding that his channel raised “concerns about the ongoing potential for violence.” The Republican’s account was reinstated in 2023, but he nevertheless proceeded with a lawsuit against YouTube and its parent company, Alphabet’s Google. This week that case was resolved with a settlement. NBC News reported: YouTube said Monday it would settle a lawsuit brought by President Donald Trump for more than $24 million, adding to a growing list of settlements with tech and media companies that have amassed millions of dollars for Trump’s projects. ... A notice of settlement for Trump’s lawsuit against YouTube details that $22 million of it will go toward building a new White House ballroom. Soon after the settlement agreement was announced, the president mocked YouTube online and said the 2021 ban was “illegal.” (It was not and the legal dispute was a civil case, not a criminal one.) Mark Graber, a professor at the University of Maryland’s Carey School of Law, told The Wall Street Journal, “There is a reason to settle, but it has little to do with the law. The present Supreme Court doctrine is very clear that private companies need not give anyone a right of access.” But, Graber added, major companies that are regulated by the Trump administration have a corporate motivation to resolve these disputes: “If you’re Meta or Google, $25 million is lunch money. It is probably worth $25 million in lunch money to make this go away.” That detail helps summarize why there have been so many of these settlements in response to Trump’s weak civil suits, including $25 million from Meta, roughly $10 million from the company formerly known as Twitter, $16 million from Paramount Global and $16 million from ABC/Disney. In each instance, Trump filed dubious lawsuits. In each instance, legal experts offered public commentary that suggested the cases were likely to fail. In each instance, the companies wrote eight-figure checks anyway. People who know me often ask whether or not I’m surprised by what Trump and his team have done this year. The answer, in general, is no: I’ve been a little surprised by the speed at which the president and his operation have advanced — traditionally, the authoritarian model doesn’t move quite this quickly — but Trump ran on a radical and undemocratic platform, and he’s now executing those plans. What I have been surprised by is how the eager the elite institutions are to appease the president, as law firms, universities and corporate giants capitulate at every turn. “One by one, American leaders supposedly committed to principles of free speech, due process, democracy, and equality have abandoned those ideals when menaced by the Trump administration,” The Atlantic’s Adam Serwer summarized last week. These cascading acts of cowardice from the people best positioned to resist Trump’s authoritarian power grabs have made Trump seem exponentially more powerful than he actually is, sapping strength from others who might have discovered the courage to stand up. “Defending democracy requires a collective refusal to acquiesce to lawless behavior from many different sectors of society. All of these powerful people trying to save their own skin have effectively multiplied Trump’s attacks on constitutional government, by enhancing a false sense of inevitability and invincibility,” Serwer added. Former Vice President Kamala Harris told Rachel Maddow last week, “I always believed that if push came to shove, those titans of industry would be guardrails for our democracy, for the importance of sustaining democratic institutions.” I believed that, too. But fear among executives who’ve come to expect politicized agencies and administrative corruption has brought us — swiftly — to this unexpected point.",
    "domain": "msnbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:07.072717+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "msnbc.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.msnbc.com/rachel-maddow-show/maddowblog/youtube-settlement-trump-lawsuit-rcna234660",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2a6f07337e282ab259390ec08e90b20b",
    "processed_at": "2025-09-30T17:33:10.385472",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a legal settlement involving Donald Trump and YouTube, focusing on political and corporate responses rather than any artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/us/michigan-church-shooters-romance-history-emerges-suspects-father-apologizes-victims-families",
    "title": "Father apologizes for son Michigan Mormon church shooting attack",
    "text": "GRAND BLANC, Mich. – The father of the man responsible for driving a truck into a Mormon church in Michigan before opening fire on congregants apologized for his son's actions on Monday. The father, Thomas Sanford, told the Detroit Free Press that the situation is a \"nightmare.\" Neighbors and members of the community in Grand Blanc, Michigan expressed shock and sorrow in interviews with Fox News Digital. Investigators have not determined a specific motive for the shooter, also named Thomas Sanford, as new details emerge about his romantic life and alleged anti-Mormon prejudice. \"I feel terrible about all the families that have been hurt and they're under the same crap that I'm going under, that my wife and I are going under,\" the elder Sanford said. \"I apologize for that.\" Sanford added that his son \"loved the United States\" and was a \"family man.\" ATTACKS ON US CHURCHES HAVE RISEN SIGNIFICANTLY SINCE 2021, REPORT FINDS \"The only thing I can say is that it was my son that did it,\" Sanford said. \"As far as why? Irrelevant. It happened. We're dealing with it. It's been a nightmare.\" Online images of the shooter's home showed a campaign sign for President Donald Trump on its fence, but the sign was not present when Fox News Digital saw the home on Monday. FBI INVESTIGATING MICHIGAN CHURCH SHOOTING AS 'TARGETED' VIOLENCE Neighbors of Sanford's father said they were aware of the attack but didn't speculate about the man's motive. \"It's just awful,\" the neighbor said, declining to be named. Local city council candidate Kris Johns told Fox News that he spoke to Sanford just days before his attack and that the conversation veered toward extreme anti-Mormon rhetoric. Sanford referred to Mormonism as \"the anti-Christ\" during their talk, Johns said. Past acquaintances of Sanford's say he had no such prejudice earlier in his life. Sandra Winter, who says she was Sanford's landlady in Utah for roughly 10 months in 2010, said he dated and nearly married a Mormon woman during his time there. Winter said she knew Sanford well and that he was considering joining the Mormon church in order to further his relationship with the girlfriend. She added that the woman's family was \"pretty gung ho about the idea.\" Despite all this, Winter said Sanford one day abruptly left without explanation. Another Grand Blanc community member told Fox News Digital that he was at the police academy and watched national media descend on Grand Blanc after the attack. \"You see this stuff happening all over and think it can't happen here. And then suddenly it does,\" he said. He went on to argue that media coverage of the shooting only adds \"fuel to the fire,\" by giving notoriety to the attacker. As of Tuesday, at least four people are dead, seven are in stable condition in the wake of Sanford's attack. \"It's all about forgiveness,\" the Grand Blanc resident told Fox. \"I'm not a Mormon but I'm a Christian, and I'm mourning right along with them.\" Several local Christian churches have offered their support to the Mormon community in the wake of Sunday's attack. Grand Blanc's The River Church held a prayer service Sunday night, while St. Christopher's Episcopal Church offered to share its facilities for worship services. CLICK HERE TO GET THE FOX NEWS APP \"We are all God's children,\" St. Christopher's wrote in a statement.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T140000Z",
    "date_download": "2025-09-30T15:32:09.562351+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/us/michigan-church-shooters-romance-history-emerges-suspects-father-apologizes-victims-families",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "45cac613202b5767027aac28fd684790",
    "processed_at": "2025-09-30T17:33:10.385572",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a violent incident involving a shooting at a church and the subsequent reactions from the community and the shooter's family. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/politics/users-manual-likely-government-shutdown-tonight",
    "title": "User manual to the government shutdown set to begin Wednesday",
    "text": "A government shutdown is all but assured to begin at 12:01 a.m. ET Wednesday. The Senate will take a test vote to break a filibuster on a House-passed interim spending bill later today. But that needs 60 yeas. That means Democratic votes are necessary, and that’s why the government likely shuts down. The House is not even in session this week. Plus, Yom Kippur begins Wednesday night at sundown. That means the government is closed for a minimum of several days. The last time the government shut down was in 2018-2019. That 35-day shutdown was the longest in history. The Trump administration will determine which agencies and services are essential. For instance, those in the military, national security and intelligence personnel remain on the job. Lawmakers must be paid, under the 27th Amendment to the Constitution. National Parks and museums usually close. However, the Postal Service continues to operate. Passport processing usually stops. Air traffic controllers continue to work. But they aren’t paid until there’s a resolution. The government continues to pay Social Security and other retirement or health benefits. But, there’s always the possibility that federal workers who process those checks could refuse to come to work if they’re not getting paid and a shutdown drags on. There’s often a tipping point in each government shutdown that triggers both sides to lay down their political swords and forge an agreement. That returns everyone to work. In 2013, U.S. Capitol Police officers were still on the job without pay when they got involved in a high-speed chase and shooting that started at the White House and wound up near the Hart Senate Office Building. Officers were injured in the mayhem. That prompted lawmakers from both sides to sober up and re-open the government. Growing concern about aviation safety helped end a 2019 shutdown. Air traffic controllers worked for more than a month without pay. A small group of controllers elected to stay home. That prompted a temporary shutdown at LaGuardia Airport in New York. Issues also materialized in Newark, N.J., Atlanta and Philadelphia. Fear of a major air disaster prompted lawmakers and the first Trump administration to terminate the shutdown. Who prevails in government shutdowns? It’s hard to gauge the political benefit. It’s widely believed that former President Bill Clinton won his standoff with former House Speaker Newt Gingrich, R-Ga., in 1995-1996. Clinton rode easily to reelection in the fall of 1996. Gingrich seemed to bleed support on Capitol Hill after the shutdown. But Gingrich secured significant spending reforms that ultimately resulted in a federal surplus a few years later. And Republicans maintained control of the House and Senate in 1996. CLICK HERE TO GET THE FOX NEWS APP Sen. Ted Cruz, R-Texas, engineered the 2013 shutdown over repealing Obamacare. Obamacare remains the law of the land. Cruz won reelection in 2018. Democrats didn’t flip the House in the 2014 midterms as Republicans expanded their majority, and the GOP gained control of the Senate. The 2018-2019 shutdown started even before the House and Senate swore in freshmen elected in the 2018 midterms. So divining a political impact from that particular shutdown is challenging. A host of other factors — including the COVID-19 pandemic — were much bigger than the shutdown by the time we got to November 2020. Trump lost reelection that year. Democrats maintained control of the House in 2020. And Democrats narrowly flipped the Senate.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:09.653072+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/politics/users-manual-likely-government-shutdown-tonight",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "23e3329c1b3a23eeb8ff2ec0aac1f2c0",
    "processed_at": "2025-09-30T17:33:10.385663",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a government shutdown and its implications, with no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/opinion/battle-americas-future-must-begin-again-places-weve-written-off",
    "title": "PASTOR COREY BROOKS : Why I see potential for renewal in struggling Trenton , NJ streets",
    "text": "I was continuing on my Walk Across America when I stopped on a cracked sidewalk in Trenton, New Jersey, and stared up at a bridge that’s seen better days. Its steel spine carries a motto that still packs a punch: Trenton Makes, the World Takes. Those words aren’t just a slogan. They’re a battle cry from a time when this city’s pulse was the bustle of factories, the hum of machines and the sweat of men and women who built something real— something that mattered. From here, steel, rubber and ceramic material flowed out, shaping the world beyond the river. That was Trenton’s pride, its soul. Walk these streets now, and you feel the weight of what’s been lost. The factories are gone — hollow ghosts, like the dreams of the people left behind. Where industry once stood, poverty now sits. Where jobs gave life, drugs and gunfire, now write the story. Boarded-up houses stare back like empty eyes. The bridge still proclaims its motto, but it feels like a cruel reminder of a city that used to be. WITHOUT GOD, NEW YORK'S DREAM TURNS HOLLOW. MY WALK ACROSS AMERICA PROVES IT I know this story. I live it on the South Side of Chicago. Same script, different stage. Industry packed up, left town and took hope with it. Families splintered. Streets turned mean. Kids who should be dreaming of college are dodging bullets instead. Trenton, Chicago—pick your city. Too many carry this scar. But I’m not here to mourn what’s gone. I’m here to fight for what’s possible. Standing in Trenton’s shadow, I see more than ruin. I see a spark that refuses to die. This city, like so many others, isn’t just a graveyard of the American Dream — it’s a battlefield for its revival. Think about it: If America could forge steel to build bridges, why can’t we forge opportunity to build lives? If we could raise factories to churn out goods, why not raise up centers where kids learn to thrive in the modern world, where hope gets a second chance? We didn’t just make things in this country — we made futures. We can do it again. This isn’t just about Trenton. It’s about every corner of America where despair has settled in like dust. This isn’t just about Trenton. It’s about every corner of America where despair has settled in like dust. It’s about the kids who’ve never seen a clear path to something better, only the haze of violence and want. I’m walking across this country—Times Square to Santa Monica Pier, one stubborn step at a time—because I believe we can carve out those paths of opportunity. CLICK HERE FOR MORE FOX NEWS OPINION There’s a passage in the Bible, in the book of Ezekiel where God shows the prophet a valley of dry bones, picked clean by time and neglect. He asks, \"Can these bones live?\" Ezekiel, honest, says he doesn’t know. God tells him to speak to the bones, to call them back to life. And they rise—bones knitting together, flesh forming, breath rushing in. Death turns to life. A valley of nothing becomes an army of something. That’s what I see in Trenton. In Chicago. In every place we’ve written off. Those dry bones can live. These streets can breathe again. But it won’t happen if we sit back and wait for someone else to fix it. Governments can’t do this alone. Money won’t patch broken systems. It’s on us — regular people, you and me — to build, to mentor, to show up. To say: This kid, this block, this city — it’s worth fighting for. CLICK HERE TO GET THE FOX NEWS APP Trenton’s motto doesn’t have to be a faded postcard from the past. It can be a dare for the future. Not just Trenton Makes, the World Takes, but Trenton Builds, America Rises. If we can do it here, we can do it anywhere.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:09.816203+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/opinion/battle-americas-future-must-begin-again-places-weve-written-off",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ad8c4a7f199e8a2d96dd2c8ff0383842",
    "processed_at": "2025-09-30T17:33:10.385762",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses social issues, urban renewal, and personal experiences related to struggling cities in America, with no mention or relevance to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/world-nation/story/2025-09-30/dallas-ice-facility-shooting-second-victim",
    "title": "Family says a Mexican man shot at a Dallas ICE facility has died , becoming attack second victim",
    "text": "Family says a Mexican man shot at a Dallas ICE facility has died, becoming attack’s second victim - Share via DALLAS — A second detainee shot in an attack on a Dallas immigration field office last week has died, his family said Tuesday. In a statement shared by the League of United Latin American Citizens, the family confirmed that Miguel Ángel García-Hernández, 32, succumbed to his injuries after being removed from life support. The Mexican man was one of three detainees shot in the Sept. 24 attack on an Immigration and Customs Enforcement facility in Dallas. That attack left one man dead and two other detainees critically wounded. Officials previously identified the man who was killed in the attack as Norlan Guzman-Fuentes. Authorities have said the gunman, 29-year-old Joshua Jahn, fired indiscriminately from a nearby rooftop. They said he hated the U.S. government and wanted to incite terror by killing federal agents. No ICE personnel were hurt in the shooting, and Jahn fatally shot himself following the assault. The gunman who opened fire on an Immigration and Customs Enforcement facility in Dallas hated the U.S. government and wanted to incite terror by killing federal agents, officials said. The attack happened as heightened immigration enforcement has generated a backlash against ICE agents and stirred fear in immigrant communities across the country. “My husband Miguel was a good man, a loving father, and the provider for our family,” Stephany Gauffeny said in the statement. “We had just bought our first home together, and he worked hard every single day to make sure our children had what they needed. His death is a senseless tragedy that has left our family shattered. I do not know how to explain to our children that their father is gone.” Gauffeny is expecting their fifth child, LULAC said.",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T140000Z",
    "date_download": "2025-09-30T15:32:11.945096+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/world-nation/story/2025-09-30/dallas-ice-facility-shooting-second-victim",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "cbe48816ada127fc86dd30aa6b8dbfde",
    "processed_at": "2025-09-30T17:33:10.385932",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a violent incident involving a shooting at an ICE facility and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/CGX-T/",
    "title": "Cineplex Inc ( CGX - T ) Stock Price and News",
    "text": "Cineplex Inc(CGX-T)TSX Day Low11.66 Day High11.91 Open:11.91 Previous Close 52-Week High/Low Volume Average Volume Price/Earnings (TTM) Forward Annual Dividend & Yield Market Capitalization, $M 5-Day Change TOP STORIES: Cineplex Inc Profile Cineplex Inc is a diversified media company that operates chains of movie theaters. The company has three reporting segments: film entertainment and content, media and amusement and leisure. The film entertainment and content segment include Theatre Exhibition, Theatre Food Services, Alternative Programming & Distribution and Digital Commerce. Media segment includes Cinema and Digital Place-Based Media. Amusement and leisure segment includes Location Based Entertainment. Key revenue is generated from Film Entertainment and Content.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T141500Z",
    "date_download": "2025-09-30T15:32:14.972608+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/investing/markets/stocks/CGX-T/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "bf318838b5313016a162f0c60ddceed3",
    "processed_at": "2025-09-30T17:33:10.385971",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses Cineplex Inc, a media company focused on movie theaters and entertainment, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.adweek.com/creativity/beats-couldnt-pick-just-one-nfl-player-for-its-ad-so-they-have-to-earn-it/",
    "title": "Beats Couldnt Pick Just One NFL Player For Its Ad – So They Have to Earn It",
    "text": "Beats put its new product to the test with three pro athletes vying to be its next ambassador. The only problem is, they all think they’ve got the job. Powerbeats Fit, the new Beats earbuds, launched today with a comic campaign featuring NFL stars Saquon Barkley, Justin Jefferson, and Jayden Daniels. Created by Mirimar, “They Stay in Your Ears” follows the trio as they compete against each other in a tough audition process for the latest Beats ad, arranged by a slimy agent who promises each they’re his “favorite” client. Each athlete must recite a line while performing on the field, and simultaneously show the ability of both the Powerbeats Fit and the Powerbeats Pro 2 (released earlier this year) to remain comfortably in ears. Barkley and Jefferson impress in training but stumble on the big payoff line (you’ll never guess what it is). Daniels, however, proves to be a natural. An evolution of the fitness-forward Beats Fit Pro earbuds, the Powerbeats Fits’ main upgrade is a revolutionary, flexible wingtip design allowing them to stay in place, even in the middle of an intense workout or training session. Adaptive EQ technology automatically adjusts sound frequency based on environment and preferences. So, if a coach is on the touchline yelling instructions, you can hear them. There’s also Active Noise Cancellation to block everything out and allow for full focus. Sweat-and water-resistant, the earbuds can handle training in the rain, heat, or snow and come in four colors: Jet Black, Gravel Gray, Spark Orange, and Power Pink. Beats has looked to position its earbud products as a crucial part of any athlete’s kit, as important as a pair of sneakers. “They Stay in Your Ears”, which will run globally, follows the “Listen to Your Heart” campaign to launch Powerbeats Pro 2 in February, featuring another trio of sports superstars: basketball’s LeBron James, soccer’s Lionel Messi, and baseball’s Shohei Ohtani. Last year’s Fit Pro ad saw Manchester City soccer star Erling Haaland training in snow-covered Norwegian woods in the company of wolves, while other Beats lifestyle products have been endorsed by stars such as Kim Kardashian and Lil Wayne.",
    "domain": "adweek.com",
    "domain_category": "advertising and commercial",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:17.847303+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "adweek.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.adweek.com/creativity/beats-couldnt-pick-just-one-nfl-player-for-its-ad-so-they-have-to-earn-it/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "31fba0bcc5c74886c128343b760f9d21",
    "processed_at": "2025-09-30T17:33:10.386024",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a marketing campaign for Beats earbuds featuring NFL players, with no significant focus on artificial intelligence or related technologies. While it mentions 'Adaptive EQ technology' and 'Active Noise Cancellation', these are not central to the article's theme and do not constitute a discussion of AI.",
      "keywords": [
        "Beats",
        "earbuds",
        "Adaptive EQ technology",
        "Active Noise Cancellation",
        "NFL players"
      ]
    }
  },
  {
    "url": "https://www.adweek.com/creativity/gaps-newest-celeb-ambassadors-are-gwyneth-paltrow-and-daughter-apple-martin/",
    "title": "Gap Newest Celeb Ambassadors Are Gwyneth Paltrow and Daughter Apple Martin",
    "text": "Gap has revealed its new celebrity brand ambassadors, and it’s a family affair: Gwyneth Paltrow and her daughter, Apple Martin. The mother-daughter duo star in GapStudio’s fall/winter campaign, modeling a new collection that’s inspired by 1960s futurism and 1990s downtown New York fashion icons like Paltrow, Grace Jones, Tina Turner, Carolyn Bessette-Kennedy, and Sofia Coppola. In Gap’s film, Paltrow and Martin reflect on their relationship, unique styles, and sharing clothes. Photographer Mario Sorrenti shot the ads, with creative direction by Zac Posen, executive vice president and creative director of Gap Inc. “Gap has always been known for campaigns that bridge generations and shape culture,” Mark Breitbard, president and CEO of Gap brand, said in a statement. “From our iconic ’90s ads to today, we’ve celebrated original talent—both accomplished and emerging—to inspire self-expression. Partnering with Gwyneth and Apple continues that legacy, offering a fresh perspective on timeless design.” Posen added that the pair demonstrates “how clothing moves through time, borrowed, reinterpreted, and made personal.” Paltrow and Martin are the latest in a line of high-profile advertising stars who are helping to reinvigorate Gap’s brand. Last month, the retailer enlisted global girl group Katseye for its viral fall campaign. Parker Posey, another 1990s icon, featured in Gap’s spring 2025 ad. The brand has also worked with Gen Z stars including Troye Sivan and Tyla, while refreshing its famous dance commercials to evoke nostalgia with a modern edge. Gap’s marketing revamp began with the arrival of former Mattel exec Richard Dickson as CEO of parent company Gap Inc. in 2023. Posen and chief marketing officer Fabiola Torres joined in 2024. The company reported flat second-quarter sales, up to $3.73 billion from $3.72 billion a year earlier, and said it expected President Donald Trump’s tariffs to cost it between $150 million and $175 million this year.",
    "domain": "adweek.com",
    "domain_category": "advertising and commercial",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:18.063105+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "adweek.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.adweek.com/creativity/gaps-newest-celeb-ambassadors-are-gwyneth-paltrow-and-daughter-apple-martin/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "003d32974c04e47d2a01d88f968be5ba",
    "processed_at": "2025-09-30T17:33:10.386071",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses Gap's new celebrity brand ambassadors and their marketing campaign, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.adweek.com/creativity/heineken-turns-seoul-rooftops-into-urban-community-spaces/",
    "title": "Heineken Turns Seoul Rooftops Into Urban Community Spaces",
    "text": "While cities are crowded and vibrant, life there can feel isolated for residents. More than half (57%) of city dwellers in London, Seoul, Tokyo, New York, Paris, and Sydney reported feeling lonely often, despite living in densely populated areas, according to a Heineken-commissioned OnePoll survey. The beer giant is tackling urban isolation by turning overlooked spaces into hubs of connection. “Rooftop Revival,” created by agency LePub, is Heineken’s latest effort to encourage in-person social connections. Heineken launched its project in a place that exemplifies this urban paradox: Seoul, South Korea, one of the largest cities in the world. When viewed from above, Seoul also has a high number of flat rooftops, many of which are painted the same color green of Heineken’s brand. The Dutch brewer transformed some of those rooftops into spaces for social events. More than 8,000 people across three days applied to attend the events, which included a set from Dino, singer of K-Pop group Seventeen; a design workshop with contemporary artist Cha Inchul; and an interactive food tasting with celebrated chef Cho Seohyeoung. Inspired by pyeong-sang, a traditional Korean wooden platform used for outdoor socializing, Heineken blended this tradition with its logo and branded each space with red-star parasols. Each parasol held an icebox and Bluetooth speakers. Aerial photographer Tom Hegen documented the process of transforming the rooftops, and his photos will be used in out-of-home ads appearing in Seoul in the coming weeks. “We may not be able to redesign entire cities, but we can inspire people to rethink the spaces around them. By reviving overlooked rooftops into vibrant hubs, we’re creating places where people can connect, create, and celebrate together,” Nabil Nasser, global head of Heineken said in a statement. “Our red star against a green backdrop isn’t just an icon… It’s a calling card for communities to come together, share experiences, and rediscover the joy of social connection over an ice cold beer.”",
    "domain": "adweek.com",
    "domain_category": "advertising and commercial",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:18.429795+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "adweek.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.adweek.com/creativity/heineken-turns-seoul-rooftops-into-urban-community-spaces/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8ba9b4f0f62066f333b4e0b676da3861",
    "processed_at": "2025-09-30T17:33:10.386181",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses Heineken's initiative to transform urban rooftops into community spaces, focusing on social connections and urban isolation. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.poynter.org/fact-checking/2025/how-many-vaccines-do-kids-babies-get/",
    "title": "Trump said kids get 80 vaccines . The real number isnt close",
    "text": "President Donald Trump repeatedly exaggerated the number of vaccines recommended for small children, comparing it with vaccinating a horse. “They give — I mean, for a little baby to be injected with that much fluid?” Trump first said Sept. 21 during an Air Force One press gaggle. “Even beyond the actual ingredients, they have sometimes 80 different vaccines … It’s like you’re shooting up a horse.” He used the number four more times during a Sept. 22 press conference in which he also pushed an unproven link between autism and Tylenol. “You have a little child, little fragile child, that you get a vat of 80 different vaccines, I guess, 80 different blends, and they pump it in,” he said. Then again: “It’s like 80 different vaccines and beyond vaccines and 80. Then you give that to a little kid.” How many vaccines do young children actually receive? It’s not 80, by any measure. The White House didn’t respond to our questions about how Trump arrived at that number. But because Trump’s comments referred to “little” kids and babies, we tallied the overall number of recommended childhood vaccines for children ages 10 and under in four ways: by the number of vaccine formulations a child receives; by the number of diseases the vaccines protect against; by the total number of doses each child receives of all the recommended vaccine formulations; and by the number of physical injections or shots a child would receive if following the recommended vaccination schedule. No matter how we counted, the number of vaccines a young child receives didn’t reach Trump’s claim of 80. CDC schedule recommends 11 vaccines for kids 10 and younger Over a child’s first year of life, the Centers for Disease Control and Prevention recommends seven different vaccine formulations, plus an annual flu vaccine. They are: - Hepatitis B - RSV (respiratory syncytial virus), if not yet given to the mother in pregnancy - DTaP (diphtheria, tetanus, and pertussis) - Polio - Hib (Haemophilus influenzae type B) - PCV (Pneumococcal disease) - Rotavirus By age 2, children will get their first of two doses of varicella (chickenpox), hepatitis A and MMR (measles, mumps, rubella). By age 6, children who follow the recommended vaccination schedule and receive all doses of the 10 recommended vaccines will be fully vaccinated against 14 diseases. Starting when a baby is 6 months old, annual flu vaccines are recommended with two doses the first time. That bumps the total to 11 vaccines, and 15 diseases. Trump’s CDC no longer recommends annual COVID-19 vaccination for all children but patients can still receive the vaccine after consulting with a health care provider. The Food and Drug Administration, meanwhile, approved the vaccine for kids 6 months and older with underlying health conditions. The American Academy of Pediatrics, which publishes its own vaccine schedule, still recommends annual COVID-19 vaccines for all people 6 months and older. If including COVID-19 vaccines, the total vaccines for children comes to 12, with some protection against 16 diseases. The next batch of vaccines starts when children are 11 to 13 years old. Up to four more vaccines are recommended at this age to protect against HPV (human papillomavirus) and meningococcal types A, C, W, and Y. Children in this age group also get a tetanus, diphtheria and acellular pertussis booster called Tdap. If they are at high risk, children this age are also recommended to get the meningococcal B vaccine. When it comes to total doses for children 10 and under, the US vaccine schedule calls for 30 to 52 Many childhood vaccines are not given all at once, but spread out over several doses. For example, the CDC recommends three doses of the hepatitis B vaccine, one at birth, and one each at 2 and 6 months. Other vaccines are given in up to four to five separate doses. Sometimes the same vaccine can be administered in a two- or three-dose series. “For most vaccines, multiple doses are because we’ve shown that fewer doses than whatever is in the schedule is not fully protective,” said Dr. James Campbell, a University of Maryland pediatrician and infectious disease expert. The reasons behind timing and frequency of doses depends on the vaccine. Take DTaP. The first three doses given to infants trains their immune system to recognize and defend against the infection. Those doses do create a protective response, but the more long-lasting protection comes when they get a booster as toddlers. “They make more mature, what we call memory B cells, which means long lasting protection,” said Campbell, “So if a long time after that, they were to be exposed, they would then be able to respond.” In the case of the measles, mumps and rubella vaccine, the second recommended dose isn’t meant to boost but rather catch “primary failures,” or the 2% to 7% of people who don’t get an immune response from the first dose. “It’s just a matter of what induces the best immune response,” said Dr. Paul Offit, a Children’s Hospital of Philadelphia pediatrician and infectious disease expert. We added up all the doses recommended in the childhood vaccine schedule for kids 10 and under. Assuming the most robust dosing series (for example, opting for a four-dose series over a three-dose series), a 10-year-old could receive 30 doses of vaccines. That would be 52 doses if a child receives every single annual flu and COVID-19 vaccine, including two of each their first year. The closest we got to the 80 vaccines that Trump referenced was to count every single dose of every vaccine separately, including each annual flu and COVID-19 shot from birth to age 18. That adds up to 72 doses, half of which are COVID-19 and flu, among all kids, including tweens and teenagers, not only the little kids and babies that Trump talked about. Different vaccine doses are often administered together in one shot Fifty-two vaccine doses rarely means 52 shots in a kid’s arm. That’s because many childhood vaccine doses can be delivered in combination vaccines, in which one syringe can contain several vaccines. Other times vaccines can be given orally, like rotavirus, or via nasal spray, like the flu vaccine. Here’s an example: A baby at its two-month appointment is recommended to get doses of six different vaccines. Using a combination vaccine, the child can receive all six vaccinations in the form of two injections and one oral administration by way of drops. “We’ve worked for a long time, over decades, to figure out which vaccines can go together in the same needle and syringe and still be safe and still immunogenic and protective, meaning you don’t have any worse protection by putting them together,” Campbell said. Vaccines such as MMR are offered only as a combination in the U.S. “We agree that we want to reduce the number of shots,” said Dr. Flor Muñoz, associate professor of pediatrics, infectious diseases and molecular virology at Baylor College of Medicine. “We’ve been successful at doing that with combination vaccines to protect against more diseases.” Using combination vaccines does not overload children’s bodies with “liquid” as Trump was concerned about though. For infants, the standard is, at most, half a milliliter to a milliliter — or about 1/10 to 1/5 of one teaspoon. “It’s tiny, and babies tolerate it perfectly fine,” Campbell said. Our ruling On multiple occasions Trump said “little” kids and “little” babies are given “80 different vaccines.” According to the current CDC recommended vaccine schedule, a 10-year-old child could receive up to 12 different vaccine formulations, protecting from 16 different diseases. Those vaccines could be administered in up to 52 separate doses, but almost certainly less than 52 injections because many vaccines are delivered in one shot. None of those numbers equals 80 different vaccines. We rate this claim False. This fact check was originally published by PolitiFact, which is part of the Poynter Institute. See the sources for this fact check here.",
    "domain": "poynter.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20250930T140000Z",
    "date_download": "2025-09-30T15:32:28.208416+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "poynter.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.poynter.org/fact-checking/2025/how-many-vaccines-do-kids-babies-get/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "adeaec7b151b5689954bcc434b10cd47",
    "processed_at": "2025-09-30T17:33:10.386500",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses vaccines and statements made by Donald Trump regarding their numbers, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/shopping/news/stanley-tucci-cashmere-collection-n-peal-shop-online-1236534801/",
    "title": "Stanley Tucci Cashmere Collection With N . Peal : Shop Online",
    "text": "Stanley Tucci Pulled Inspiration From Alfred Hitchcock’s ‘North by Northwest’ for His New Cashmere Collection If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission. Before stepping back into the fashion industry as Nigel in “The Devil Wears Prada, Stanley Tucci is bringing his signature sophistication to the cashmere world. The Emmy and Golden Globe–winning actor has teamed with British luxury knitwear house N.Peal on an exclusive AW25 capsule collection entitled “The Art of Travelling.” The 13-piece line reimagines the modern man’s wardrobe through Tucci’s lens, drawing inspiration from his lifelong passion for craftsmanship, international travel and timeless design. “As a boy the idea of international travel was thrilling to me,” Tucci said in a statement, citing Alfred Hitchcock’s “North by Northwest” as a style touchstone. “This collection was inspired by the kind of pieces I always reach for when I travel: reliable, timeless and beautifully made. The exact pieces N.Peal excel at making.” The range leans into N.Peal’s heritage in cashmere while nodding to Tucci’s Italian roots with fine fabrics and a rich palette. Navy, olive and chocolate brown are accented by what the brand calls “Tucci orange,” a hue inspired by the colors in his father’s paintings. The capsule includes tailored outerwear, knitwear, and even a playful set of cashmere travel socks designed to elevate long-haul flights and hotel downtime. To launch the collection, N.Peal tapped photographer Matt Holyoak to shoot a cinematic campaign aboard the British Pullman train, a nod to the Golden Age of Travel. Founded in Mayfair’s Burlington Arcade in 1936, N.Peal has a long history of Hollywood ties, from dressing Cary Grant and Marilyn Monroe to James Bond in the modern era. The Tucci collaboration, which marks his first foray into menswear design, arrives at N.Peal boutiques worldwide, online at npeal.com and exclusively at Mr. Porter beginning today.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:40.301535+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/shopping/news/stanley-tucci-cashmere-collection-n-peal-shop-online-1236534801/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e74faa9aa3535b4ddec205624443769c",
    "processed_at": "2025-09-30T17:33:10.386548",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a fashion collection by Stanley Tucci and does not mention artificial intelligence or related topics. It focuses on fashion design, craftsmanship, and travel inspiration.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/shopping/news/dune-part-two-photography-book-behind-the-scenes-buy-online-1236534819/",
    "title": "Dune : Part Two Photo Book : BTS Photos , Austin Butler Foreword",
    "text": "This ‘Dune: Part Two’ Book Features Never-Before-Seen Set Photos and a Foreword by Austin Butler If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission. Denis Villeneuve’s Dune: Part Two” is getting the coffee-table treatment. Insight Editions will publish “Dune Part Two: The Photography” on Nov. 4, a 240-page volume of behind-the-scenes images captured by longtime set photographer Niko Tavernise. It’s now available to pre-order on Amazon. The book, which features a foreword by Austin Butler and a preface by Oscar-winning cinematographer Greig Fraser, offers an intimate look at the production of Villeneuve’s blockbuster. Tavernise, who has worked on films including “Joker,” “Black Swan” and “West Side Story,” followed the cast and crew across locations in Budapest, Altivole, Jordan and Abu Dhabi, assembling a visual archive of the film’s global footprint. Collected from thousands of frames shot on set, the volume includes candid moments between Villeneuve and his ensemble — Timothée Chalamet, Zendaya, Rebecca Ferguson, Javier Bardem, Josh Brolin, Butler and Florence Pugh among them — as well as sweeping views of the desert landscapes and monumental sets that define the adaptation of Frank Herbert’s sci-fi classic. The sequel was nominated in five categories at the 97th Academy Awards, including Best Cinematography for Fraser. It took home wins for Best Sound and Best Visual Effects, Tavernise has previously published his work in Variety, The New York Times, Los Angeles Times and Entertainment Weekly, but this marks his most extensive published collection tied to a single film. Positioned as both a collector’s piece and a document of the filmmaking process, the book arrives as “Dune: Part Two” continues its awards-season campaign following its spring release. “Dune Part Two: The Photography” is available for preorder now through Insight Editions and major booksellers such as Amazon, with a retail price of $60. Check out a few of the never-before-seen images featured in the book below:",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:40.994384+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/shopping/news/dune-part-two-photography-book-behind-the-scenes-buy-online-1236534819/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e7c3013d710c1302dbb3344a58784312",
    "processed_at": "2025-09-30T17:33:10.386606",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a photography book related to the film 'Dune: Part Two' and does not mention artificial intelligence or any AI-related topics. It focuses on behind-the-scenes content and the filmmaking process.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/shop/how-to-watch-mlb-playoffs-online-1235083064/",
    "title": "How to Watch MLB Playoffs 2025 Online , Wild Card , Streaming , Baseball",
    "text": "MLB Playoffs 2025: How to Watch Postseason Baseball Games Online Without Cable for Free If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission. The MLB Playoffs are officially underway, with dozens of must-watch postseason games on the schedule. The playoffs begin with the Wild Card Series the Detroit Tigers taking on the Cleveland Guardians at Progressive Field in Cleveland, Ohio. Game 1 starts at 1:08 p.m. ET/10 a.m. PT on Tuesday, Sept. 30 on ESPN. The games broadcast across ESPN, ESPN2, ABC, Fox, FS1, MLB Network and TBS. And luckily, you don’t need cable to catch the action. A variety of services livestream postseason games, from Fubo, Sling TV, DirecTV and Hulu + Live TV. Check out a complete schedule for the 2025 MLB Playoffs here. Below, you’ll find the the best ways to tune into the games so you don’t miss a thing. Starting at $49.99 for the first month ($84.99 per month), DirecTV’s Entertainment TV package includes ESPN, ESPN2, ABC, Fox, FS1, MLB Network and TBS. The entry-level plan comes with more than 90 channels, unlimited cloud DVR, unlimited streams on your home network, up to three streams away from home, and an additional 90 free channels. Get DirecTV 5-day free trial here. Access ESPN, ESPN2, ABC, Fox, FS1 and TBS, with a subscription to Sling Orange + Blue — which goes for $33 for the first month of service ($65.99 per month afterwards). The package gets you access to top cable channels, on-demand TV shows and movies, 50 hours of free DVR storage and up to three streams at the same time. For MLB Network, get the Sling Sports Extra for an additional $11 per month. Please note: Pricing and channel availability varies from location to location. Learn more about Sling TV here. Hulu + Live TV starts at $82.99 per month and a subscription grants you access to ESPN, ESPN2, ABC, Fox, FS1, MLB Network and TBS for 2025 MLB Playoffs. You’ll have access to more than 95 top channels, in addition to Hulu, Disney+ and ESPN Unlimited with unlimited DVR cloud storage. The service also lets you stream on multiple devices at home or on-the-go with up to two streams at once. Fubo is the most comprehensive option for streaming live TV, providing access to every major cable channel including ESPN, ESPN2, ABC, Fox, FS1, MLB Network and TBS. Their starter package, at $54.99 for the first month of service ($84.99 per month afterward), includes 240 channels, a cloud DVR with unlimited space and a family share option that allows you to access Fubo on 100 screens at once at home and three screen at once away from your home.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:41.526646+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/shop/how-to-watch-mlb-playoffs-online-1235083064/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8fd66ecb2d4dff881b4441d7d0f1ea5b",
    "processed_at": "2025-09-30T17:33:10.386665",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is focused on how to watch MLB Playoffs online and discusses streaming services and game schedules, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/tv/news/ina-garten-be-my-guest-season-7-tina-fey-christine-baranski-1236534639/",
    "title": "Ina Garten Be My Guest Season 7 : Tina Fey , Christine Baranski",
    "text": "The Barefoot Contessa’s East Hampton home is about to open up for another season of “Be My Guest With Ina Garten” complete with a new list of invitees. Debuting Oct. 19 at 11 a.m. ET on Food Network and streaming the following day on HBO Max, the “Be My Guest” Season 7 premiere will feature comedian Tina Fey as Garten’s latest visitor to her home, where she and her husband Jeffrey wine and dine their guests while chatting away. In the following weeks, Garten will be joined by “The Gilded Age” star Christine Baranski, violin virtuoso Itzhak Perlman and fashion designer Daniel Roseberry. Per Food Network’s description for “Be My Guest” Season 7, “In the season premiere, Ina knows Tina Fey loves custard desserts – so she greets her with Breakfast Panna Cotta. Tina then shares childhood revelations, standout standup moments and stories about life on the road with her best friend Amy Poehler. Finally, the duo team up in the kitchen to make a dream dinner of Tina’s Greek Lemon Potatoes served with Ina’s Chicken Thighs with Creamy Mustard Sauce. Popular on Variety Later in the season, Baranski will stop by for Maple-Oatmeal Scones, Perlman will try Potato Galette with Smoked Salmon and Roseberry will try Tri-Berry Ricotta Cake. Longtime host of Food Network hit “Barefoot Contessa,” Garten is also the New York Times bestselling cookbook author of thirteen cookbooks. Her memoir “Be Ready When the Luck Happens” was released in 2024. “I love the extraordinary range of my guests from comedian and actresses Tina Fey and Christina Baranski to violinist Itzhak Perlman and couturier Daniel Roseberry,” Garten said. “I love sitting down with them, hearing their stories and cooking with them. You don’t want to miss Itzhak’s scrambled eggs with caramelized onions!” “’Be My Guest’ is an intimate and entertaining ‘day in the life’ glimpse into Ina’s world with fabulous food and fascinating friends,” Warner Bros. Discovery head of food content Betsy Ayala said. “Our audience relishes spending time with her at the barn sharing new stories and recipes every season.” “Be My Guest with Ina Garten” is produced by Pacific Productions for Food Network.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:42.243347+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/tv/news/ina-garten-be-my-guest-season-7-tina-fey-christine-baranski-1236534639/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0adce908b55874dc25177e5f05b68d7a",
    "processed_at": "2025-09-30T17:33:10.386711",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is focused on a cooking show featuring Ina Garten and her guests, discussing food and personal stories, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/film/news/sag-aftra-tilly-norwood-ai-actress-1236534779/",
    "title": "SAG - AFTRA Condemns Tilly Norwood : AI Actress Is Not an Actor",
    "text": "SAG-AFTRA has issued a statement condemning Tilly Norwood, the AI “actress” who has become a contentious subject in Hollywood after her creator, Eline Van der Velden, recently claimed that multiple talent agents were interested in signing the AI creation. The acting guild believes “creativity is, and should remain, human-centered” and “is opposed to the replacement of human performers by synthetics.” “To be clear, ‘Tilly Norwood’ is not an actor, it’s a character generated by a computer program that was trained on the work of countless professional performers — without permission or compensation,” SAG-AFTRA wrote in a statement. “It has no life experience to draw from, no emotion and, from what we’ve seen, audiences aren’t interested in watching computer-generated content untethered from the human experience. It doesn’t solve any ‘problem’ — it creates the problem of using stolen performances to put actors out of work, jeopardizing performer livelihoods and devaluing human artistry.” The guild added, “Signatory producers should be aware that they may not use synthetic performers without complying with our contractual obligations, which require notice and bargaining whenever a synthetic performer is going to be used.” Popular on Variety Amid growing industry backlash against Tilly Norwood, who was created by the AI production studio Particle6, creator Eline Van der Velden issued a defense by saying Tilly “is not a replacement for a human being, but a creative work – a piece of art.” “I see AI not as a replacement for people, but as a new tool, a new paintbrush,” Van der Velden added. “Just as animation, puppetry, or CGI opened fresh possibilities without taking away from live acting, AI offers another way to imagine and build stories. I’m an actor myself, and nothing – certainly not an AI character – can take away the craft or joy of human performance.” Hollywood stars such as Melissa Barrera, Kiersey Clemons, Mara Wilson and more were quick to condemn the AI creation on social media. Whoopi Goldberg opened an episode of “The View” by doubting an AI “actor” like Tilly could ever replace a human performer, adding: “You can always tell them from us. We move differently, our faces move differently, our bodies move differently.” During a podcast interview with Variety, Emily Blunt was shown a picture of Tilly Norwood and reacted with shock and fear. “Does it disappoint me? I don’t know how to quite answer it, other than to say how terrifying this is,” Blunt said. “No, are you serious? That’s an AI? Good Lord, we’re screwed. That is really, really scary, Come on, agencies, don’t do that. Please stop. Please stop taking away our human connection.” Read SAG-AFTRA’s full statement on Tilly Norwood in the post below.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:42.886993+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/film/news/sag-aftra-tilly-norwood-ai-actress-1236534779/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "391527101db22889a92606161f7f6161",
    "processed_at": "2025-09-30T17:33:10.386763",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Ethics and Regulations",
      "explanation": "OpenAI: The article discusses the implications of AI-generated characters in the entertainment industry, focusing on ethical concerns regarding the replacement of human actors and the use of AI in creative fields. It highlights the controversy surrounding an AI actress and the responses from industry professionals and organizations, indicating a strong connection to AI ethics.",
      "keywords": [
        "AI",
        "actress",
        "synthetic performers",
        "human-centered",
        "creativity",
        "computer program"
      ]
    }
  },
  {
    "url": "https://variety.com/2025/film/news/people-we-meet-on-vacation-trailer-netflix-1236509479/",
    "title": "People We Meet on Vacation Trailer : Tom Blyth in Netflix Movie",
    "text": "The first trailer for Netflix’s “People We Meet on Vacation,” starring Emily Bader and Tom Blyth, has been released. The film is based on Emily Heny’s bestselling book of the same name and will premiere Jan. 9, 2026 on Netflix. “People We Meet on Vacation” follows childhood best friends Poppy (Bader) and Alex (Blyth), who spend every summer vacation together despite living in different cities. As the two begin to get closer, the balance of their friendship is tested when both begin to wonder if their friendship is something more. Additional cast members for “People We Meet on Vacation” include Sarah Catherine Hook (“The White Lotus”), Jameela Jamil (“The Good Place”), Lucien Laviscount (“Emily in Paris”), Lukas Gage (“You”), Miles Heizer (“13 Reasons Why”), Tommy Do (“Hacks”), Alice Lee (“The Union”), Alan Ruck (“Succession”) and Molly Shannon (“Private Life”). Popular on Variety “This is a movie that doesn’t just tell a love story,” said director Brett Haley in an interview with Tudum. “It makes you feel like you’ve gone on vacation right alongside Poppy and Alex.” “I’ve been kind of an anxious wreck about who would play these characters,” revealed Henry in an interview with Netflix. “I truly could not feel more confident that my readers and then so many more people who don’t even know about the book are going to completely fall in love with Poppy and Alex.” “People We Meet on Vacation” is produced by Sony Pictures’ 3000 Pictures, which has credits including “Where The Crawdads Sing” and “Lady Chatterley’s Lover.” Watch the trailer below.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:43.599650+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/film/news/people-we-meet-on-vacation-trailer-netflix-1236509479/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8446f90a44eb0c54e17a8c06b3a5255e",
    "processed_at": "2025-09-30T17:33:10.386801",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about a Netflix movie and its cast, with no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/gaming/news/wizards-of-the-coast-montreal-studio-1236534612/",
    "title": "Wizards of the Coast Opens Montreal Studio",
    "text": "Hasbro-owned Magic: The Gathering publisher Wizards of the Coast has opened a new game development hub in Montréal. Operating as Wizards of the Coast Studios Inc., the studio will focus on developing new content for the “Dungeons & Dragons” (D&D) franchise and supporting Wizards of the Coast’s growing digital games portfolio. Industry veteran Dan Ayoub has been selected to spearhead the new studio. Since 2019, Wizards of the Coast has been active in Greater Montréal’s gaming ecosystem through its acquisition of Invoke Studios. The new hub will be located next to Invoke Studios’ space in the heart of downtown Montréal, with an official opening expected in the summer of 2026. Popular on Variety The expansion marks a significant investment for Hasbro in the city of Montréal, with approximately 200 jobs expected to be created over the next three years. Hasbro’s Renton, Wash. office remains the headquarters for the company’s gaming and digital businesses. “As we ramp up our investment in digital gaming, Montréal is the natural choice,” Ayoub said in a statement. “The city’s talent, creativity and passion will be crucial as we craft immersive stories and experiences for our players. It feels incredible to return to the city where my career began in 1999, back when the gaming industry was just taking off.” Stéphane Paquet, president and CEO of Montréal International, said of the investment: “Montréal’s talent and creativity strike again! Hasbro’s latest investment is a powerful endorsement of our gaming ecosystem, home to more than 250 studios and 15,000 highly skilled professionals who have helped shape some of the most iconic AAA titles.” Hubert Bolduc, president of Investissement Québec International, added: “Assisting foreign companies and their subsidiaries with their business ventures in Québec is in our DNA. As the leading driver of Québec’s economic development, we are proud to have backed Hasbro’s expansion in Montréal and to play a part in promoting the undisputed expertise of our video game ecosystem.”",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:44.251990+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/gaming/news/wizards-of-the-coast-montreal-studio-1236534612/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "99ee35bb6b81abc161bb371ab0fdb4da",
    "processed_at": "2025-09-30T17:33:10.386851",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article discusses the opening of a new game development studio by Wizards of the Coast and focuses on the gaming industry, specifically related to Dungeons & Dragons and digital games. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/tv/news/conan-obrien-warned-stephen-colbert-not-speak-truth-power-1236534759/",
    "title": "Conan OBrien Warned Stephen Colbert Not to  Speak Truth to Power  ",
    "text": "Conan O’Brien stopped by “The Late Show” on Monday night to remind Stephen Colbert of some sage advice he offered before stepping away from the world of late-night four years ago. Colbert is about to become a late-night vet himself after CBS decided to end “The Late Show” in May 2026. “Just as I was leaving my late-night show, I took you and all the other late-night hosts out,” O’Brien began. “Remember this? I took you to a wonderful Sizzler restaurant, and we all had our trays and I told you guys, ‘Take care of late night. If you take care of late night, late night will take care of you.’ I said, ‘Don’t do anything to ruffle any feathers.’ Remember? I said that. And I said, ‘Whatever you do, don’t speak truth to power.’ I said, ‘Cowardice is the way.'” O’Brien joked that in his 28 years of being a late-night host, he “never read the news. I had a masturbating bear and a plastic dog. I didn’t even know who was president!” Popular on Variety As the crowd howled with laughter, Colbert deadpanned, “Thanks for being here, Conan.” On a more serious note, O’Brien told Colbert: “I, of course, adore you. I love you. I know you as a person and also a comedic force and, like a lot of people, I’m very sad that this chapter is ending.” He added, “But I also want to say that you are going to do amazing things, you’re going to have a lot of fun. And the connection you have — and this isn’t just you, it’s Mr. Kimmel and Fallon, all these guys have — it’s very special. The connection you have with the audience, you’re taking with you. No one else owns that. That’s yours for the rest of your life.” Late-night television is in the midst of a reckoning after Colbert’s “Late Show” was canceled and “Jimmy Kimmel Live” was taken off the air following the host’s comments about the assassination of Charlie Kirk. After Kimmel’s suspension was lifted last week, Colbert celebrated during his show, saying: “Our long national late nightmare is over … Come on! Wonderful news for my dear friend Jimmy and his amazing staff.” Watch O’Brien’s full interview on “The Late Show With Stephen Colbert” below.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:44.838295+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/tv/news/conan-obrien-warned-stephen-colbert-not-speak-truth-power-1236534759/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8891333f3268133c5887e056732814c9",
    "processed_at": "2025-09-30T17:33:10.386940",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a conversation between Conan O'Brien and Stephen Colbert about late-night television and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/digital/news/daniel-ek-step-down-spotify-ceo-1236534775/",
    "title": "Daniel Ek to Step Down as Spotify CEO",
    "text": "Spotify founder Daniel Ek is formally ending his tenure as CEO of the audio-streaming giant. As of Jan. 1, 2026, Ek will “transition” to the role of executive chairman of Spotify, the company said Tuesday. At that time, Gustav Söderström, currently co-president and chief product and technology officer, and Alex Norström, co-president and chief business officer, will become Spotify’s co-CEO. Söderström and Norström will report to Ek and both will also serve on the company’s board of directors (subject to shareholder approval). According to the company, the executive change “formalizes how Spotify has successfully operated since 2023 with the co-presidents largely leading strategic development and operational execution of Spotify.” As executive chairman, Ek’s role “will more closely reflect a European chairman setup,” where he will oversee capital allocation and scope out the long-term future and strategy for Spotify while continuing to provide support and guidance to its senior team. Popular on Variety “I always believed that Spotify could play an important role in revolutionizing listening around the world, and with more than 700 million users, we’ve truly charted a new course bringing creativity to every corner of the globe,” Ek said in a statement. “Over the last few years, I’ve turned over a large part of the day-to-day management and strategic direction of Spotify to Alex and Gustav – who have shaped the company from our earliest days and are now more than ready to guide our next phase. This change simply matches titles to how we already operate.” Ek, 42, founded Spotify in 2006 and has been a member of the board since July 21, 2008. Prior to Spotify, he founded Advertigo, an online advertising company acquired by Tradedoubler, held various senior roles at the Nordic auction company Tradera (which was acquired by eBay), and served as chief technology officer at Stardoll, a fashion and entertainment community for pre-teens. Woody Marshall, lead independent director of Spotify’s board, said, “The board has been working closely with Daniel on the evolution of Spotify’s leadership structure for several years. We have tremendous confidence in Alex and Gustav as they step into these roles. They each have more than 15 years with the company and have been instrumental in driving our success and enabling Spotify to lead our industry. We are also thrilled that Daniel will be actively involved, giving Spotify both founder-led strategic stewardship and mentorship to the co-CEOs as the company continues to innovate and scale.” The new co-CEOs said in a joint statement, “We’ve worked together a very long time and have seen Spotify through many different chapters. Nearly three years ago, when we stepped into our roles as co-Presidents, we charged our teams with relentlessly focusing on building the best and most valuable experience available anywhere and that ambition hasn’t changed. While we bring different experiences and perspectives to the CEO role, we both have a strong bias to action and can’t wait to get started knowing that we will have Daniel’s full partnership and ongoing support.”",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:45.471710+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/digital/news/daniel-ek-step-down-spotify-ceo-1236534775/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "eaa7741550af1464da38698c7d07f228",
    "processed_at": "2025-09-30T17:33:10.386985",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the leadership change at Spotify and does not focus on artificial intelligence or related topics. It primarily covers corporate management and strategic direction rather than AI technology or applications.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/digital/global/tiktok-launches-crescendo-discover-classical-music-talent-1236534738/",
    "title": "TikTok Launches Crescendo to Discover Classical Music Talent",
    "text": "TikTok and London’s Southbank Centre have announced Crescendo, a new accelerator program that aims to discover the next generation of classical music talent. The program will support and elevate a select cohort of 10 U.K.-based creators passionate about classical music who are already making content about the genre on TikTok. The application to be part of Crescendo is now live here through Oct. 30. The launch of Crescendo was celebrated on Tuesday morning at the Southbank Centre with a special performance from violinist and TikTok creator Esther Abrami (pictured above), who is on the panel of experts that will be selecting the inaugural cohort. Cellist and politician Baroness Thangam Debonnaire, the Southbank Centre’s head of classical music Toks Dada and Toyin Mustapha, TikTok’s head of music partnerships for U.K. and Ireland, will also review applications. Popular on Variety “With nearly a million TikTok posts under the #ClassicalMusic hashtag, which has increased by 60% on TikTok over the past 12 months, the genre is stepping beyond the concert hall and finding powerful new life online,” a press release states. “Whether they’re virtuoso performers, bedroom composers, remixing DJs, or superfans from non-traditional backgrounds, the program is seeking fresh and diverse voices ready to unlock classical music for 21st century audiences.” The 10 selected creators will be invited to an event in January where they will have the opportunity to connect with each other. In addition, the cohort will gain free access to Southbank Centre concerts and rehearsals, exclusive behind-the-scenes content opportunities with the Southbank Centre’s Resident Artists and Orchestras, bespoke mentorship and platform training from TikTok on growing and engaging audiences, collaboration opportunities with TikTok and Southbank Centre digital teams and long-term involvement through the Southbank Centre’s Ambassador Scheme. “There’s a phrase that I heard so many times when I was studying classical music, which is ‘young people do not like classical music.’ But then I thought, ‘Wait, I’m young. I love it. How come?'” Abrami said during a panel discussion at the launch event. “It’s music that gives you chills, it’s music that’s so powerful and I thought, it’s not fair that not everyone is actually experiencing that.” Added Mustapha: “I think traditionally with classical music, it might have felt like it’s not something that’s relevant to some people because they think that everyone who plays it or composes it is dead. As a platform, what TikTok is able to do is open up new audiences … it’s a way for people to be able to relate to something that they might otherwise feel is not relatable to them.”",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:46.129563+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/digital/global/tiktok-launches-crescendo-discover-classical-music-talent-1236534738/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "40c53f3e6eb273b2e05bfdd2e3eb3ead",
    "processed_at": "2025-09-30T17:33:10.387094",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article focuses on a TikTok program aimed at promoting classical music talent and does not discuss artificial intelligence or related technologies. It centers around music and social media engagement rather than AI.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/music/news/lainey-wilson-cma-awards-2025-host-1236534752/",
    "title": "Lainey Wilson Will Go Solo as Host of 2025 CMA Awards",
    "text": "Lainey Wilson has been named as the host of the 2025 Country Music Association Awards on ABC — handling those duties by herself this year, after having been brought on as one of three co-hosts for the previous year. Producers picking the country star to be the telecast’s sole pilot is a sign of how fast her star has risen and how dominant she is as an ambassador for country music at the moment. As it happens, this will mark a rare occurrence of an artist who is nominated for the most trophies on a televised awards show also being the host of that show. Going into this year’s CMAs, Wilson is tied with Ella Langley and Megan Moroney for the most noms, with six each. It’s only the second time in the last 22 years that the CMAs have gone with a solo host. The previous instance came when Luke Bryan took the reins alone for the 2021 telecast. Prior to that, it hadn’t happened since Vince Gill was the sole host for the show for a long run that lasted from 1994 to 2003. Popular on Variety In 2024, Wilson came on board as a third member of the hosting team, joining Bryan and football great Peyton Manning, who had been paired up as a duo the previous two years. “I grew up watching the CMA Awards like it was the Super Bowl,” Wilson said in a statement, “so to be hosting for a second year is a true honor. I’m humbled that CMA has trusted me with this role, and I can’t wait to love on this genre that has given me so much.” The 59th annual show airs live on ABC from Nashville’s Bridgestone Arena on Nov. 19 at 8 p.m. ET. It will be available be available for streaming the next day on Hulu. If Wilson should stay on as host for years to come, she has a couple of role models whose boots she might follow in, as far as racking up a lot of successive years fronting the broadcast. The aforementioned Gill had a long stint as host with his 10-year run. But the hosts who racked up the greatest number of years in the role were Carrie Underwood, who assumed the role for a dozen years from 2008 to 2019, followed by Brad Paisley, who co-hosted with Underwood for the first 11 of those 12 years. (In her 13th year, Underwood co-hosted with Reba McEntire and Dolly Parton.) The awards Wilson is up for this year include the top prize, entertainer of the year, which she previously won in a surprise victory in 2023, the first time she was nominated. She is considered a leading favorite to reclaim it this time around, given her recent success selling out her first headlining arena tour. (Last year, she was nominated for the top award a second time but lost to Morgan Wallen, who did not show up to claim the prize.) Besides being up for entertainer of the year again, Wilson’s other five nominations this year are in the categories for female vocalist of the year; single of the year and song of the year (both for “4x4xU”); album of the year (for “Whirlwind”); and music video of the year (for “Somewhere Over Laredo,” a single included on the deluxe version of “Whirlwind”). “Whirlwind” is only Wilson’s third major-label album, after she began her career climb with 2021’s “Sayin’ What I’m Thinkin’.” A small recurring role on the hit TV series “Yellowstone” provided a boost in her rise to fame. She has had eight top 5 hits on the country airplay chart in the last five years, five of those as a solo artist and three as a featured duet partner.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:46.818870+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/music/news/lainey-wilson-cma-awards-2025-host-1236534752/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ef497ba4b861ffcad58ee4c68a568dc0",
    "processed_at": "2025-09-30T17:33:10.387152",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Lainey Wilson's role as the host of the 2025 CMA Awards and her achievements in country music, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.indiewire.com/news/breaking-news/laura-dern-on-twin-peaks-the-return-in-movie-theater-1235153547/",
    "title": "Laura Dern on  Twin Peaks : The Return  Being in a Movie Theater",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. The latest top awards title to screen at the 63rd New York Film Festival is Noah Baumbach’s “Jay Kelly,” starring George Clooney as an actor approaching the end of his tether. The Netflix film premiered last month at Venice, with co-stars Adam Sandler and Laura Dern. The latest movie from the “Marriage Story” and “The Squid and the Whale” director opens in theaters from Netflix on November 14 before streaming December 5. We caught up with Dern on the red carpet, talking about how David Lynch music collaborator Dean Hurley finally brought “Twin Peaks: The Return” to the big screen over the summer. New York City’s Metrograph Theater was the first to show the full version of the series the way Lynch intended. “I think he would love it,” Dern told IndieWire of what she thinks the auteur would think of the feat. “I think it’s so profoundly cinematic,” she continued. “Filmmakers, including Noah, including so many who have movies here, have talked, obviously, about David being their muse, [as well as] David being so profoundly important and ‘The Return’ being so important. To hear the specifics of why ‘The Return’s’ bravery shaped movies of the last four or five years for specific filmmakers has been so inspiring.” In the series, she played Diane Evans, longtime secretary and confidante of FBI Special Agent Dale Cooper. Though the Oscar and Emmy winner couldn’t say much about the upcoming confirmed Season 3 of “Big Little Lies,” she did tease that the cast is her “favorite people and one of my favorite characters ever, so I can’t think of a better time.” We also briefly chatted with Clooney, who reflected on the work he’s done with Baumbach. This is technically the second time they have worked together, as the director co-wrote “Fantastic Mr. Fox” with Wes Anderson, and Clooney played the title character. “First of all, he’s a good writer,” he told IndieWire. “I didn’t know how good. I’ve never been on a set with him when he was directing. The very first scene is a 12-page one and I thought, “Well, this is a really ambitious, tricky film he’s trying to make.’ I was very excited by the work he wanted to do.” Clooney also recalled the story, which he’s shared before, of auditioning for “Bram Stoker’s Dracula” with Francis Ford Coppola. “I thought I was really good. Coppola called my agent and asked if I was drunk.” In David Ehrlich’s review of “Jay Kelly,” he writes that it “is a bubbly champagne drama that tries to wring a few tears from the unbearable lightness of being rich and famous, but the fact that it looks like a Lavazza commercial and bemoans the isolation of flying private is ultimately in service to a more relatable story about the trade-offs that all of us are forced to make in this life — the one-way roads we take on the long and circular journey towards becoming ourselves.” By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
    "domain": "indiewire.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:52.675185+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "indiewire.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.indiewire.com/news/breaking-news/laura-dern-on-twin-peaks-the-return-in-movie-theater-1235153547/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1cf9ca8032149d71c55b0443664d389a",
    "processed_at": "2025-09-30T17:33:10.387199",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses film and television, specifically focusing on Laura Dern's experiences and comments related to movies and directors. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.indiewire.com/news/trailers/viktor-trailer-doc-deaf-ukrainian-war-photographer-1235153532/",
    "title": "  Viktor  Trailer : Doc About Deaf Ukrainian War Photographer",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Olivier Sarbil’s “Viktor,” opening in Los Angeles October 3, is a war documentary unlike any other. The title subject is a deaf Ukrainian man who wants to enlist in his country’s armed forces in 2022 when Russia launches its full-scale invasion. But as he notes right away in the trailer for “Viktor,” which IndieWire is proud to exclusively debut below, “The dear are set aside. Out of touch with the hearing world.” Instead, he becomes a war photographer documenting Ukraine‘s fight. Sarbil, the director, wanted to tell a story about the deaf community in Ukraine and how it was dealing with the war. The filmmaker was inspired by how he himself had lost hearing in one of his ears while making a previous war documentary in “Libya.” Sarbil, who serves as cinematographer on “Viktor” as well, shooting the film in striking black-and-white monochrome, ultimately realized that Viktor should be his subject. It’s a startling war film as character study, and builds off Sarbil’s previous work directing war documentaries for “Frontline,” including 2017’s “Mosul.” “Viktor” premiered in the Platform section of TIFF 2024, and has since played the Hamptons International Film Festival, Deauville, and Camerimage, where it played in the documentary features competition. The film has many unique stylistic choices. Deaf people still feel vibrations, of course, so it has a sound design that tries to replicate Viktor’s point of view, including being very vibration-heavy. Giving the film a rave “A” review out of TIFF 2024, IndieWire said, “One of the unexpected gems of this year’s fest, ‘Viktor’ is a (Darren Aronofsky-produced) doc from the multi-award-winning director/DP Olivier Sarbil, a globetrotting conflict photojournalist who’s now chosen to set his latest in Ukraine. (Sarbil is also behind the 2019 Frontline doc ‘On the President’s Orders,’ co-directed with James Jones (‘Antidote’), a nail-biting investigative look at the former Philippines strongman Rodrigo Duterte’s deadly ‘war on drugs’ through both its mostly addict victims and chillingly remorseless perpetrators.) But what makes the film so extraordinary is that the ongoing invasion is not the focus but merely backdrop for a window into a truly unique POV on the Russian assault.” “Viktor” opens October 3 at the Cinelounge Hollywood in Los Angeles. Its opening weekend will feature Q&As with Sarbil conducted by filmmakers Ondi Timoner and Amy Berg. By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
    "domain": "indiewire.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:53.432392+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "indiewire.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.indiewire.com/news/trailers/viktor-trailer-doc-deaf-ukrainian-war-photographer-1235153532/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4a6fe38100fda39b3c3bbe96bff415eb",
    "processed_at": "2025-09-30T17:33:10.387242",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a documentary film about a deaf Ukrainian war photographer and does not mention artificial intelligence or related topics. It focuses on the filmmaker's perspective and the unique storytelling approach rather than any AI concepts.",
      "keywords": []
    }
  },
  {
    "url": "https://www.indiewire.com/news/trailers/people-we-meet-on-vacation-teaser-emily-henry-adaptation-1235153557/",
    "title": "  People We Meet on Vacation  Teaser : The First Emily Henry Adaptation",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. If you’re not already a fan of bestselling romance novelist Emily Henry, consider changing that — and fast — as many (read: nearly all) of the prolific author’s books are soon slated to get big screen adaptations. First out of the gate? “People We Meet on Vacation,” which will hit Netflix early next year. Per the film’s official synopsis, it follows “the free-spirited Poppy and routine-loving Alex, who have been unlikely best friends for a decade, living in different cities but spending every summer vacation together. The careful balance of their friendship is put to the test when they begin to question what has been obvious to everyone else — could they actually be the perfect romantic match?” In the film, free-wheeling Poppy is played by “Lady Jane” breakout Emily Bader, with “Plainclothes” star Tom Blyth joining her as the uptight Alex. Brett Haley directs this one, with a script by Yulin Kuang and Amos Vernon & Nunzio Randazzo. Kuang is also on board to write and direct an adaptation of Henry’s “Beach Read.” Henry’s blend of swoony love and spicy romance with compelling characters has rocketed her to the top of the bestseller lists, and fans are eager to see how that might translate to film success. Other Henry joints also bound for the screen? “Funny Story,” “Book Lovers,” and “Happy Place.” See! Prolific! Henry’s book was first published in 2021, and if debuted at #1 on the New York Times bestseller list and spent more than one year on the list. It’s sold more than 2 million copies in the U.S. to date. The book also won the Goodreads Choice Award for Romance and was listed as one of the best books of 2021 by Kirkus Reviews. The film also stars Sarah Catherine Hook, Lucien Laviscount, Miles Heizer, Jameela Jamil, Tommy Do, Lukas Gage, Alice Lee, Molly Shannon, and Alan Ruck. Check out the teaser for “People We Meet on Vacation” below. The film starts streaming on Netflix January 9, 2026. By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
    "domain": "indiewire.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T143000Z",
    "date_download": "2025-09-30T15:32:54.145189+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "indiewire.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.indiewire.com/news/trailers/people-we-meet-on-vacation-teaser-emily-henry-adaptation-1235153557/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "66586ea911c7a185fc574811ef0ddbaa",
    "processed_at": "2025-09-30T17:33:10.387282",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a film adaptation of a romance novel and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/09/disney-plus-spain-international-hulu-switch-iberseries-1236565966/",
    "title": "Disney+ Spain Content Boss On International Hulu Switch – Iberseries",
    "text": "Disney+‘s Spanish content head has addressed the fast-approaching international rebrand of Star to Hulu, while calling for “respect” of local theatrical windows. Sofía Fábregas, VP of Original Production at Disney+ Spain, told a packed audience at the Iberseries & Platino Industria conference to be ready for the Hulu switch, which is due to take place in all territories outside the U.S., marking a major rebranding exercise. “Many of you know Star well,” she began as she addressed producers. If they had concerns their Star original titles might lose prominence following the rebrand, “That’s not the reality,” she said. “Everything that was Star becomes Hulu, and Hulu is now one of our five brands.” Fábregas didn’t provide details on what Disney+ Spain might look to do with the new tile, but Disney has previously said the move is part of a plan to turn Hulu into a “global general entertainment brand.” In the U.S., the Hulu brand will eventually be wound down, though it is expected to remain as a standalone app through 2026. Watch on Deadline The Disney exec also addressed “respecting” local windows, saying she would look to release 3-4 titles locally in cinemas each year before they transfer to Disney+. Windowing for both platforms in this way, she said, “is not incompatible.” Disney+ has to date released original series such as daily soap Return to Las Sabinas, high fashion dramas series Cristóbal Balenciaga and Invisible, and Fabregás said the streamer was open for co-production business in future, as budgets becoming trickier to compile. Disney+ recently welcomed ITV exec Angela Jain as its new Head of Content, EMEA. Its Spanish arm recently struck a deal with broadcaster Atresmedia to carry an annual 300 hours of the latter’s content. Fabregás predicted the deal would be a success for both sides.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:56.956143+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/09/disney-plus-spain-international-hulu-switch-iberseries-1236565966/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c8195d82718de097ce9101059e7921e7",
    "processed_at": "2025-09-30T17:33:10.387319",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the rebranding of Disney+ and Hulu in Spain, focusing on content strategy and local theatrical windows. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/09/outfest-returns-hbo-max-screening-event-2-year-hiatus-1236565924/",
    "title": "Outfest Returns For HBO Max Screening Event After 2 - Year Hiatus",
    "text": "After the organization endured financial woes, a change in leadership and unionizing in 2023, Outfest is back with a new four-day screening event and LGBTQ+ community celebration. Partnering with HBO Max, OutfestNEXT marks the relaunch of the Los Angeles LGBTQ+ film festival’s programming as the nonprofit rehires key staff members who were placed on leave during previous restructuring, in addition to the election of a new Board of Directors. Watch on Deadline Festival organizers are in the final stages of curating the screening event, set for Nov. 6-9, with new programming initiatives to be announced soon. “Outfest was born of the need for our LGBTQ+ community to have a place to safely gather and to support filmmakers who were telling authentic stories,” said Christopher Racster, interim executive director of Outfest. “Outfest is being reborn at a time when telling our stories has never been more important. We are re-emerging to ensure that our community is not being erased by those working to deny us equal and civil rights. We are proud and grateful to have our decades long partner HBO Max returning as Presenting Sponsor for the event. Now more than ever, our community needs to come together and our voices need to be heard.” Additionally, the relaunch plans to revive some of the festival’s signature programs, including Outfest Los Angeles, its flagship LGBTQ+ Film Festival, as well as Outfest Fusion, its BIPOC focused film program. Originally founded in 1982, Outfest’s next phase and current team growth comes with help from Queer Filmmakers United, whose rep Daniel Crooke said the union is “excited by the fresh approach taken by Christopher and the new Board of Directors in bringing our beloved organization back to life. We are greatly encouraged by their commitment to fostering a mutually respectful workplace, as demonstrated by their voluntary recognition of our union. We have been proud to work with them in the fourteen months leading up to this moment, and we look forward to continuing our work together in building a more just, equitable, and sustainable film culture.” Outfest’s 2025 Board of Directors includes Kelly Balch, Jeffrey R. Epstein, Nick Francescon and Amir Moini. The Board’s new president, Lucas Bailey said, “We are humbled to be standing on the shoulders of those who have spent four decades building Outfest. We are committed to rebuilding in the face of the current headwinds facing the arts, QTBIPOC and LGBTQ+ communities. We are inspired by the knowledge that our community has overcome countless obstacles in the past by standing together.” Amid the WGA/SAG-AFTRA strikes and media layoffs of 2023, Outfest’s Board announced in October of that year they “made the difficult decision to scale back our operations for the next several months,” noting that it “proudly supports” its staff’s right to unionize and formally recognizing QFU. The Board expressed its intentions to “humbly focus on creating a financial model that prioritizes programming that serves our community, a supportive environment for our staff, and ultimately protects the organization.” Outfest’s return comes at a detrimental time for representation in media as GLAAD’s latest Studio Responsibility Index found that LGBTQ-inclusive films dropped to a three-year low, and the Trump administration continues its efforts to dismantle DEI.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:57.649442+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/09/outfest-returns-hbo-max-screening-event-2-year-hiatus-1236565924/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "799d4328f84a9ef896de735ffa46a89f",
    "processed_at": "2025-09-30T17:33:10.387368",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the relaunch of the Outfest LGBTQ+ film festival and its community initiatives, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/09/tongal-animated-series-fever-fighter-st-jude-patient-art-1236566000/",
    "title": "Tongal Creating  Fever Fighter , Based On St . Jude Patient Artwork",
    "text": "EXCLUSIVE: Tongal, the creators’ platform, is launching an animated series inspired by artwork from a patient at St. Jude Children’s Research Hospital. The show was unveiled at the LA Comic Con over the weekend and we have the details for you here. Fever Fighter is based on a character created by Ethan Washburn, who first dreamed up the superhero when he was aged seven being treated by St. Jude for acute lymphoblastic leukemia. The character—whose superpower is fighting fevers, which are often present during cancer treatment—has long served as an informal mascot for patients and families. Tongal is turning Washburn’s vision into an animated series, with its global network creators helping to develop content based on the artwork. The goal is to make Fever Fighter the basis of a ‘Feververse’ of patient-created superheroes. Watch on Deadline “I can’t believe Fever Fighter is going to be a real show,” said Washburn, who is now a college graduate and St. Jude cancer survivor. “I dreamed him up when I was at St. Jude more than a decade ago, and it’s amazing to now see him living an exciting life of his own. I can’t wait to see what’s next as we hand his future over to artists and storytellers everywhere.” Fans and creators are being invited to submit their own creative concepts and artwork through the Tongal platform. They can also build his stories. “Transforming a child’s drawing into a fully animated character like Fever Fighter is more than creative storytelling — it’s a powerful reflection of how we’re evolving the way patient artwork is experienced and shared with the world,” said Samantha Maltin, Chief Marketing and Brand Officer of ALSAC, the fundraising and awareness organization for St. Jude Children’s Research Hospital. “Art is a vital part of holistic care at St. Jude, and through this unique partnership with Tongal and its generous community, we’re able to position patient stories in ways that connect and inspire.” “Through our collaboration with St. Jude, we’re focused on connecting with people of all ages on a deeply emotional level through storytelling,” said James DeJulio, CEO and co-founder of Tongal. “Fever Fighter was born out of Ethan’s imagination, and I believe it can spark an entirely new future of fundraising. “We can use creativity to develop meaningful engagement that mobilizes creators, fans, and donors worldwide. The future of fundraising is through content and there’s no better way to build it than by empowering our global community of creators to bring Ethan’s Fever Fighter to life.” A documentary short chronicling Washburn’s story from Manuel Izquierdo, a member of the Tongal creator community, premiered at Comic-Con. More content from Fever Fighter will be launched later this year.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:58.352435+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/09/tongal-animated-series-fever-fighter-st-jude-patient-art-1236566000/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a6170f40976ae44d1f54828771300717",
    "processed_at": "2025-09-30T17:33:10.387410",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the creation of an animated series based on a child's artwork and does not focus on artificial intelligence or its applications. While it mentions creativity and storytelling, these are not inherently AI-related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/09/the-holy-boy-movie-acquired-shudder-fantastic-fest-1236565078/",
    "title": "  The Holy Boy  Movie Acquired By Shudder After Fantastic Fest Debut",
    "text": "EXCLUSIVE: Following its world premiere at the Venice Film Festival and subsequent North American launch at Fantastic Fest, where it earned both the Next Wave Best Director Award and the Audience Award, Paolo Strippoli‘s The Holy Boy has been acquired by Shudder for release in North America, the UK, and Ireland. A menacing horror fable marking the Italian filmmaker’s third feature, The Holy Boy will debut on the streamer in 2026. The story follows Sergio (Michele Riondino), a teacher tormented by his past who is transferred to Remis, a secluded village known as the happiest town in Italy. But Sergio soon discovers that behind the town’s joyful facade lies a disturbing secret: Each week, the villagers gather to hug Matteo (newcomer Giulio Feltri), an introverted 15-year-old whose embrace can free one of all pain and sorrow. As Sergio uncovers that the village’s devotion to Matteo is far from benevolent, his attempt to rescue the boy known as the Angel of Remis ignites the community’s vengeful nature. The film is produced by Laura Paolucci, Domenico Procacci, Stefano Sardo, and Ines Vasiljevic. Watch on Deadline Prior to The Holy Boy, Strippoli teamed with Roberto De Feo to direct A Classic Horror Story, a Netflix pic which won Best Director at the 67th Taormina Film Festival. He then went on to helm the psychological horror film Piove, which competed at the Sitges Film Festival, Fantastic Fest, and Alice Nella Città. In a statement to Deadline, the director said, “Shudder is a guiding light in visionary genre cinema, and I am beyond thrilled they will bring THE HOLY BOY to a wider, passionate audience. The film explores our relationship with pain—the shortcuts we take to avoid it, and the way in which pain itself makes us fully human. We imagined a town that does not exist but could, and a ritual that does not exist but could: an uncanny embrace that takes away all suffering. Soon, new audiences will embrace THE HOLY BOY, and discover its terrifying consequences.” Shudder’s Senior Vice President of Programming and Acquisitions Samuel Zimmerman added, “We were blown away by THE HOLY BOY. Paolo Strippoli crafts an eerie and provocative horror film, one that builds to an astonishing finish. We knew instantly this belonged with Shudder.”",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20250930T150000Z",
    "date_download": "2025-09-30T15:32:58.942878+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/09/the-holy-boy-movie-acquired-shudder-fantastic-fest-1236565078/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "73cc49efbd29d6ab552a3946c90a01c1",
    "processed_at": "2025-09-30T17:33:10.387447",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a horror film and its acquisition by a streaming service, with no mention of artificial intelligence or related topics. It focuses on the film's plot, director, and festival accolades.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theverge.com/news/788242/nothing-ai-os-essential-apps-playground",
    "title": "Nothing  first step  to an  AI O is not first , or an OS , but is fascinating",
    "text": "Nothing says it has just taken “the first step towards an AI-native operating system.” Not exactly. Playground, Nothing’s new app store filled with user-designed, AI-generated apps, is neither Nothing’s first step, nor is it an operating system — it’s built on Android. But the idea lands, and beneath the hype, it is genuinely exciting — a glimpse of smartphones that feel more personal and adaptable, with a clear vision for where this might go in the future. Nothing’s ‘first step’ to an ‘AI OS’ is not first, or an OS, but is fascinating Nothing is launching an app store for AI-built smartphone software. Nothing is launching an app store for AI-built smartphone software. The bold proclamation of an AI-native OS centers on the launch of Essential, which Nothing says brings us closer to a world “where devices adapt to people, not the other way around.” In plain speak, Essential is Nothing’s “name for all our AI-related products,” founder and CEO Carl Pei tells The Verge. Despite the London startup claiming to be unveiling Essential today, the line actually has several products live already, including an AI search tool and Essential Space, which organizes voice notes and images. What’s really new is Playground, and with it Essential Apps. Playground is basically Nothing’s take on an app store. Filling it will be apps designed in Essential Apps, an AI-powered tool that can build simple apps from written prompts alone. In short, users can design their own apps for their own needs. Nothing suggests a mood tracker that syncs with a music playlist, a receipt-to-expenses-form pipeline, or an app that can suggest what to wear based on your wardrobe and upcoming appointments. It’s clear this is the early stages of what Pei imagines as a much larger ecosystem, making some of Nothing’s “first step” comments make more sense. At the moment, you can only design widgets, which obviously limits what they can do. Apps must also be created on a web platform with written inputs, at which point creators can install them on their own phones or add them to Playground for others to download. It’s available exclusively to Nothing phones, with the exception of the Phone 1, which Pei says no longer receives major updates so can’t install the new apps. Over time, Pei tells The Verge this process of app creation will become “more and more seamless,” taking place directly on the phone itself and perhaps by just speaking. Widgets are not the end game either, Pei says, forecasting more capable apps that take up the entire screen, comparable to the standard apps we have today. There are also the kernels of what could become a new creator economy, if the idea takes off. Playground lets users take and remix apps others have made, building and evolving in a similar fashion to the open source community does today. For someone who speaks a lot about the moats smartphone giants Apple and Google have built around their app stores, Pei claims he is not thinking about how to monetize the store yet. “I think it needs to reach a certain level of scale before we can turn on whatever business model we have,” he says, adding that “YouTube could be a good example of where it could potentially go” for creators. Eventually — and here’s where the AI-native OS idea comes in — Pei says phones could be more proactive, changing apps’ placement, or even suggesting apps based on how we use the phone. But even then, this is not an OS. It is an interface. Pei admits as much, leaning on semantics to skirt the issue: “I guess the word or the noun ‘OS’ could be interpreted in different ways.” Pei tells The Verge Nothing has no intention of abandoning Google’s Android, the system on which its products are currently built. “We’re not touching the lower level code,” he says. “Android is a great platform to build upon, and Android already has a rich developer ecosystem,” Pei explains. People will still need to download apps like Instagram or Tiktok when starting up their phones, after all. It’s an exciting new feature and potentially a new and exciting creator economy. But there is a long way to go before Nothing can truly go it alone. In a departure from the hyped AI-powered gadgets like Rabbit’s R1 or OpenAI’s partnership with former Apple designer Jony Ive, Pei is not promising to do away with the smartphone just yet. It is clear Pei believes phones are here to stay when he asks himself, “When am I ready to say goodbye to apps?” and answers: “You know, not anytime soon.” Most Popular - Microsoft launches ‘vibe working’ in Excel and Word - Ford’s CEO isn’t impressed with Apple CarPlay Ultra - Anker’s fastest airline-friendly power bank is now available - Anthropic releases Claude Sonnet 4.5 in latest bid for AI agents and coding supremacy - Logitech’s MX Master 4 adds haptic feedback, mostly just for fun",
    "domain": "theverge.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:33:05.461634+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theverge.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.theverge.com/news/788242/nothing-ai-os-essential-apps-playground",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "10decaf161ff369d4c6544f32893be11",
    "processed_at": "2025-09-30T17:33:10.387504",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.9,
      "topic": "AI Technology and Infrastructure",
      "explanation": "OpenAI: The article discusses the launch of an app store for AI-generated applications and the concept of an AI-native operating system, focusing on how AI can enhance user experience and app creation. It delves into the implications of AI in smartphone technology and user interaction, indicating a strong focus on AI-related topics.",
      "keywords": [
        "AI-native operating system",
        "AI-generated apps",
        "AI-powered tool",
        "app creation",
        "AI-related products"
      ]
    }
  },
  {
    "url": "https://www.theverge.com/tech/786685/amazon-event-live-blog-were-here-for-new-echos-kindles-and-more",
    "title": "Amazon event live blog : were here for new Echos , Kindles and more",
    "text": "We’re at Amazon’s fall 2025 hardware event in New York City, where the company is set to announce a bunch of new gadgets ahead of the holidays. Amazon’s teaser image for today suggested new Kindles, Echos, and maybe a TV. Whatever it is, it’s been a long time coming: Amazon CEO Andy Jassy promised “beautiful” new hardware back in February, which is when the key software they’ll be running — Alexa Plus — made its debut. Amazon event live blog: we’re here for new Echos, Kindles, and more Alexa Plus is already rolling out. Now it’s time for Amazon to put some great hardware behind it. Amazon event live blog: we’re here for new Echos, Kindles, and more Alexa Plus is already rolling out. Now it’s time for Amazon to put some great hardware behind it. Whether Amazon can make Alexa Plus useful is the real question beneath all of today’s announcements. The AI-powered assistant is off to a promising start, but on current devices, it can be sluggish when responding and still misunderstand your intent. New hardware can help with some of that, but it can only go so far when it comes to LLMs. Things kick off at 10AM ET / 7AM PT. There’s no video feed for this one — we’re just going to go hard in the paint right here from the audience for you. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Cameron Faulkner Jennifer Pattison Tuohy Most Popular Most Popular - Microsoft launches ‘vibe working’ in Excel and Word - Anker’s fastest airline-friendly power bank is now available - Ford’s CEO isn’t impressed with Apple CarPlay Ultra - Logitech’s MX Master 4 adds haptic feedback, mostly just for fun - Anthropic releases Claude Sonnet 4.5 in latest bid for AI agents and coding supremacy",
    "domain": "theverge.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:33:05.509677+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theverge.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.theverge.com/tech/786685/amazon-event-live-blog-were-here-for-new-echos-kindles-and-more",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "06cf42e2dce60f35dfa8fb26d048ac2a",
    "processed_at": "2025-09-30T17:33:10.387541",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.8,
      "topic": "AI Technology and Infrastructure",
      "explanation": "OpenAI: The article discusses Amazon's hardware event, specifically mentioning Alexa Plus, which is an AI-powered assistant. It highlights issues related to AI performance and the potential improvements with new hardware, indicating a focus on AI technology.",
      "keywords": [
        "Alexa Plus",
        "AI-powered assistant",
        "LLMs",
        "hardware"
      ]
    }
  },
  {
    "url": "https://www.theverge.com/news/788195/microsoft-security-store-launch-copilot-ai-agents",
    "title": "Microsoft new Security Store is like an app store for cybersecurity",
    "text": "Microsoft is launching a Security Store that will be full of security software-as-a-service (SaaS) solutions and AI agents. It’s part of a broader effort to sell Microsoft’s Sentinel security platform to businesses, complete with Microsoft Security Copilot AI agents that can be built by security teams to help tackle the latest threats. Microsoft’s new Security Store is like an app store for cybersecurity Cybersecurity workers can also start creating their own Security Copilot AI agents. Cybersecurity workers can also start creating their own Security Copilot AI agents. The Microsoft Security Store is a storefront designed for security professionals to buy and deploy SaaS solutions and AI agents from Microsoft’s ecosystem partners. Darktrace, Illumio, Netskope, Perfomanta, and Tanium are all part of the new store, with solutions covering threat protection, identity and device management, and more. A lot of the solutions will integrate with Microsoft Defender, Sentinel, Entra, Purview, or Security Copilot, making them quick to onboard for businesses that are fully reliant on Microsoft for their security needs. This should cut down on procurement and onboarding times, too. Alongside the Security Store, Microsoft is also allowing Security Copilot users to build their own AI agents. Microsoft launched some of its own security AI agents earlier this year, and now security teams can use a tool that’s similar to Copilot Studio to build their own. You simply create an AI agent through a set of prompts and then publish them all with no code required. These Security Copilot agents will also be available in the Security Store today. Most Popular - Microsoft launches ‘vibe working’ in Excel and Word - Ford’s CEO isn’t impressed with Apple CarPlay Ultra - Anker’s fastest airline-friendly power bank is now available - Anthropic releases Claude Sonnet 4.5 in latest bid for AI agents and coding supremacy - Logitech’s MX Master 4 adds haptic feedback, mostly just for fun",
    "domain": "theverge.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20250930T134500Z",
    "date_download": "2025-09-30T15:33:05.552203+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theverge.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.theverge.com/news/788195/microsoft-security-store-launch-copilot-ai-agents",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "468471819fb2c9442f8b35bcf316e1b5",
    "processed_at": "2025-09-30T17:33:10.387576",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article primarily discusses Microsoft's Security Store, which includes AI agents and solutions for cybersecurity, indicating a strong focus on AI applications in the business sector.",
      "keywords": [
        "Microsoft",
        "Security Store",
        "AI agents",
        "Security Copilot",
        "cybersecurity",
        "SaaS"
      ]
    }
  },
  {
    "url": "https://www.wired.com/review/subaru-crosstrek-hybrid-2026/",
    "title": "Subaru Crosstrek Hybrid 2026 Review",
    "text": "The 2026 Subaru Crosstrek Hybrid gives the brand’s smallest utility vehicle what it’s long needed: better gas mileage. It’s a compact all-wheel-drive crossover hatchback that incorporates all of Subaru’s traditional off-road chops, with the added benefit of somewhat better fuel efficiency. It’s rated at 36 mpg combined versus the 29 mpg EPA combined number for the conventional Crosstrek, with either 2.0- or 2.5-liter engine. (The butch Crosstrek Wilderness trim comes in at 27 mpg combined.) Subaru calls the Crosstrek a subcompact, to position it below the Forester compact crossover. That designation will startle anyone who drives a subcompact from the 1990s or 2000s, but bracket creep due to vastly tougher crash tests has affected every vehicle—and aside from the Impreza hatchback (a Crosstrek minus the lift and the off-road trim), it’s the smallest car Subaru will sell you. After two previous, somewhat compromised attempts, the company at last is adding hybrid options to two of its most popular lines: the Forester last year, now the Crosstrek. There were two previous “hybrid” Crosstrek models, one for each of the two earlier generations. The 2014 Subaru XV Crosstrek Hybrid was only a mild-hybrid system very much like Honda’s: the electric motor added torque and replaced the starter and generator, but couldn’t propel the car itself in any meaningful way. Switching among the engine, motor, or both also wasn’t very smooth. Then came the 2019 Subaru Crosstrek Hybrid, actually a plug-in hybrid with an underwhelming 17 miles of electric-only range. It was essentially a compliance car for a maker whose fuel economy has never been particularly good, and it was available only in limited markets. Unlike the mild hybrid, which was Subaru’s own design, the PHEV used components mixed and matched from various Toyota hybrids and plug-in hybrids. Now we have a proper, conventional hybrid model of the Crosstrek. On a brand-hosted test drive of more than 100 miles in Oregon and Washington states, it proved the smoothest, quietest, and nicest Crosstrek. The fuel economy of 38.1 mpg over that distance may not be representative, as the drive combined 25 miles on forest trails with more than 90 miles of mostly highway driving—and a 1,900-foot decline in altitude. Hybrids do well when they’re going downhill. Real, Mechanical AWD The Crosstrek Hybrid’s 1.1-kilowatt-hour liquid-cooled lithium-ion battery is located under the rear floor, packaged so that it only cuts cargo volume incrementally. The hybrid Crosstrek retains the standard car’s 16.6-gallon fuel tank, giving it a range of almost 600 miles. That contrasts to most hybrid SUVs, which have smaller tanks. The battery powers a two-motor hybrid system that entirely replaces the chain-driven continuously variable transmission (CVT) in other Crosstreks. Subaru’s standard 2.5-liter flat-4 engine has been heavily adapted. At lower engine revs, torque from the electric motor compensates for a lack of power. One motor replaces the starter and generator of a conventional combustion engine, and uses overrun engine power to recharge the battery. The other powers the wheels through the center differential and also charges the battery via regenerative braking.",
    "domain": "wired.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20250930T140000Z",
    "date_download": "2025-09-30T15:33:07.582609+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "wired.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.wired.com/review/subaru-crosstrek-hybrid-2026/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "93346dde78e85c032093d4d8dfe1bf5c",
    "processed_at": "2025-09-30T17:33:10.387619",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is a review of the 2026 Subaru Crosstrek Hybrid, focusing on its features, performance, and fuel efficiency. It does not discuss artificial intelligence or related topics.",
      "keywords": []
    }
  }
]