[
  {
    "url": "https://www.dr.dk/nyheder/seneste/rusland-vi-arbejder-stadig-paa-putin-trump-moede",
    "title": "Rusland : Vi arbejder stadig på Putin - Trump - møde | Nyheder",
    "text": "I går kom der meldinger fra Det Hvide Hus om, at et møde mellem præsident Donald Trump og Ruslands ditto, Vladimir Putin, var sat i beo. Et møde, førstnævnte ellers forventede ville finde sted i den nærmest fremtid i Ungarn. Nu holder Rusland døren åben. Ruslands viceudenrigsminister, Sergei Ryabkov, siger ifølge russiske medier, at forberedelserne til et møde mellem de to er i gang. I går lød det fra Kremls talsmand, Dmitry Peskov, at der ikke er fastsat nogen klar dato for et møde, og at \"seriøs forberedelse\" er nødvendig. Trump var da også mindre håbefuld i nat, end han var lige efter telefonsamtalen med Putin i sidste uge. - Jeg vil ikke have et ligegyldigt møde. Jeg gider ikke spilde tiden, sagde Trump i nat.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:05:58.251289+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/rusland-vi-arbejder-stadig-paa-putin-trump-moede",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d7b0e3ff795a8e7060f6625920567fa0",
    "processed_at": "2025-10-22T13:07:17.451691",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a political meeting between Donald Trump and Vladimir Putin, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/event/laerling/minister-efter-laerlinges-beretninger-om-chikane-og-vold-straffeloven-gaelder-ogsaa-i",
    "title": "Minister efter lærlinges beretninger om chikane og vold :  Straffeloven gælder også i skurvognen  ",
    "text": "68 nuværende og tidligere lærlinge fra byggebranchen fortæller til P3-dokumentarserien 'Bare en lortelærling' om grænseoverskridende opførsel, mobning, sexisme og racisme på deres læreplads. - Der er ikke noget galt i at få en skideballe. Det skal vi kunne tåle. Men du skal ikke have trusler eller blive nedgjort, lyder det blandt andet fra en af de anonyme lærlinge i dokumentaren. De mange vidnesbyrd fra lærlingene får nu undervisningsminister Mattias Tesfaye – der selv er uddannet murer – til at reagere. - Jeg tror, vi har behov for at få sagt det, så det også kan høres bagerst i skurvognen: Straffeloven gælder også her – og arbejdsmiljøloven gælder også for lærlinge, siger ministeren til P3. Mattias Tesfaye (S) anerkender, at der visse steder i branchen er problemer med en dårlig og gammel kultur, fordi lærlinge er blevet set på som “en form for andenrangsborgere”. - Vi er et andet sted nu. Langt de fleste virksomheder er ordentlige steder at være under uddannelse, men der er stadig noget af den gamle kultur, der hænger ved, siger ministeren. Han er derfor klar på at justere i kommende trivselsmålinger fra erhvervsskolerne, så der kommer mere viden om, hvilke brancher og hvornår i uddannelsesforløbet, der er udfordringer. - Vi laver allerede målinger, men det vi kunne prøve næste gang, at den måling skal laves, er at have mindre fokus på tiden inde på skolen og mere fokus på tiden ude i praktikperioden, siger Mattias Tesfaye. Tal viser, at elever falder fra under læretiden Selvom der flere gange har været fokus på arbejdsmiljøet i byggebranchen, og 68 lærlinge nu står frem med forskellige oplevelser, er det sparsomt med viden om lærlinges tid på lærepladserne. Der findes nemlig ingen store undersøgelser, der går tæt på, hvad lærlinge oplever under deres praktik, fortæller Lene Tanggaard, professor på Aalborg Universitet, der har forsket i frafald på ungdomsuddannelserne. - Store dele af uddannelsen foregår i praktikken, og meget af det, der foregår i praktikken, ved vi ikke så meget om, siger Lene Tanggaard. Der bliver – som undervisningsministeren nævner – lavet trivselsmålinger på erhvervsskolerne. Men selvom læretiden fylder langt det meste af uddannelsen, er der faktisk kun ét ud af 42 spørgsmål i skolernes måling, der handler direkte om trivslen i læretiden. Der er ellers nok at spørge ind til, for det er netop under praktikken, at flest elever falder fra, siger professoren. - Erhvervsuddannelserne er nogle af de uddannelser, der har den største frafaldelsesprocent. Op til 40 procent falder fra – og de falder fra, når de møder praktikken, siger Lene Tanggaard. Elevorganisation: 'Det absolutte kerneproblem' Ifølge Danmarks Evalueringsinstitut, EVA, er en af de væsentligste frafaldsårsager netop overgangen mellem uddannelsens forskellige forløb - altså fra skolegang til læretid. Det er da også noget af det, som Mads Haugbølle Behrendsen, der er forperson for Erhvervsskolernes Elevorganisation, savner mere viden om. - Vi er herinde ved det absolutte kerneproblem, at der mangler simpelthen tilstrækkelig information om, hvad den faktiske virkelighed er ude på lærepladser, siger han. En række mindre undersøgelser peger dog på, at tonen i byggebranchen kan være hård. For eksempel viser en undersøgelse fra tre store byggepladser, som organisationen Byggeriets Samfundsansvar besøgte i 2024, at den hårde tone på byggepladserne skaber mistrivsel og fejl. I undersøgelsen svarer 42 procent blandt andet, at de ikke opfatter drillerierne i deres team som kærligt ment, mens 50 procent ikke føler sig sikre på at kunne begå fejl uden at blive udpeget og udskammet for det. Selvom undersøgelsen ikke er repræsentativ, bakker Lene Tanggaard op om, at tonen på visse byggepladser kan være hård. - Nogle gange bliver man måske udsat for noget af det, som mester og svendene selv har været udsat for, da de var lærlinge - og så opfattes det lidt som en del af traditionen, at man skal kunne klare mosten, siger Lene Tanggaard. Når tidligere og nuværende lærlinge nu fortæller om grænseoverskridende adfærd til DR, viser det også, at de yngre generationer ikke ønsker at gentage de ældre kollegers arbejdskultur, påpeger hun. - Det er et vidnesbyrd om nogle lærlinge, som begynder at sige fra, fordi vi jo heldigvis har opdraget vores børn til at markere, hvis deres grænser bliver overskredet, siger Lene Tanggaard. DI: Hver historie er én historie for meget Det er i øvrigt ikke kun undervisningsministeren, der nu rykker på ønsket om at vide mere om lærlingenes oplevelser på de virksomheder, hvor de står i lære. Tidligere i dag kunne DR fortælle, at arbejdsgiver- og erhvervsorganisationen Dansk Industri (DI) nu er gået sammen med fagforbundet 3F om at blive klogere på praktiktiden. DI og 3F vil nemlig sammen række ud til cirka tusind lærlinge i byggeribranchen med henblik på at lave hyppige trivselsmålinger, hvor der netop vil blive spurgt ind til læretiden ude i virksomhederne, fortæller DI’s vicedirektør, Signe Tychsen Philip. - Når de unge mennesker bliver spurgt, er det næsten 90 procent, der er glade for deres lærested. Når det er sagt, er hver af disse historier jo én historie for meget, siger Signe Tychsen Philip. Du kan se to ud af fire afsnit af ’Bare en lortelærling’ på DRTV onsdag den 22. oktober og første afsnit samme dag på DR1. Du kan også høre den nye podcast ‘Under radaren: De usynlige lister’, der går tæt på lærlingenes oplevelser.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:05:58.294774+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/event/laerling/minister-efter-laerlinges-beretninger-om-chikane-og-vold-straffeloven-gaelder-ogsaa-i",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5d863e5fa52ddee2c55800068e1ed99e",
    "processed_at": "2025-10-22T13:07:17.451730",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses issues related to apprentices in the construction industry, including harassment and workplace culture, without any mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/zelenskyj-faar-loefte-om-norsk-stoette-paa-kort-visit-under-rundrejse/10984858",
    "title": "Zelenskyj får løfte om norsk støtte på kort visit under rundrejse",
    "text": "Den ukrainske præsident, Volodymyr Zelenskyj, holder onsdag formiddag et møde med Norges statsminister, Jonas Gahr Støre, i den militære lufthavn Gardermoen ved Oslo. Det skriver den norske regering i en pressemeddelelse. Den militære lufthavn ligger i direkte forlængelse af den civile lufthavn. - Norges støtte til Ukraine er stærk og fortsætter. Det er afgørende at have en tæt dialog med de ukrainske myndigheder, så støtten imødekommer behovene i Ukraine, siger Støre ifølge meddelelsen. Onsdag oplyser Norge, at landet sammen med EU bidrager med yderligere 1,5 milliarder norske kroner til at sikre strøm og varme til Ukraine i løbet af vinteren. Det svarer til knap en milliard danske kroner. Senere onsdag skal den ukrainske præsident til Sverige, hvor han blandt andet skal besøge våbenproducenten Saab og mødes med den svenske statsminister, Ulf Kristersson. Begge dele sker som led i en 'rundrejse i Europa', skriver den norske regering. - Af tidshensyn bliver mødet (med Støre, red.) på Gardermoens militære lufthavn, skriver regeringen. Også præsident Zelenskyjs hustru, Olena Zelenska, er med. Seneste besøg i Norge var i slutningen af marts i år, skriver nyhedsbureauet NTB. Tidligere i oktober var Zelenskyj til et topmøde i Bella Center i København. Her lød det, at Ukraine er klar til at hjælpe Danmark med at håndtere trusler fra droner, efter at Danmark og andre europæiske lande den seneste tid har oplevet droneaktivitet og krænkelser af luftrum. Ved onsdagens møde i Sverige vil Zelenskyj og Kristersson præsentere det, som regeringen i en pressemeddelelse betegner som en nyhed inden for forsvarseksport. Det er uvist, hvad nyheden er. Saab er blandt andet producent af Gripen-kampflyet, overvågningsflyet GlobalEye, missilsystemer, infanteripanserværnsvåben og andet udstyr. Det skriver nyhedsbureauet Reuters. Netop Gripen-flyet har i længere tid været nævnt som en mulighed som led i svensk støtte til Ukraine.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:06:00.616751+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/zelenskyj-faar-loefte-om-norsk-stoette-paa-kort-visit-under-rundrejse/10984858",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "f838e31cdcbd19e5be499e71188bb8a7",
    "processed_at": "2025-10-22T13:07:17.451825",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a meeting between Ukrainian President Zelenskyj and Norwegian Prime Minister Støre regarding support for Ukraine, focusing on military and humanitarian aid. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.npr.org/2025/10/19/nx-s1-5570842/a-new-museum-in-nashville-celebrates-gospel-musics-contribution-to-american-culture",
    "title": "Museum of Christian Gospel Music honors diversity of music : NPR",
    "text": "New Museum of Christian Gospel Music honors a diversity of music with a message A new museum in Nashville celebrates gospel music's contribution to American culture On a Friday morning in early October, musicians, industry executives, and politicians packed into the open-air café at the brand new Museum of Christian and Gospel Music — the first museum in the U.S. designed to celebrate the breadth of Christian music. They spilled onto the downtown Nashville sidewalk, mere blocks away from historic churches and country stars' raucous tourist bars. It was a ceremony many years in the making. There is an institution devoted to Black Gospel in St. Louis, one for white Southern gospel in Pigeon Forge, Tennessee, and the Gospel Music Association (GMA) has been inducting originators from both those traditions, along with Christian pop pioneers, into its Hall of Fame since 1972. But for the entirety of those 50-plus years, the hall's been without a physical location. Past efforts to build one failed. But Jackie Patillo, the first woman and person of color to lead the GMA, pushed to create a comprehensive home for these musical histories once and for all. \"The word 'gospel' music really encompasses a message with lots of different sounds, so it's been awesome to see how we've gone from the hymns to choruses to rap music and the contemporary Christian music industry,\" said Patillo. The museum now houses the GMA's Gospel Music Hall of Fame, and because its exhibits are designed to weave these varied musical lineages into one story, no one genre gets its own section. Instead, performers are organized according to either chronology or commonalities. One display describes all sorts of family bands, while another spotlights musicians who've embraced pastoring roles and pastors who've become recognized as musicians. All that glitters is not gold The museum has just 11,000 square feet so its executive director and team of curators had to be selective about its contents. But they didn't default to simply featuring the biggest-selling singers. Even though Christian and gospel music have long operated as industries, they measure success differently from the rest of popular music: spiritual impact, a more ephemeral accomplishment, is touted just as much as commercial stats. And the artifacts on display are meant to reflect those priorities. \"We have one little area we're trying to put all the gold records in,\" explained Steve Gilreath, the museum's executive director. \"You don't see them everywhere you go…it's just not about that with this industry.\" The first item visitors encounter upon entering is a trophy, given to Bill Gaither when he received the songwriter of the year honor at the very first Dove Awards ceremony in 1969, celebrating excellence in Christian music. Gaither is a noted composer of Southern gospel standards that proclaim faith in a saving God, and take sentimental comfort in it. Popularized by his vocal groups, many of his songs have even made it into church hymnals. An American soundtrack The museum highlights iconic singers, composers and choir directors in the culturally and musically distinct African American gospel lineage, too. That tradition supplied American music with its templates for catching the spirit and giving voice to profound lament and righteous conviction, and its canon served as the soundtrack of the Civil Rights Movement. \"Gospel music, from the negro spiritual to now, has always been a [symbol] of hope,\" said Derek Minor, a museum honoree and gospel-schooled hip-hop artist. \"There was always an idea that God was coming back to liberate. The OG gospel artists, I don't think they were just trying to write great songs. They were trying to inspire people that were at their lowest,\" said Minor. He has his own way of carrying on that tradition. On his 2018 album \"The Trap,\" he brought gospel uplift to the present-day struggle to break cycles of poverty, violence and incarceration, a perspective that was met with surprise — people didn't expect that a Christian artist would depict those realities in his lyrics. \"There's a liberation that needs to happen in [this] moment as well,\" insisted Minor. \"And that's what I wanna contribute to.\" Religious/secular crossover The idea of crafting devotional versions of secular styles was around long before Minor began rhyming. The museum has a particular focus on a period in the '70s and '80s when a whole new genre began to flourish: Christian Contemporary Music (CCM). One of the largest artifacts in that section is a hulking, vintage studio console. Its inclusion came as a surprise to Brown Bannister, an engineer and producer who used it to help flesh out the sound of contemporary Christian pop. \"When I saw this in here, my heart just stopped,\" he recalled. It reminded him of the seminal soft-rocking albums he shaped for Amy Grant and other Christian singer-songwriters, many of whom — like Bannister himself — have since been inducted into the Hall of Fame. The sonic textures he achieved with session players evolved with popular music trends, but one particular emphasis set the CCM approach apart. \"To me, Christian music — it's not about the music, it's about the lyric. That's what differentiates,\" said Bannister. \"So you're making sure that you're serving the artists and serving the lyrics of their song and trying not to get in the way of the message. You're trying to enhance it.\" That mindset was new to Rachael Lampa, who signed her first Christian record deal in 2000 at the age of 14. Lampa is featured in an exhibit on artists who released their debut albums as teenage girls. She gravitated toward power ballads and rhythmic dance tracks that were in step with the era, but learned that having a Christian platform as a young woman meant that she was expected to be an ideal role model. (She says she once received criticism for simply wearing a tank top.) \"It's people trying to express themselves and express their experience,\" said Lampa. \"But also be a teenager, getting to know who they are in the first place and then who God is and how to talk about that, how to sing about that.\" Walking the halls of the new museum summoned moving memories for Lampa, and if it does the same for other visitors, GMA president Patillo ensured that space is set aside for their reflections. \"We're gonna give people an opportunity in a little testimonial booth where they can share how a song has impacted their lives,\" Patillo explained. \"This music is about changing us, it's about nourishing us, it's feeding our soul and our spirit. And we get to tell those stories here.\"",
    "domain": "npr.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:06:18.950524+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "npr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.npr.org/2025/10/19/nx-s1-5570842/a-new-museum-in-nashville-celebrates-gospel-musics-contribution-to-american-culture",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "bf42b122cb71aa7ffc8a2ef4404e6614",
    "processed_at": "2025-10-22T13:07:17.452535",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the opening of a museum dedicated to Christian gospel music and its cultural significance, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.npr.org/transcripts/nx-s1-5423318",
    "title": "Karine Jean - Pierre explains her break from Democrats : NPR",
    "text": "Karine Jean-Pierre shares why she no longer identifies as a Democrat in her new book MICHEL MARTIN, HOST: For almost three years, Karine Jean-Pierre served as White House press secretary, meaning she was the face and voice of the Biden-Harris administration during daily White House briefings and trips around the world. In a new book, Jean-Pierre argues that Democrats knew what was coming ahead of their defeat in the 2024 elections and not only didn't do enough to stop it, but also helped it along by being disloyal, shambolic and insufficiently committed to its stated values. This led her to ask herself if this was still the party for her. Her answer? No. Jean-Pierre says she no longer identifies as a Democrat. The title of her new book and her new political stance is \"Independent.\" And she's with us now to tell us more about it. Karine Jean-Pierre, thanks so much for joining us. KARINE JEAN-PIERRE: Thank you so much for having me, Michel. MARTIN: You open the book with your experience behind the scenes of the June 2024 presidential debate, a date that's, you know, seared into a lot of people's memories. And it was there that questions around then President Biden's kind of health and mental acuity really seemed to take off. So tell us a little bit about what you saw behind the scenes. JEAN-PIERRE: So I had not seen the president because he had been in debate prep, and it was on the political side. I was not involved in the campaign in any way. So the first time I actually heard him speak was while he was debating. So when I heard his voice, I thought to myself, uh-oh. He was hoarse. He kind of looked like he was sick. So I thought to myself, something is up. And so what I started thinking from that moment was, oh, goodness. This is what is going to be used for everything that I've been pushing back on, his age - is he fit? Like, automatically, anytime he would sneeze or have a runny nose or something would happen, that would be where the questions would go. MARTIN: Let me just be clear here. JEAN-PIERRE: Yeah. Yeah. MARTIN: Because you are very clear in the book that you saw no reason to question the former president's mental acuity, his fitness for the job. You stand by that. JEAN-PIERRE: I stand by that 110%. MARTIN: I do want to say that you realize that a lot of people just don't believe that. JEAN-PIERRE: Look, all I can tell you is what I saw with my own eyes and what I experienced myself. MARTIN: To that end, your beef is not with journalists asking questions. JEAN-PIERRE: No, my beef is not with journalists, no. MARTIN: The core of the book is about the Democratic Party and what you experienced at the White House. You write about what you call bickering and backbiting. So say more about why... JEAN-PIERRE: Yeah. Yeah. MARTIN: ...You say that that backbiting is what opened the door for you to think about other alternatives. JEAN-PIERRE: Yeah. So Joe Biden objectively had a very successful four years. And here we are on the cusp of a election of a lifetime that we all need to get behind our person, and we couldn't do it. Republicans are able to do it. They were able to get behind their guy, however flawed their guy is. And they say, yep, this is our guy. With all the flaws and everything, this is our guy. And we weren't able to do it. MARTIN: By that you mean, like, for example, the former speaker of the House, Nancy Pelosi, sort of letting it be known that she was concerned. JEAN-PIERRE: Yes. MARTIN: Or George Clooney and his piece in The New York Times. JEAN-PIERRE: All of it, all of it. MARTIN: Is that what you're talking about? JEAN-PIERRE: All of it. And I talk about that in the book. MARTIN: One other thing you write about, which I really found was interesting, is, like, the snippety sniping directed at you. Apparently, there are people who felt you weren't very good at your job. They said you were too wooden at briefings, that you didn't really understand policy. How do you understand those critiques now that you have some distance from it, or do you? JEAN-PIERRE: Well, look, in the moment, I was quiet. I didn't defend myself in the moment because I was focused on a job that I was honored and privileged to have had, which is the White House press secretary, because the president believed that I can do this. What I can do is state facts, which is no one has ever looked like me that has been at that podium standing behind that lectern. And when we are first, you are critiqued and looked at differently because people already don't think you belong there in that position. And, you know, look, I had a job that was coveted. MARTIN: Interesting. JEAN-PIERRE: And the people who wanted my job didn't think I deserved the job for whatever reasons, right? And so I understood as a Black woman that things are just different for people who look like me. MARTIN: You write at length about how you feel the Democratic Party has particularly failed Black women. JEAN-PIERRE: So I have a chapter on, it's called Sisterhood. It's kind of a love letter to Black women. And I feel like if you look at Black women and how they come out and vote no matter what, because they understand what's at stake, 92% for Kamala Harris. Black women understand, look, there's a crisis here. Not only is it going to affect me and my family and the community that I love, but it's going to affect everyone. And we feel like it is our duty to try to save and try to really speak out. And we get forgotten. And one of the things that I respected from the Biden-Harris administration is we didn't forget them. And you see that in how we made sure Black women's voices were everywhere within the administration. I do believe, and I want to be very clear about this, that I meant a lot to people because of the communities that I represented. They felt seen when they saw me at the podium behind that lectern. Whether it was women of color, Black women, queer community, LGBTQ community, immigrant, they felt seen. And that mattered to me. And I wrote this book because I truly believe in what I'm saying, and I want to start a conversation. I'm not looking for a fight with Democrats or Republicans. I'm looking to - well, I'm looking to have a conversation. MARTIN: OK. JEAN-PIERRE: Yeah. MARTIN: So let's have that conversation. JEAN-PIERRE: Yeah. MARTIN: What does identifying as an independent solve the problem that you have identified? JEAN-PIERRE: Right. Look, for me, I'm not telling people, hey, you go become an independent. That's not my role. There is a growing number of people who see themselves as independents, including young people. We have to question, why is that? There is a fundamental problem here. For me, it is I want to show, how is this person going to fight for my vote? Rubber-stamping Trump's appointees, let me tell you, that is not the way that that should've gone. We knew what was about to happen, Project 2025. Anti-DEI was, like, one of the first things. We knew. Immigrants being attacked, we knew this was going to happen. And so I feel like we should've been better. MARTIN: So you said you wanted to start a conversation. The book is just out. What are you hearing from people? JEAN-PIERRE: I hope people are inspired to continue to either be in the fight or get into the fight. There's an opportunity to reimagine what politics can be, to reimagine what America can be. That means you can't stay quiet because silence is complicit. MARTIN: Karine Jean-Pierre is the author of \"Independent: A Look Inside A Broken White House, Outside The Party Lines.\" Karine Jean-Pierre, thanks so much for talking with us. JEAN-PIERRE: Thank you, Michel. I appreciate it. Thank you for the opportunity.\\ Copyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information. Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
    "domain": "npr.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:06:19.399273+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "npr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.npr.org/transcripts/nx-s1-5423318",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "139a220015518aedff834bf356470a9e",
    "processed_at": "2025-10-22T13:07:17.452573",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Karine Jean-Pierre's political views and experiences as a White House press secretary, focusing on her departure from the Democratic Party and her new book. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/california/story/2025-10-22/california-business-leaders-call-on-voters-to-streamline-states-environmental-laws",
    "title": "California business leaders want voters to streamline environmental reviews",
    "text": "California business leaders want voters to expedite state’s environmental review process for housing, infrastructure - Share via - The California Chamber of Commerce introduced a ballot initiative to overhaul the state’s landmark environmental law with strict new review deadlines. - The proposal would impose a 365-day limit on environmental reviews for essential projects including affordable housing, clean energy and wildfire resiliency. - The initiative could reach voters in November 2026 and comes after lawmakers passed sweeping exemptions to the California Environmental Quality Act for urban home builders in July. California voters could soon be asked to usher in a major overhaul of the state’s landmark environmental law, a proposal aimed at expediting crucial infrastructure projects, including housing construction, by creating new deadlines for environmental oversight. The California Chamber of Commerce on Tuesday introduced a ballot initiative that looks to “streamline and speed up approval” of essential projects, proposing stringent timelines for reviews under the California Environmental Quality Act, or CEQA — long considered a barrier to development. The proposal comes less than four months after state lawmakers, led by Gov. Gavin Newsom, pushed through some of the most expansive CEQA exemptions yet for home builders working in urban areas zoned for multifamily units. But chamber leaders say this ballot measure, which could be considered as early as November 2026, would do more than just carve out another exception for what’s become known as the “Swiss cheese CEQ.” It would but revise the process entirely. Gov. Gavin Newsom and California legislators passed a major reform of the California Environmental Quality Act on Monday. The new laws remove a key point of leverage for project opponents that has been embedded for more than a half-century in California’s development regime. The “Building an Affordable California Act” seeks to establish “reasonable timelines” for environmental oversight on projects deemed essential, such as those focused on affordable housing, clean energy, secure water, healthcare and wildfire resiliency. It would still require that projects comply with the environmental law, but would enact new deadlines for public hearings as well as state and local approvals, in most cases, within 365 days. “Californians deserve a law that recognizes prosperity isn’t the enemy of preservation,” Jennifer Barrera, the president and chief executive of the chamber, wrote in a statement. “Modernizing that law won’t just ease California’s affordability crisis and boost our economy — it will prove the naysayers wrong about our state. ... It’s time to build an affordable California.” In the measure, the chamber called CEQA an outdated system that is “too slow, too bureaucratic and too costly,” and a main driver of the state’s high cost of living. CEQA supporters disagree, calling it key in protecting the state’s natural resources, wildlife and vulnerable communities. “Developers have latched on to using CEQA as the boogeyman that they’re going to blame for a lot of things, specifically the affordable housing crisis,” said Frances Tinney, a staff attorney with the Center for Biological Diversity. She said that prior CEQA carve-outs have yet to jump-start affordable housing, while helping to increase developers’ profits and decrease accountability. “To just keep hacking at CEQA before we even wait to see the consequences of the last time we hacked at CEQA is just not responsible,” Tinney said, noting the Legislature’s CEQA exemptions passed over the summer. Newsom signed Senate Bill 79 into law on Friday. The historic bill, which looks to add density to transit hubs across California, is one of the most ambitious state-imposed housing efforts in recent memory. In theory, CEQA is relatively simple, requiring proponents of a project to disclose and, if possible, lessen their environmental effects. But in practice, it has often led to long environmental reports, studies and reviews, that are sometimes followed by lawsuits over possible inadequacies that can require a restart. Overhauls and changes to the environmental law have for years faced fierce opposition from progressive lawmakers, environmentalists and labor unions — key factions in California’s Democratic majority. The chamber’s proposal also would provide new timelines for legal challenges under CEQA, which has been repeatedly weaponized by unions, NIMBYs and project opponents to stop or delay certain development for reasons that often have nothing to do with the environment. The California chamber’s introduction of the measure is the first step to appear on a ballot. It will now be reviewed by the state’s attorney general, including a fiscal analysis and public comment period, before the chamber needs to collect approximately 540,000 signatures in support of it. “The initiative was carefully crafted to protect the environment while ensuring that plans for much-needed housing, clean energy, reliable water supplies, and public health and safety facilities are reviewed in a timely manner,” Barrera said. “Californians deserve a law that recognizes prosperity isn’t the enemy of preservation.”",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T104500Z",
    "date_download": "2025-10-22T11:06:34.475909+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/california/story/2025-10-22/california-business-leaders-call-on-voters-to-streamline-states-environmental-laws",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "44e54c215ade6414a08b76f58847e4e8",
    "processed_at": "2025-10-22T13:07:17.452877",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses California's environmental review process and proposed changes to legislation regarding housing and infrastructure, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  }
]