[
  {
    "url": "https://journalisten.dk/nyhedsoverblik/?news_band_id=224515",
    "title": "Nyhedsoverblik - Journalisten",
    "text": "DR’s podcast ’Min ven Hermann Göring’ sikrede sig fredag aften en Prix Europa som ’Årets bedste europæiske dokumentarserie på lyd’.Det skriver DRi en pressemeddelelse.Prix Europa er en fælleseuropæisk konkurrence, hvor public service-stationer fra hele Europa gennem nu 39 år har dystet i disciplinerne årets bedste tv-, lyd- og online-produktioner.Dokumentarserien ’Min ven Hermann Göring’ er historien om et umage venskab mellem en jøde fra det bedre borgerskab i København, Hugo Rothenberg, og én af de værste krigsforbrydere i verdenshistorien, nazisten Hermann Göring.Den er tilrettelagt af Louis Elsass Meyer og Mikkel Bøgeskov Andersson og er produceret af selskabet MonoMono med Rune Sparre Geertsen som redaktør.",
    "domain": "journalisten.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:44:35.800997+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "journalisten.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://journalisten.dk/nyhedsoverblik/?news_band_id=224515",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0b63b2d226279bb4790a9df6bb5918d4",
    "processed_at": "2025-10-20T12:46:06.345150",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a podcast and a documentary series about a historical figure, Hermann Göring, and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/live/c5y8k7k6v1rt",
    "title": "Snapchat and Duolingo among major apps down in Amazon Web Services outage - live updates",
    "text": "Problem could be related to Domain Name System - but what is that?published at 11:32 BST Liv McMahon Technology reporter We don't know the full details of what has caused a number of critical Amazon Web Services to fall offline this morning and may not for some time. But Amazon said in one of its updates earlier that the issue \"appears to be related to DNS resolution of the DynamoDB API endpoint in US-EAST-1\". DNS, which stands for Domain Name System, is often likened to a phone book for the internet. It effectively translates the website names people use into IP address numeric equivalents that can be read and understood by computers. This process basically underpins the way we use the internet, and disruptions to it can leave web browsers unable to locate the content they are looking for.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T093000Z",
    "date_download": "2025-10-20T10:45:00.996056+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/live/c5y8k7k6v1rt",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "71ecf4bf4f9d98832eb9f14f6a43fbe5",
    "processed_at": "2025-10-20T12:46:06.346046",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article discusses an outage related to Amazon Web Services and DNS resolution, which are not primarily focused on artificial intelligence. It does not mention AI technologies or applications.",
      "keywords": [
        "Amazon Web Services",
        "DNS",
        "DynamoDB",
        "internet",
        "outage"
      ]
    }
  },
  {
    "url": "https://pressgazette.co.uk/comment-analysis/how-to-grow-publishing-revenue-in-a-world-of-declining-traffic/",
    "title": "How to grow publishing revenue in a world of declining traffic",
    "text": "How to grow publisher revenue when overall traffic is largely in decline was top of the agenda at Press Gazette’s Future of Media Trends event in London on Thursday. Delegates were brimming with ideas and while the discussions were held on a Chatham House basis I can reveal a few key takeaways from our sponsored roundtables. Around 50 delegates took part in a series of discussions aimed at solving key industry revenue challenges. 1. Let’s take back control of programmatic advertising While publishers were generally a little gloomy about the prospects for programmatic advertising, Sherzod Rizaev of sponsor Assertive Yield B.V. made a strong case for taking back control of advertising tech stacks. Publishers don’t have to be passive in the face of dwindling market share and in particular they can make better use of data to get a real-time view of how much ad revenue is being made by each piece of content. 2. Trust, heritage and value could be a willing paywall formula “Saving the free internet” was the title of a discussion chaired by Admiral: The Visitor Relationship Management Company, represented by global head of sales Trevor Abbott. Nevertheless, lots of publishers still saw paywalls of some description as the answer – with many leading towards framing them as memberships rather than subscriptions. Brands need to harness their trust and heritage to compete in the world of ChatGPT and ensure they are providing readers with valuable information worth paying for. As an aside, Abbott told me he was surprised to see publishers at the event did not report massive traffic falls in the face of competition from LLMs but he warned that if the US market is anything to go by, this could be happening soon in the UK. 3. Use AI for efficiencies but don’t join ‘race to the bottom’ Newspublish and Layout International sponsored the table on how to make cost savings in response to the rise of zero-click AI-powered searches (featuring founder Jean-Michel Habis). Publishers agreed that joining a “race to the bottom” by publishing AI-generated content was not the way forward. Humans must control the content because readers are investing in trust. But there was agreement that AI can be used to streamline content when it comes to marketing, newsletters, video, image alt text, tags and even page layouts. 4. Invest in human talent The FT Strategies sponsored table with director Adriana Menezes Whiteley agreed on the need to “double down on human-led content” but also heard that AI can be used to drive volume and new delivery mechanisms for journalism. Publishers talked about leaning into talent-led, or personality-led, content as well as community and events. But questions were raised around who pays for the establishment of facts and old-fashioned reporting in the world of LLMs. 5. Sharing the right data is key to building a loyal audience WordPress VIP sponsored a roundtable discussion about how to turn fly-by readers into fans. This table concluded that getting the right data to journalists was a major priority as was making sure staff are focused on key tasks (rather than doing lots of things at the same time). Publishers reported that, so far, negligible traffic is coming to them from the LLMs. 6. Have a clear mission and a galvanising north star metric And finally, the table sponsored by Q5 chaired by Graham Page discussed where the accountability should sit for attracting high-value audiences. This can be with a strong editor-in-chief who can be a “galvanising force for the whole organisation”. But Page said product, audience and commercial teams can all be involved in this if they are “all engaged with one mission which has to be encapsulated in a north star metric”. When it comes to subscriptions businesses, Page said a metric based around returning readers and building habits tends to be the most effective. Email pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog",
    "domain": "pressgazette.co.uk",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T101500Z",
    "date_download": "2025-10-20T10:45:38.484213+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "pressgazette.co.uk",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://pressgazette.co.uk/comment-analysis/how-to-grow-publishing-revenue-in-a-world-of-declining-traffic/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8e91e2b8e0b57d7994285b8ec97a0120",
    "processed_at": "2025-10-20T12:46:06.349407",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.85,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article discusses the impact of AI on publishing, particularly in relation to programmatic advertising, AI-generated content, and the use of AI for efficiencies in journalism. It highlights how publishers are navigating challenges posed by AI technologies, indicating a significant focus on AI within the context of the publishing industry.",
      "keywords": [
        "AI",
        "programmatic advertising",
        "AI-generated content",
        "AI-powered searches",
        "LLMs"
      ]
    }
  },
  {
    "url": "https://deadline.com/print-article/1236591949/",
    "title": "Deadline",
    "text": "Saudi Arabia’s Red Sea Film Fest Makes History With Country’s First Live Accompanied Charlie Chaplin, Buster Keaton and Laurel & Hardy Screenings The Red Sea Film Festival is set to make cinema history for Saudi Arabia at its upcoming edition as it hosts the country’s first silent film screening accompanied by a live musical accompaniment. The UK’s silent film musical specialist Neil Brand will provide live accompaniment to three silent slapstick shorts from Buster Keaton (One Week), Charlie Chaplin (The Immigrant) and Laurel & Hardy (Liberty). The live music screening event comes as Saudi Arabia continues to grow its film culture and industry in the wake of the lifting of its 35-year cinema ban in 2017. It was announced as part of the festival’s classic film focused Treasures stand, also featuring two classic Arab and three international feature films. The lineup also features the international premiere of the recent 4K restoration by the National Film Archive of India of Muzaffar Ali’s 1981 musical drama Umrao Jaan; as well as Alfred Hitchcock’s 1945 thriller Spellbound and Luc Besson’s 1988 free-diving epic The Big Blue, which makes its big-screen debut in Saudi Arabia. The Arab classics in the selection include Egyptian director Ahmed Badrakhan’s Aida (1942) and Song Of Hope (1937), starring Egypt’s legendary singer actress Umm Kulthum. “This year’s Treasures lineup spotlights true legends of film, showcasing moments and performances which are immortalised in the cinematic canon brought back to life for local and international audiences,” said Faisal Baltyuor, CEO of the Red Sea Film Foundation. “All of the titles selected broke new ground with their original releases, and it’s a particular privilege to have played a part in the restoration of two of Umm Kulthum’s most memorable performances, as part of our ongoing commitment to bringing the best of cinema to Saudi Arabia.” The Fifth edition of the Red Sea Film Festival runs from December 4 to 13 with the program due to be unveiled in early November.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251020T101500Z",
    "date_download": "2025-10-20T10:45:54.489208+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236591949/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "46469aa7645ddc6e5cda2f1230338fdb",
    "processed_at": "2025-10-20T12:46:06.349450",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the Red Sea Film Festival and its historical significance in Saudi Arabia's film culture, focusing on silent film screenings and classic cinema. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]