[
  {
    "url": "https://www.theguardian.com/commentisfree/2025/oct/20/i-never-wash-our-bread-knife-and-i-wont-let-the-internet-shame-me-into-changing-my-ways",
    "title": "I never wash our bread knife – and I wont let the internet shame me into changing my ways | Emma Beddington",
    "text": "What I love about social media in 2025 is how there’s always a new source of insecurity to develop – should I fibremaxx? Do I need a deep-plane facelift? Am I a narcissist? Are my ankles betraying me? This week’s is: cleaning the bread knife. Apparently the (mostly British) habit of just wiping our breadknives after use, possibly on our sleeves, and putting them back in the drawer, as showcased in online skits and cartoons, is “gross”, unhygienic and the reason people refuse to eat outside their own home. As far as I’m aware, our bread knife has never seen a drawer. It doesn’t even get wiped, just washed when it meets an especially oily focaccia. It lives on the breadboard with several weeks’ worth of crumbs and I thought that was normal – surely there are no bacteria in crumbs? I still think it’s normal – plenty of people online admitted to the cursory wipe. But they did so in a way that made it sound like their most transgressive, depraved habit, adding to my growing unease that whenever one of these hygiene “controversies” rears its head, I’m on the side of grossness. Sheets? Yeah, they’re not getting changed weekly; towels, ditto. My sports kit gets washed occasionally in line with French government advice – as a French citizen, I consider that my patriotic duty. Bras: Rigby & Peller say you can get away with multiple wears if you have several in rotation (though I’m stretching that past what the late queen’s personal upholsterers would approve of). When it comes to my phone screen, well, I have the robust microbiome of a medieval peasant and rarely get sick, so what’s the problem? I’m admitting this chiefly as a public service for fellow slatterns, made to feel disgusting when they see green nauseated emojis deployed in reaction to stuff they thought was perfectly acceptable. Me too, my grubby friends – you are not alone. But if it also means more fastidious acquaintances decide they never want to come and stay (though guests get clean sheets – I’m not a monster!), eat or cut bread here, it’s probably for the best.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T103000Z",
    "date_download": "2025-10-20T10:49:48.029260+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/commentisfree/2025/oct/20/i-never-wash-our-bread-knife-and-i-wont-let-the-internet-shame-me-into-changing-my-ways",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5e8dc3c88aa722321f95a176bb139db0",
    "processed_at": "2025-10-20T12:50:48.969681",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses personal hygiene habits and social media trends, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/commentisfree/2025/oct/20/trump-ice-national-guard-healthcare",
    "title": "Troops on the streets , a polarized country and climbing prices : welcome to Trump  golden age  | Steven Greenhouse",
    "text": "In his inauguration speech last January, Donald Trump bombastically declared: “The golden age of America begins right now.” Our braggadocious president has stuck to that theme ever since, telling the United National general assembly in late September: “This is indeed the golden age of America.” With the federal government shut down for more than two weeks, the nation more polarized than at any time since the civil war, political violence growing and the job market slowing, it doesn’t feel remotely like a golden age, unless one focuses on Trump’s Louis XIV-like effort to gild as many things as possible in the Oval Office. Decoration spree aside, it in no way feels like a golden age when Trump sends the national guard into Los Angeles and Chicago to fight “the enemy within” or when he says the governor of Illinois and mayor of Chicago should be in jail for opposing his plans to deploy troops to Chicago. I doubt that the 27 Chicago police officers who were accidentally teargassed by Ice agents think it’s a golden age and ditto for the growing number of US citizens Ice has arrested. Nor does the US seem like the shining city upon a hill when Ice agents slam a 79-year-old US citizen to the ground in Los Angeles. Nor when Trump’s Department of Homeland Security posts thuggish videos of stormtrooper-like Ice agents – videos that seem more like Germany in the 1930s than any golden vision of the US as it approaches its 250th birthday. Only a huckster would boast of a golden age when his public approval ratings are deep underwater. According to a CBS/YouGov poll in early October, 58% of the US public disapproves of Trump’s performance, while 42% approve. Another poll found that 62% of Americans believe the country is heading in the wrong direction. As part of his golden vision, Trump promised good times for working-class Americans, but 74% of the US public says the economy is in poor or fair condition and nearly two-thirds oppose his signature policy of tariffs and more tariffs. In a big thumbs down for Trump, 53% of the public says his policies are making the economy worse. Candidate Trump promised that prices would begin falling on his first day back as president, but prices have continued to climb since he returned to office, partly because of the tariffs he’s imposed. What’s more, Trump’s tariff mania has created so much economic uncertainty that job growth has slowed hugely under Trump compared with under Joe Biden. According to Mark Zandi, the chief economist at Moody’s Analytics, there was “essentially no job growth” in September. Trump promised blue-collar Americans he would increase manufacturing and the number of factory jobs, but factory activity has declined for seven straight months, and factory employment has fallen since April, too. There’s nothing golden about any of that. Showing Americans’ increased pessimism under Trump, a Wall Street Journal-Norc poll found in September that the share of Americans who say they have a good chance of improving their standard of living has fallen to just 25%, a record low in surveys taken since 1987. The 10 million Americans who will lose health coverage because of Trump’s One Big (Not So) Beautiful Bill Act probably don’t consider this a golden age. Likewise with the 22 million Americans whose health insurance premiums will double on average, often soaring by thousands of dollars, unless Trump and congressional Republicans extend subsidies for the Affordable Care Act. Scientists complain that Trump is singlehandedly ending America’s golden age of scientific research with his deep, myopic cuts – cuts that could end US leadership in medicine and other vital fields of research. At the same time, Robert F Kennedy Jr is undermining trust in vaccines, with the US seeing the highest number of measles cases since Bill Clinton was in office and signed a law establishing free universal vaccinations for children. It seems like anything but a golden age for justice when the Department of Justice indicts the former FBI director James Comey and the New York state attorney general Letitia James after Trump in effect ordered prosecutors to get them (or get fired). Nor does one feel golden about the attorney general Pam Bondi not only stonewalling a Senate hearing (especially when asked about Trump’s relationship with Jeffrey Epstein), but insulting several senators – she called Adam Schiff of California a “failed lawyer”. In the same crude vein, a White House spokesperson slimed the Illinois governor, JB Pritzker, calling him “an incompetent slob”. It doesn’t look like transparency or civility are part of Trump’s golden age. Trump can’t possibly feel golden about an August poll that found that nearly two-thirds of Americans believe he is corrupt, with 45% viewing him as “very corrupt”. When Trump spoke at the UN in September, the assembled diplomats must have thought it was a dark age for US diplomacy, not a golden one, when Trump berated them by saying: “Your countries are going to hell.” The next day, Britain’s Daily Mirror ran a front-page photo of Trump with the headline: “DERANGED – World’s Most Powerful Man-Baby.” In his inauguration speech, Trump said: “From this day forward, our country will flourish and be respected again all over the world.” But people from many countries are giving low marks to second-term Trump. When Pew asked residents of various countries whether they have confidence that Trump will do the right thing in world affairs, in Canada 77% of respondents said they had no confidence, while 22% had confidence. In Mexico, 91% had no confidence. In Germany 81% had no confidence, while 18% had confidence. In the UK, 62% had no confidence to 37% who had confidence. Since Trump returned to office, many countries’ views of the US have soured substantially and not just because they’re livid about Trump’s tariff war. It’s harder than ever to view the US as a bulwark of democracy and freedom, considering that Trump has embraced Vladimir Putin, deployed troops to major cities, declared war on leading universities, dispatched masked agents to make mass arrests, and pushed to indict his political enemies. In Mexico, the favorability rating of the US has plummeted 32 percentage points since 2024, to just 29%, while in Canada, it has fallen 20 points to just 34% favorable. In Sweden, the US’s favorability rating is down 28 points to 19%, and in Germany it’s down 16 points, to 33%. I’m sure that many rightwing, “don’t tread on me” Americans don’t see this as a golden age. I can’t imagine they like seeing masked agents snatching people off the streets or Black Hawk helicopters descending on apartment buildings or Ice agents bashing in doors and windows. That’s not what freedom looks like. Even the country music star Zach Bryan – a navy veteran who calls himself “confused” politically – is complaining, with a new song saying Ice “is going to come bust down your door” and “the middle finger’s rising, and it won’t stop showing/ Got some bad news / The fading of the red, white and blue.” Trump, the salesman and showman, always feels the need to boast – to brag that things are the best ever under him. But his high disapproval ratings at home and abroad suggest many people think he is ushering in a dark age – an age of disinformation and division, of suppressing critics and indicting enemies, of taking one authoritarian, anti-democratic action after another. For a lucky few, it is a golden age. For the craftsmen hired to gild Trump’s Oval Office and his humongous new ballroom, it’s certainly a golden payday. As they grow ever richer, the country’s billionaires are no doubt basking in this new gilded age as Trump slashes their taxes, strips away regulations and steers deals to his buddies (like Larry Ellison, the world’s second-richest person). And Trump no doubt thinks it is a golden age for himself as he grabs ever more power, dominates the headlines, enriches himself further and decorates the White House with ever more gold. But to millions of us it feels like the opposite of a golden age as Trump takes a wrecking ball to truth, democracy and the rule of law. In declaring that it is a golden age, Trump is like the fraudster who says: “I have some wonderful, shiny gold I’ll sell you for $4,000 an ounce.” But in truth it’s just worthless fool’s gold. No one should be fooled by Trump’s delusional boasts. - Steven Greenhouse is a journalist and author, focusing on labor and the workplace, as well as economic and legal issues",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T103000Z",
    "date_download": "2025-10-20T10:49:48.089130+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/commentisfree/2025/oct/20/trump-ice-national-guard-healthcare",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "118d6e65911a8d53bf799ce75b170632",
    "processed_at": "2025-10-20T12:50:48.969772",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political issues, specifically focusing on Donald Trump's presidency and its implications for the United States, without any mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
    "title": "Zelenskyy says he would join Trump - Putin summit in Hungary if invited – Europe live",
    "text": "Hello and welcome to our live blog covering events across Europe. The Ukrainian president, Volodymyr Zelenskyy, said on Monday he would be ready to join Russia’s Vladimir Putin and his US counterpart, Donald Trump, at their summit in Hungary if he is invited. Trump and Putin are expected to meet in the Hungarian capital, possibly in a matter of weeks, as the US leader continues to try to broker a peace deal to end the three-and-a-half-year war. Zelenskyy told reporters in remarks released on Monday: If I am invited to Budapest – if it is an invitation in a format where we meet as three or, as it’s called, shuttle diplomacy, President Trump meets with Putin and President Trump meets with me – then in one format or another, we will agree. The Ukrainian president also criticised the choice of Hungary, which has a terse relationship with Kyiv and is seen as the most Kremlin-sympathetic member of the European Union. “I do not believe that a prime minister who blocks Ukraine everywhere can do anything positive for Ukrainians or even provide a balanced contribution,” Zelenskyy said, referring to the Hungarian leader, Viktor Orbán. In other developments: Donald Trump on Sunday suggested the best way to end the war in Ukraine would be to “cut up” the Donbas region, leaving most of it to Russia. The US president told reporters: “Let it be cut the way it is,” adding: “They can negotiate something later on down the line.” The comments came after a tense White House meeting with Volodymyr Zelenskyy in which Trump reportedly put pressure on the Ukrainian president to give up swaths of territory. The European Union foreign policy chief, Kaja Kallas, said on Monday that it was “not nice” that Putin might travel to EU member Hungary for talks on the war in Ukraine. Kallas told reporters ahead of a gathering of European foreign ministers in Luxembourg that Trump’s efforts to bring peace were welcome but that it was also important for Zelenskyy to meet the Russian leader. Ukraine is preparing a contract to buy 25 Patriot air defence systems. In comments to media at a meeting on Sunday and cleared for use on Monday, Zelenskyy said the systems would be supplied every year for a number of years, and that Ukraine would seek for some European nations to give Kyiv priority in the queue for the systems. Patriots are seen by Kyiv as the most effective systems to stop Russian ballistic missiles, which travel several times faster than the speed of sound. Zelenskyy said he had spoken to the French president, Emmanuel Macron, on Monday about applying pressure on Russia, and that he had agreed to meet him in the near future. “Pressuring the one who started the war is the key to a denouement,” Zelenskyy wrote on X. “Emmanuel and I discussed all the current diplomatic aspects and our recent contacts with partners.” The Louvre will remain closed for a second day running on Monday, management told AFP, after thieves stole crown jewels from the museum in Paris a day earlier. French police are still hunting for four thieves who carried out a highly professional daylight raid on the Louvre, breaking into one of the museum’s most ornate rooms and escaping with eight pieces of “priceless” historic jewellery, including a necklace given by Napoleon to his wife. What we know about the Louvre museum robbery so far The Louvre, the world’s most-visited museum, was closed suddenly on Sunday after a break-in at its Apollon gallery, the home of the French crown jewels – part of a daring daylight heist in which priceless Napoleonic jewels stolen. As French police hunt the thieves who stole eight pieces of jewellery, questions are being asked about how they did it and who would be in the market for such items, including a necklace Napoleon gave to his wife. How did thieves break into the Louvre? In a highly professional raid, four balaclava-wearing thieves pulled up outside the Louvre on a road along the Seine River. At about 9.30am – half an hour after visitors began entering the front of the museum – the thieves were at the south side of the building, in a truck with a basket lift and an extendable ladder, rising to a second-floor balcony window. They smashed glass displays, grabbing the jewellery, but as alarms rang out in the museum alerting guards, the robbers quickly left, escaping on motorbikes. The entire heist lasted less than 10 minutes, according to the French interior minister, Laurent Nunez, who said it was the work of “an experienced team who had clearly scouted the location”. What was stolen and what was left behind? The French culture ministry said eight pieces were stolen – but not the hugely valuable crown of Napoleon III’s wife, Empress Eugénie, which the thieves dropped on their way out. They also missed the Regent diamond, valued by Sotheby’s at more than US$60m (£45m). The other stolen pieces include a tiara, earrings and a sapphire necklace from the jewellery set of Queen Marie-Amélie and Queen Hortense, and pieces of jewellery from the Marie-Louise set. They were housed in the Apollon gallery, built in 1661 by Louis XIV. The hall, full of gold leaf and paintings, would be the model for the Palace of Versailles’ Hall of Mirrors. For more details on the reaction to the robbery and whether this has happened before, read: Russia accuses Ukraine of contradictory signals on peace process Russia said on Monday it was engaged in serious work with the United States to seek a peace deal in Ukraine but accused Ukraine of sending contradictory signals that made the process harder. The Kremlin said that Budapest was chosen as the venue for a summit between Russian president VladimirPutin and US president DonaldTrump because Hungarian prime minister Viktor Orbán has warm ties with Trump and constructive ties with Putin. Kremlin spokesperson Dmitry Peskov told reporters that work was only just beginning on the summit, which would be aimed at advancing a resolution to the Ukraine conflict, and developing relations between Russia and the United States. He declined to give any further information about the most recent phone call between the two leaders last week. The Russian Defence Ministry also said on Monday that its troops had taken control of the village of Molodetske in Ukraine’s eastern Donetsk region. The Guardian cannot independently verify battlefield reports. Ukrainian president, Volodymyr Zelenskyy announced earlier on Monday that he would be ready to join the Trump-Putin summit in Hungary if he is invited. UPDATE to earlier report: EU countries on Monday agreed to phase out remaining gas imports from Russia by January 2028, breaking a dependency the bloc has struggled to end despite Moscow’s war on Ukraine. Energy ministers meeting in Luxembourg approved a plan by the European Commission to phase out both pipeline gas and liquefied natural gas (LNG) imports from Russia, subject to approval by the bloc’s parliament. Last month at the UN general assembly, president Donald Trump had said that European countries would have to cease buying Russian energy products. “Inexcusably, even Nato countries have not cut off much Russian energy and Russian energy products, which I found out about two weeks ago, and I wasn’t happy,” he said. “Think of it – they’re funding the war against themselves. Who the hell ever heard of that one?” EU agrees to end all Russian gas imports by end 2027 The European Union has agreed on Monday to end all Russian gas imports by the end of 2027, according to AFP reports. More on this as we receive updates. 'We have failed' says French Justice Minister over Louvre robbery France’s Justice Minister Gérald Darmanin admitted Monday to security flaws in protecting the Louvre that had led to robbers a day earlier stealing imperial jewels in broad daylight from the famed Paris museum. “What is certain is that we have failed, since people were able to park a furniture hoist in the middle of Paris, get people up it in several minutes to grab priceless jewels and give France a terrible image,” he told France Inter radio. The robbery, which several newspapers have called the “heist of the century” has cast France in a “deplorable” light, Darmanin said. “The French people all feel like they’ve been robbed.” The Louvre will remain closed on Monday for a second day running. Hello and welcome to our live blog covering events across Europe. The Ukrainian president, Volodymyr Zelenskyy, said on Monday he would be ready to join Russia’s Vladimir Putin and his US counterpart, Donald Trump, at their summit in Hungary if he is invited. Trump and Putin are expected to meet in the Hungarian capital, possibly in a matter of weeks, as the US leader continues to try to broker a peace deal to end the three-and-a-half-year war. Zelenskyy told reporters in remarks released on Monday: If I am invited to Budapest – if it is an invitation in a format where we meet as three or, as it’s called, shuttle diplomacy, President Trump meets with Putin and President Trump meets with me – then in one format or another, we will agree. The Ukrainian president also criticised the choice of Hungary, which has a terse relationship with Kyiv and is seen as the most Kremlin-sympathetic member of the European Union. “I do not believe that a prime minister who blocks Ukraine everywhere can do anything positive for Ukrainians or even provide a balanced contribution,” Zelenskyy said, referring to the Hungarian leader, Viktor Orbán. In other developments: Donald Trump on Sunday suggested the best way to end the war in Ukraine would be to “cut up” the Donbas region, leaving most of it to Russia. The US president told reporters: “Let it be cut the way it is,” adding: “They can negotiate something later on down the line.” The comments came after a tense White House meeting with Volodymyr Zelenskyy in which Trump reportedly put pressure on the Ukrainian president to give up swaths of territory. The European Union foreign policy chief, Kaja Kallas, said on Monday that it was “not nice” that Putin might travel to EU member Hungary for talks on the war in Ukraine. Kallas told reporters ahead of a gathering of European foreign ministers in Luxembourg that Trump’s efforts to bring peace were welcome but that it was also important for Zelenskyy to meet the Russian leader. Ukraine is preparing a contract to buy 25 Patriot air defence systems. In comments to media at a meeting on Sunday and cleared for use on Monday, Zelenskyy said the systems would be supplied every year for a number of years, and that Ukraine would seek for some European nations to give Kyiv priority in the queue for the systems. Patriots are seen by Kyiv as the most effective systems to stop Russian ballistic missiles, which travel several times faster than the speed of sound. Zelenskyy said he had spoken to the French president, Emmanuel Macron, on Monday about applying pressure on Russia, and that he had agreed to meet him in the near future. “Pressuring the one who started the war is the key to a denouement,” Zelenskyy wrote on X. “Emmanuel and I discussed all the current diplomatic aspects and our recent contacts with partners.” The Louvre will remain closed for a second day running on Monday, management told AFP, after thieves stole crown jewels from the museum in Paris a day earlier. French police are still hunting for four thieves who carried out a highly professional daylight raid on the Louvre, breaking into one of the museum’s most ornate rooms and escaping with eight pieces of “priceless” historic jewellery, including a necklace given by Napoleon to his wife.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T103000Z",
    "date_download": "2025-10-20T10:49:48.842026+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9c12c95c2868026cc594348bc6cff45e",
    "processed_at": "2025-10-20T12:50:48.969958",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political events and diplomatic relations involving Ukraine, Russia, and the United States, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/2025/oct/20/zelenskyy-calls-for-more-us-patriot-air-defences-after-trump-again-sides-with-putin",
    "title": "Zelenskyy calls for more US Patriot air defences after Trump again sides with Putin",
    "text": "Volodymyr Zelenskyy has called for the delivery of an additional 25 US Patriot anti-missile batteries amid the rapidly escalating air war with Russia, as it became clear that Donald Trump had once again tacked sharply towards Moscow. The Ukrainian president added that he would be ready to join Vladimir Putin and Trump at their summit in Hungary if he was invited. Reports over the weekend said Trump had privately urged Zelenskyy to accept Russia’s terms for ending the war in Ukraine during a fractious White House meeting on Friday, warning that Putin had said he would “destroy” Ukraine if it did not agree. According to the Financial Times, the meeting descended at times into a “shouting match”, with Trump “cursing all the time”. Speaking in Kyiv after talks with Trump and American weapons-makers, Zelenskyy said Ukraine needed 25 US Patriot anti-missile batteries and that Russia’s frozen assets in the west should be used to buy them. Ukraine already has some Patriot missile interceptors, but they are not enough to protect most of its major cities or energy infrastructure, which have once again come under heavy Russian attack as winter approaches. Zelenskyy’s two phone calls with Trump and a face-to-face meeting in Washington last week had raised hopes that Washington could be on the verge of supplying long-range Tomahawk cruise missiles to Ukraine. However, it became clear in the last few days that the US president had once again performed an abrupt U-turn after a two-hour phone conversation with Putin on Friday afternoon. After inviting Putin to summit in Hungary, Trump reverted to his position on Sunday that Russia should be rewarded for its illegal war of aggression against Ukraine, with Kyiv ceding large parts of its sovereign territory. Behind the scenes, Trump had pushed Zelenskyy to give up swaths of territory to Russia, two people briefed on the discussion told Reuters. “Let it be cut the way it is,” Trump told reporters on Air Force One on Sunday. “It’s cut up right now,” he said, adding that you can “leave it the way it is right now”. “They can negotiate something later on down the line,” he said. But for now, both sides of the conflict should “stop at the battle line – go home, stop fighting, stop killing people”. Commenting on reports of the Trump-Zelenskyy meeting, the EU foreign policy chief, Kaja Kallas, said Ukrainians were very resilient and were fighting for their freedom, their independence and their country. “So, they can’t just surrender. And I think, for the international order, it is also negative if the aggressor gets what he wants, because that gives a signal to all the aggressors in the world that you can just go and take what you wish for.” Contradicting Trump’s positive spin on his conversation with Putin, aides close to Zelenskyy told the Kyiv Independent: “Putin doesn’t want to talk about anything with Ukraine and Zelenskyy, except for big concessions. He hasn’t agreed to a direct meeting with Zelenskyy.” “But Putin has to somehow move in such a way as to keep Trump’s mood away from tough moves; that’s his goal. And he’s succeeding.” Commenting on the venue for the Trump-Putin meeting, and his desire to attend, Zelenskyy also suggested Budapest was a problematic location. “If I am invited to Budapest – if it is an invitation in a format where we meet as three or, as it’s called, shuttle diplomacy, President Trump meets with Putin and President Trump meets with me – then in one format or another, we will agree.” The Ukrainian president, however, criticised the choice of Hungary, which has a tense relationship with Kyiv and is seen as the most Kremlin-sympathetic member of the EU. “I do not believe that a prime minister who blocks Ukraine everywhere can do anything positive for Ukrainians or even provide a balanced contribution,” Zelensky said, referring to the Hungarian leader, Viktor Orbán. The French foreign minister, Jean-Noël Barrot, said Putin should only come to Europe if it was to sign an unconditional ceasefire with Ukraine. “It is useful for the US authorities to be able to exchange views in order to follow the dialogue with the Russian authorities. But Vladimir Putin’s announced visit to the European Union only makes sense if it leads to an immediate and unconditional ceasefire,” he said ahead of a meeting of EU foreign ministers in Luxembourg. Additional reporting by Jennifer Rankin in Brussels",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T103000Z",
    "date_download": "2025-10-20T10:49:48.909528+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/2025/oct/20/zelenskyy-calls-for-more-us-patriot-air-defences-after-trump-again-sides-with-putin",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9ba960c7f5b5ffd36d550e37d5de2cf4",
    "processed_at": "2025-10-20T12:50:48.970019",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses geopolitical issues, specifically the conflict between Ukraine and Russia, and the involvement of political figures like Zelenskyy and Trump. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.itsnicethat.com/articles/sierra-montoya-barela-art-discover-201025",
    "title": "Sierra Montoya Barela paintings are a tribute to interior design , plants and birthday cakes",
    "text": "The scenes of the everyday home can become monotonous – house plants ever still, pancakes with a knob of butter, a slice of cake from the birthday party that happened long ago. But the Colorado born painter Sierra Montoya Barela makes good use of mundanity as a canvas to create new life. Sierra also worked as a product designer of homeware for Urban Outfitters Home, and more recently at West Elm Kids, a furniture store in Dumbo, New York, which all comes through in her passion for painting mirrors, shelves, vases, chairs, tables and so on. There’s a curatorial eye for composition, exaggerated colours and complicated patterns that aren’t scared of clashing. Sometimes, everything is so heightened that it’s difficult to tell if a blue sky, adorned with fluffy clouds, is a painting hanging on a wall or in fact a window. “How we create our home spaces is endlessly interesting and there’s a million different ways to create comfort,” says Sierra. “I like to give importance to the simple everyday objects that we live with.” As well as that, Sierra sometimes disrupts the calmness of our interior lives by offering a pause through flattened perspectives or windows into different worlds. Plants play the main character in these paintings – symbolising life as much as a human figure would – sometimes her pieces feel like portraits in this sense. “We care for plants, we put them in our homes to make us feel good, we get them nice vessels to live in,” says Sierra. “Depending on the type of plant they can be purely decorative or they could be references to my Mexican heritage and culture. Much of the ornate tile work or clay objects or interiors in my paintings are odes to my Mexican Catholic upbringing as well.” In a way, Sierra doesn’t just depict where plants and humans live, but also creates a new place for them to live through paint – what begins as visually satisfying artworks turn into an avalanche of tributes to how we decorate our lives and the essential need to represent life. Hero Header Sierra Montoya Barela: Sunday Morning (Copyright © Sierra Montoya Barela, 2022) Share Article Further Info About the Author — Paul M (He/Him) is a Junior Writer at It’s Nice That since May 2025 as well as a published poet and short fiction writer. He studied (BA) Fine Art and has a strong interest in digital kitsch, multimedia painting, collage, nostalgia, analog and all matters of strange stuff.",
    "domain": "itsnicethat.com",
    "domain_category": "graphic design and visual communication",
    "language": "English",
    "date_publish": "20251020T103000Z",
    "date_download": "2025-10-20T10:50:26.906626+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "itsnicethat.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.itsnicethat.com/articles/sierra-montoya-barela-art-discover-201025",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c214bdb7051be2721c906f6d8037a871",
    "processed_at": "2025-10-20T12:50:48.970671",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article focuses on the artwork of Sierra Montoya Barela, discussing her paintings and their themes related to interior design, plants, and personal heritage. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  }
]