[
  {
    "url": "https://www.dr.dk/nyheder/udland/eu/eu-landene-har-i-aarevis-vaeret-afhaengige-af-russisk-gas-men-nu-er-de-klar-til-sige-stop",
    "title": "EU - landene har i årevis været afhængige af russisk gas . Men nu er de klar til at sige stop",
    "text": "Det har længe været en irriterende - og provokerende - torn i øjet på den danske regering, at der rundt om i EU fortsat er medlemslande, der importerer energi fra Rusland, selvom krigen i Ukraine nu har varet i mere end tre et halvt år. Derfor var det også en glad og tilfreds energiminister, Lars Aagaard (M), der her til morgen mødte pressen i Luxembourg. I dag skal han nemlig sammen med sine ministerkollegaer fra de andre medlemslande tage stilling til forslaget fra Europa-Kommissionen om at sætte en stopper for import af russisk energi, ikke mindst gas, inden udgangen af 2027. Og det ser på forhånd ud til, at der er det nødvendige flertal blandt medlemslandenes regeringer for forslaget. - Jeg har en meget stærk forventning om, at vi i dag endegyldigt kan sætte et punktum for muligheden for at importere russisk gas til EU, lød det fra Lars Aagaard, der som følge af det danske EU-formandskab sidder for bordenden ved dagens møde. - Set fra et dansk synspunkt skulle alle i Europa have stoppet langt tidligere med at importere russisk gas. Det gør vi ikke i Danmark, og det har vi ikke gjort i mange år, tilføjede han. Næststørste leverandør af gas De europæiske ledere aftalte ellers efter Ruslands invasion af Ukraine, at de ville gøre sig helt uafhængige af russisk energi senest i 2027. Men trods det har der været noget langt fra tanke til handling. I 2024 var der ifølge Europa-Kommissionen ti medlemslande, der fortsat importerede russisk gas. Faktisk var russerne sidste år den næststørste leverandør af gas til EU-landene, kun overgået af Norge. Omkring 19 procent af den samlede gasimport, herunder LNG-gas, kom fra Rusland. Derudover var der i 2024 tre lande, som importerede russisk olie, samt syv lande, der importerede enten beriget uran eller andre nukleare materialer og forsyninger fra Rusland. Ifølge den seneste opgørelse fra forskningsorganisationen Centre for Research on Energy and Clean Air, som holder øje med vores energikøb, har medlemslandene købt gas, olie og kul fra Rusland for knap 1.607 milliarder kroner siden krigen brød ud. Til sammenligning har de i samme periode støttet Ukraine for knap 1.100 milliarder kroner. Ungarn og Slovakiet stritter imod Med forslaget er der blandt andet lagt op til, at det fra årsskiftet vil blive forbudt at indgå nye gaskontrakter med Rusland. Derudover vil eksisterende korttidskontrakter forbydes fra 17. juni næste år, mens langtidskontrakter forbydes fra senest 1. januar 2028. Udover gas er der er også lagt op til at udfase importen af russisk olie inden 2028. Det er dog ikke alle medlemslande, der er lige så begejstrede som Danmark for Kommissionens forslag. Ungarn og Slovakiet er blandt de lande, der fortsat importerer store mængder af russisk energi - ikke mindst af politiske grunde, da begge lande trods krigen fortsat er nære allierede af Rusland og præsident Vladimir Putin. Ifølge Centre for Research on Energy and Clean Air har de to lande alene i år købt russisk energi for omkring 41,6 milliarder kroner. Det er mere end sidste år, hvor regningen lå på 41,4 milliarder kroner. Den amerikanske præsident, Donald Trump, har været ude at skose de europæiske lande, som fortsat køber russisk energi. Men både Ungarn og Slovakiet er imod planen, da de frygter, den vil få de hjemlige energipriser til at stige og føre til mangel på energi samt svække deres konkurrenceevne. Handler ikke om at straffe Ungarn Lars Aagaard forstår godt deres bekymringer og tilføjer, at der også er blevet taget højde for dem. Og han understreger, at det ikke handler om at straffe nogle medlemslande, men derimod \"at bringe Europa væk fra at finansiere Ruslands krig\". - Du spørger som om, at det her går ud på at straffe Ungarn. Det er jeg overhovedet ikke tilhænger af, at vi har det perspektiv på hinanden i Europa. Det her går ud på at stoppe importen af russisk gas, og det har været det absolutte mål for det danske formandskab, at de datoer, der er sat for, hvornår de korte og lange kontrakter skal være sluttet, kan bære hele vejen igennem, siger han. Selv hvis der er flertal for forslaget i dag blandt ministrene, er det dog ikke vedtaget. Det skal nemlig først forhandles på plads med Europa-Parlamentet, før det kan blive til virkelighed. Her er der dog også opbakning til det. Det glæder EU’s energikommissær, danske Dan Jørgensen (S). - Det er jo ret vanvittigt, når man tænker over det, at vi har en fjende, som er i krig med Ukraine, som vi gør alt for at bekæmpe. Og så er vi stadigvæk indirekte med til at finansiere Putins krig. Det skal altså stoppe nu, siger han.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:55.966112+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/udland/eu/eu-landene-har-i-aarevis-vaeret-afhaengige-af-russisk-gas-men-nu-er-de-klar-til-sige-stop",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "88698ac04c1bc2755f45c02aa7b5501e",
    "processed_at": "2025-10-20T11:06:11.111124",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the EU's dependency on Russian gas and the political implications of energy imports, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/vejret/vejrskifte-rammer-landet-regn-kuling-og-trafikale-advarsler",
    "title": "Vejrskifte rammer landet : Regn , kuling og trafikale advarsler",
    "text": "Efter en solrig weekend vender efterårsvejret tilbage. Et langsomt bevægende lavtryk over De Britiske Øer sender nemlig både blæst og regn ind over Danmark i løbet af mandagen. Skyerne er allerede begyndt at samle sig over den vestlige del af landet, og omkring middagstid går den første regn i land ved den jyske vestkyst. Sidst på eftermiddagen og i løbet af aftenen breder fronten sig til resten af Jylland og Fyn. Først sent i aften og i nat kommer regnen til Sjælland, og først tirsdag morgen kommer regnen til Bornholm. Som det ses på prognosen herover bliver der store lokale forskelle i nedbøren i dag. Frem til midnat kan Jylland og Fyn forvente omkring fem millimeter regn - primært i aftentimerne. Til gengæld ser det meste af Østdanmark ud til at slippe helt for regn mandag. Broer advarer om kraftig blæst Udover regn bringer lavtrykket også blæst til Danmark i dag, og flere steder kan vinden nå op på hård vind til kuling fra sydøst – især langs syd- og østvendte kyster. Den kraftige blæst giver også problemer for trafikken. På Storebæltsbroen er det midlertidigt forbudt at køre med påhængskøretøjer under 750 kilo, og forbuddet ventes først ophævet omkring klokken 18. Også Farøbroerne advarer om kraftig vind, der kan gøre kørslen vanskelig. Du kan løbende holde dig opdateret på Vejdirektoratets hjemmeside. Det ustadige vejr fortsætter Når fronten med regn er passeret i dag, følger en tid med byger i kølvandet. Tirsdag byder således på flere regnbyger, og resten af ugen ser ud til at fortsætte i samme spor med nye fronter fra vest og sydvest. Det betyder mere klassisk, dansk efterårsvejr, så paraplyen får ikke lov til at samle støv foreløbigt.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:56.008936+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/vejret/vejrskifte-rammer-landet-regn-kuling-og-trafikale-advarsler",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5b2bcab83aac90080d1e64d4222d1c3e",
    "processed_at": "2025-10-20T11:06:11.111184",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses weather conditions in Denmark, including rain and wind, without any mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/sydkorea-vil-anholde-onlinesvindlere-hjemsendt-fra-cambodja",
    "title": "Sydkorea vil anholde onlinesvindlere hjemsendt fra Cambodja | Nyheder",
    "text": "I sidste uge blev 64 sydkoreanere sendt tilbage til deres hjemland fra Cambodja, hvor de angiveligt har arbejdet som onlinesvindlere. Anklagemyndigheden i Sydkorea går nu efter at få 58 af dem anholdt. Det skriver nyhedsbureauet AP. Sydkoreanerne er anklaget for at have begået romantiske svindelnumre, afgivet falske investeringstilbud eller lavet såkaldt voice phishing, hvor man lokker oplysninger ud af ofre over telefonen. Det er uklart, om de frivilligt har arbejdet for svindlerorganisationerne i Cambodja, eller om de er blevet tvunget til det, skriver AP. Ifølge FN og andre internationale organisationer er mindst 100.000 personer blevet udsat for menneskehandel til svindelcentre i Cambodja og andre asiatiske lande.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:56.478084+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/sydkorea-vil-anholde-onlinesvindlere-hjemsendt-fra-cambodja",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "b363feecbfb029c799447ccdfc97515d",
    "processed_at": "2025-10-20T11:06:11.111220",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article discusses the return of South Korean online scammers from Cambodia and their alleged involvement in fraud schemes. It does not mention artificial intelligence or related technologies, focusing instead on human trafficking and online scams.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/indland/groenland/groenland-satser-paa-fransk-selskab-frem-elon-musk-s-satellitter",
    "title": "Grønland satser på fransk selskab frem for Elon Musk satellitter | Grønland",
    "text": "Det bliver franske og ikke amerikanske satellitter, der skal sikre beboere i Østgrønland og Nordgrønland bedre internet. Det står klart, efter at Grønlands teleudbyder Tusass er blevet enig med det franske selskab Eutelsat om at bringe deres OneWeb-satellitter til Grønland. Eutelsat er en global aktør inden for satellitkommunikation, og deres satellitter skal først og fremmest sikre, at beboerne i Øst- og Nordgrønland får en bedre og hurtigere internetdækning, end de har i dag. Det fortæller direktør i Tusass, Toke Binzer. - Vi vil i højere grad kunne bruge det til de byer og bosteder, der ikke har søkabler eller er forbundet af radiokæde-forbindelser. Der har vi alt for længe haft kunder, der ikke har haft gode nok services. Derfor har vi brug for at lave en markant forbedring, siger han. Tusass har allerede et samarbejde med Eutelsat. Men med den nye aftale får det franske selskab en større rolle at spille, fordi deres satellitter nu også skal levere ydelser til Tasiilaq og Ittoqqortoormiit i øst og Qaanaaq i nord. - Vi kender deres services og har integreret dem i vores infrastruktur, men nu vil vi gerne gå lidt længere og kunne forbedre servicen i flere af vores byer, siger Toke Binzer. Vigtig at have øje for kritisk infrastruktur Også fra fransk side er der glæde over aftalen. I en pressemeddelelse siger Cyril Dujardin, der er direktør for Eutelsats Connectivity-forretningsenhed, at man ser frem til at udvide samarbejdet med Tusass. - Kritisk infrastruktur er blevet et centralt fokusområde i hele Europa, og vi er glade for at fortsætte vores arbejde med Tusass for at støtte deres indsats i at forbinde fjerntliggende samfund, basal infrastruktur og muliggøre essentielle tjenester som redningsaktioner og maritim sikkerhed, siger han. Eutelsats netværk skal ikke kun sikre bedre internet i lokalsamfundene. Det skal også forbedre resiliens i den kritiske infrastruktur og skabe nye muligheder for søfart og beredskabstjenester, forklarer Toke Binzer. - Vi har ikke tidligere haft en maritim service, vi kunne tilbyde skibe, og vi har ikke tidligere haft mobil satellitbaseret internet, som vi kunne tilbyde til for eksempel search and rescue operationer, siger han. Går uden om Starlink Tusass, der er ejet af Grønlands selvstyre og har eneret på telekommunikation i landet, har i længere tid været på udkig efter en samarbejdspartner til at løse udfordringerne med et langsomt internet i landets yderområder. Her har Starlink, som den amerikanske rigmand og forretningsmand Elon Musk ejer, været et af de selskaber, som Tusass har forhandlet med. Ifølge Toke Binzer er det ikke et spørgsmål om, at det ene selskab er bedre end det andet. - Det er forskellige selskaber, og de har forskellige services, vilkår og modeller. Eutelsat kender vi godt, fordi vi har haft et langvarigt samarbejde med dem, som vi ved virker, siger direktøren. Der har længe været en debat i Grønland, om landets politikere skulle åbne op for at liberalisere telemarkedet. En rapport fra departementet for Boliger og Infrastruktur i Grønland, der udkom i oktober sidste år, havde netop til formål at se på fordele og ulemper ved at undersøge satellitudbyderes betydning for Grønlands telemarked. Her lød konklusionen blandt andet, at Grønland med en liberalisering risikerer at miste kontrollen med forsyningssikkerheden. - Vi skal passe på med at overlade kontrollen over teleinfrastrukturen i vores land til udenlandske aktører med andre interesser, sagde daværende minister på området Hans Peter Poulsen i forbindelse med redegørelsen. Rapporten beskriver også Starlinks forretningsmodel, som er speciel ved, at virksomheden tilbyder internet direkte til slutkunderne. Men så længe Tusass har eneret på telekommunikation i landet, kan det ikke lade sig gøre, som TV2 også beskrev, da mediet i februar dækkede forhandlingerne mellem Tusass og Starlink. Tusass: Vi lukker ingen døre Tusass har tidligere understreget vigtigheden i, at ”Grønlands kritiske infrastruktur kan kontrolleres af Grønland selv og ikke ligger i hænderne på en privat udbyder.” I dag vil Toke Binzer ikke forholde sig til, hvad der var årsagen til, at forhandlingerne med Starlink ikke førte til en aftale. Det skyldes, at Tusass underskrev en fortrolighedserklæring – det, der hedder en non-disclosure agreement (nda) - med Starlink. Det betyder, at han ikke kan gå i detaljer omkring forhandlingerne. - Det er jo det med forhandlinger, at de foregår jo altid under nda. Nu har vi indgået en Eutelsat aftale, og så kan jeg løfte sløret for, hvad der ligger i den, men jeg kan ikke sige noget om andre forhandlinger med andre parter, siger direktøren. Er forhandlingerne med Starlink helt overstået? - Det vil jeg ikke sige. Vi er et af de selskaber, der stadig baserer os på satellit, og vi har haft dialog med Starlink gennem flere år, så den dialog forestiller jeg mig stadigvæk vil være pågående. Så er det nok et definitionsspørgsmål, hvornår noget er mere eller mindre aktiv forhandling, men vi lukker ingen døre, siger Toke Binzer. Herhjemme har den danske regering i dag meldt ud, at man skruer op for det økonomiske bidrag til det europæiske rumagentur (ESA). Det skal være med til at gøre Danmark og Europa mere uafhængig af USA og SpaceX, siger uddannelses- og forskningsminister Christina Egelund (M). Over de næste fire år vil regeringen investere 2,7 milliarder kroner i rumområdet. Den historie kan du læse mere om her:",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:56.604227+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/indland/groenland/groenland-satser-paa-fransk-selskab-frem-elon-musk-s-satellitter",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ab747985c2d8c5b513ef9e1600c61ea7",
    "processed_at": "2025-10-20T11:06:11.111316",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses satellite communication and internet services in Greenland, focusing on a partnership with Eutelsat rather than artificial intelligence. There is no mention of AI technologies or applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/arbejde-ved-oeresundsmotorvejen-faar-bilister-til-bakke-og-lave-vendinger",
    "title": "Arbejde ved Øresundsmotorvejen får bilister til at bakke og lave vendinger | Nyheder",
    "text": "Politiet har oplevet både vendinger og bakkende bilister på Øresundsmotorvejen her til morgen. Det skyldes, at der i dag starter et større arbejde omkring Københavns Lufthavn, som blandt andet betyder, at den sidste frakørsel til lufthavnen på E20-motorvejen i retning mod Sverige er lukket, og man derfor skal benytte tidligere frakørsler. - Vi har oplevet, at bilisterne forsøger at lave nogle vendinger og bakke, når det går op for dem, at de ikke kan komme af motorvejen som forventet, og de er nødt til at køre til Sverige, og det er selvfølgelig uhensigtsmæssigt, siger Trine Møller, der er politiinspektør ved Københavns Politi. Arbejdet betyder, at de to kørebaner på Øresundsmotorvejen vil være lukket til slutningen af november.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:56.742486+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/arbejde-ved-oeresundsmotorvejen-faar-bilister-til-bakke-og-lave-vendinger",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "44c90636e6c73b92c01189e16d2b5862",
    "processed_at": "2025-10-20T11:06:11.111353",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses traffic issues and construction work on a highway, with no mention of artificial intelligence or related topics. It focuses on the behavior of drivers and police responses, which are unrelated to AI.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/om-dr/nyheder/som-en-skattejagt-boern-jan-og-rasmus-har-fundet-locations-til-carmen-curlers-3",
    "title": "  Som en skattejagt for børn : Jan og Rasmus har fundet locations til  Carmen Curlers 3  | Nyt fra DR",
    "text": "På denne aprildag er holdet bag ’Carmen Curlers’ godt i gang med optagelserne til de allersidste afsnit af serien. I dag skal der ikke filmes i DR Byens studier, men on location, så flere store lastbiler med udstyr og en produktionsbus, der har fragtet holdet hertil, er parkeret på vejene omkring settet og fortæller nysgerrige forbipasserende, at noget særligt er i gære. Skuespiller Mille Lehfeldt kommer gående fra sminkevognen og hen mod huset, hvor hendes karakter, Vita, og manden Poul, spillet af Christian Tafdrup, bor i serien. Det er netop i og uden for deres hus, der skal optages i dag. Huset er i virkeligheden en tjenestebolig til det tidligere Sankt Hans Hospital i Roskilde. Så hvordan finder det – og andre locations – vej til DR’s dramaserie? Det ved Jan Martinsen, som er location manager på hele ’Carmen Curlers’-serien, og Rasmus Bøgh, som er med på sæson 3. - Det begynder med, at forfatteren og instruktøren har nogle drømme og tanker om, hvordan det skal hænge sammen. Det her hus er en bærende del af fortællingen. Det skulle ligge ud til en lille vej og en mark og være en villa bygget i den periode, hvor serien foregår. Her skulle bo en velhavende familie, der skulle udstråle ’gamle penge’. Vi er på landet, hvor der er ro og fred og hyggeligt – og så kommer der en fabrik som nabo, siger Jan Martinsen. Han fortæller, at han begyndte at kigge på luftfotos af huse, der ligger ved den oprindelige Carmen-fabrik i Kalundborg, han kiggede på Google Earth, og han kørte rundt for at scoute huse, der passer til beskrivelsen. - Jeg har før filmet på Sankt Hans, så jeg var opmærksom på huse i det her område. Lykkeligvis stod den her tidligere tjenestebolig til leje, så min tidligere kollega Rasmus Christoffersen henvendte sig for at lave en lejeaftale. Huset er med i alle sæsoner, så det er en location, man gerne vil kontrollere. Når vi har nøglen til huset, kan vi altid flytte optagelser til Poul og Vitas hus, hvis der ikke kan optages andre steder som planlagt. Havde der boet nogen i huset, havde vi forsøgt at lave en aftale med dem om, at de kunne flytte ud, og vi kunne flytte ind, mens vi laver serien, siger Jan Martinsen. 'Man skal være nysgerrig i det her job' Netop det at kunne huske steder, man har set eller arbejdet før, er en af metoderne, når location managers går på jagt efter bestemte steder til en optagelse. Som Jan Martinsen udtrykker det: - Måden, vi arbejder på, er at have et visuelt arkiv og et arkiv i hovedet. Når vi finder ét sted, har vi måske fundet 7-8 andre steder. Dem lagrer vi i vores fotografiske arkiv og i hovedet. Rasmus Bøgh tager over: - Vi er gode til at tale med andre location managers, vi er gode til at hjælpe hinanden. Og så abonnerer jeg på et hav af nyhedsbreve – jeg tror, jeg har fået 17 fra Naturstyrelsen bare i dag – ligesom jeg er i kontakt med for eksempel kommunale ejendomsadministratorer. Så vi har mange kontakter. Og så cirkler vi som gribbe, når steder som for eksempel Sankt Hans eller Vridsløselille Statsfængsel bliver givet fri. Derudover har vi en sund og naturlig interesse i at kigge på ejendomme i vores fritid, smiler han. - Ja, vi kan godt være besværlige at være sammen med, for nogle gange skal man lige hoppe over et hegn og kigge nærmere på et sted. Man skal være nysgerrig i det her job, tilføjer Jan Martinsen smilende. Både Rasmus Bøgh og Jan Martinsen er blevet location managers ved det, de selv betegner som ’en ren tilfældighed’. - Jeg er kandidat i kommunikation og historie fra RUC og bliver på et tidspunkt producerassistent på Nordisk Film, siger Rasmus Bøgh om sin vej ind i branchen. - Jeg er uddannet skolelærer, men filmbranchen tager jo folk ind, så jeg begyndte som runner med at hente kaffe til folk, der var yngre end mig selv, smiler Jan Martinsen. Benspænd gør ofte arbejdet nemmere Når forfatter og instruktør kommer med tanker og ønsker til en location, er det med til at indsnævre feltet af muligheder, og så kunne man tro, at det var endnu sværere at finde ’nålen i høstakken’. Men tværtimod, fortæller de to location managers. - Hvis vi fandt et hus til Poul og Vita, som er fra perioden efter 1968, kan det ikke bruges. Så ja, det giver nogle begrænsninger, men er også med til, at vi kan sortere fra. Jo bedre vores brief er – jo bedre, de fortæller os, hvad de vil have – jo nemmere kan vi finde det, forklarer Jan Martinsen. - Benspænd gør ofte vores arbejde nemmere. Hvis man får et brief på ’et hus til en familie’, kan det være hvad som helst. Jeg fik engang et brief på ’et drømmehus’, men hvad er det? supplerer Rasmus Bøgh. - Kan man koge det ned til en konkret ting, bliver det nemmere. Da jeg skulle finde et hus til Axel (Morten Hee, red.), fik jeg at vide, at det godt måtte være mere skørt. Det ledte mig til et ingeniørhus i Holte. Jeg smed en seddel ind hos ejeren og gik i 14 dage og ventede, men heldigvis var han med på, at vi måtte bruge huset til eksteriøroptagelser, og produktionsdesigneren måtte se det indvendigt til inspiration for studiesettet, siger Jan Martinsen. - Sådan et brief er sjovt, fordi vi kan være mere kreative, siger Rasmus Bøgh. På ’Carmen Curlers’ har de to haft gode muligheder for at være kreative i deres arbejde. - Der var lagt op til en fodboldscene, men en grøn fodboldbane med to mål er ikke visuelt spændende. Så jeg fandt i stedet en gammel badmintonhal, som var flot at filme i, og den var Birthe (Maria Rossing, red.) og Jørgen (Lars Ranthe, red.) ude at spille badminton i. Det blev en rigtig fin scene, som blev til, fordi vi blev inviteret med, fortæller Jan Martinsen. - Det er unikt for ’Carmen Curlers’, at vi er blevet inviteret så meget med i den kreative proces, siger Rasmus Bøgh. En form for lykkefølelse En af de største udfordringer for Jan Martinsen lå i sæson 2, hvor sæsonfinalen bød på en togrejse mod Italien med et stop ved en station i Østrig undervejs. - Vi kunne ikke tage til Tyskland eller Østrig, så det var nærmest en umulig opgave, for man finder ikke tysk arkitektur herhjemme. Vi kiggede på et hav af tomme stationsbygninger og så en mængde af det samme, som vi ikke kunne bruge. Så fandt produktionsdesigner Heidi Plugge ud af, rummet var der til at lave en station i Østrig ved Stærekassen ved Det Kongelige Teater i København. Det fungerede fantastisk. I sæson 3 har vi også skullet lave noget New York i København. De kreative ting er noget af det fede ved ’Carmen’, siger Jan Martinsen. Og følelsen er ikke til at tage fejl af for de to location managers, når de lykkes med at finde den perfekte location til en serie som ’Carmen Curlers’: - Man mærker i maven, at det er det rette sted. Man har været en million steder, og så kan man mærke, når det er det helt rigtige. Det er det, vi lever for – at finde et sted, der passer og kan fungere, smiler Rasmus Bøgh. - Ja, det er en form for lykkefølelse. Det starter jo som en skattejagt, hvor man bare er store børn, og så er det en lettelse og det fedeste at finde det perfekte sted, smiler Jan Martinsen.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:56.811140+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/om-dr/nyheder/som-en-skattejagt-boern-jan-og-rasmus-har-fundet-locations-til-carmen-curlers-3",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3f4f3230bdfd3c9e1c0a2849640cdf55",
    "processed_at": "2025-10-20T11:06:11.111436",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the location scouting process for a television series, focusing on the experiences of location managers. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/dansk-vaccinestudie-udvides-og-bliver-verdens-stoerste",
    "title": "Dansk vaccinestudie udvides og bliver verdens største | Nyheder",
    "text": "Et dansk studie, der undersøger, om vaccine mod RS-virus kan reducere antallet af indlæggelser, skal udvides. Til vinter bliver cirka 360.000 voksne danskere inviteret til at deltage, og dermed bliver studiet det største af sin slags i verden. Det skriver Pfizer, der sponsorerer studiet, i en pressemeddelelse. Indtil nu har 130.000 danskere over 60 år deltaget, og resultaterne viser, at hospitalsindlæggelser grundet RS-virus kan reduceres med 80 procent, hvis folk er vaccineret. - Vi har naturligvis en forventning om at få bekræftet de første gode resultater. Men vi skal have et endnu stærkere bevis for, at vaccination nedbringer indlæggelser, siger Tor Biering-Sørensen, overlæge, forskningsleder og professor på Københavns Universitet, der står bag studiet.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:04:57.050240+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/dansk-vaccinestudie-udvides-og-bliver-verdens-stoerste",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9c856ba55225b9b750c7e0494e5051d0",
    "processed_at": "2025-10-20T11:06:11.111461",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article discusses a Danish vaccine study related to the RS virus and its impact on hospitalizations, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293278/vil-tvinge-trump-til-at-traekke-heftig-prisstigning-paa-it-visaer-tilbage-skal-ikke-koste-650-000-kroner",
    "title": "Vil tvinge Trump til at trække heftig prisstigning på it - visaer tilbage : Skal ikke koste 650 . 000 kroner",
    "text": "Det amerikanske handelskammer, Chamber of Commerce, går rettens vej for at få stoppet Donald Trumps beslutning om, at det fremover skal være markant dyrere at få et arbejdsvisum til USA. Donald Trump skabte chokbølger i den internationale it-branche, da han for en måneds tid siden pludselig besluttede at hæve prisen for de i it-branchen meget udbredte H-1B-visummer til 100.000 dollar. H-1B anvendes i stor stil i it-branchen til at hente it-folk ind i USA fra udlandet, og det har gennem årene været afgørende for at få blandt andet Elon Musk, Satya Nadella, Arvind Krishna og mange andre til USA for at gøre karriere. Chamber of Commerce sagsøger Trump med den påstand, at den amerikanske præsident slet ikke har lov til selv at beslutte at hæve prisen for H-1B. Som i mange andre tilfælde har Trump indført reglen via et præsidentielt dekret, som han har underskrevet. Ifølge præsidenten misbruger ikke mindst de amerikanske it-selskaber visum-muligheden med henblik på at presse lønningerne ned, fyre lokale medarbejdere og underminere den amerikanske økonomi og den nationale sikkerhed. Men beslutningen er i direkte modsætning til de beslutninger, som den amerikanske lovgivende forsamling, Kongressen, tidligere har taget, lyder det fra Chamber of Commerce. Kongressen har nemlig tidligere lovgivet på området i den såkaldte Immigration and Nationality Act - i daglig tale INA. Ifølge handelskammeret har Kongressen adskillige gange og med jævne mellemrum gennemgået H-B1-ordningerne og taget initiativ til, at virksomheder, der har misbrugt ordningen, bliver sanktioneret. \"Præsidenten har ganske vist beføjelser under INA, men de giver ham ikke magt til at helt at tilsidesætte eksisterende love og bestemmer. De giver ham heller ikke mandat til at selv at etablere nye betinger for visum,\" lyder det fra handelskammeret. mulighed for at tilsidesætte eksisterende lovbestemmelser og programmer. De giver heller ikke præsidenten tilladelse til generelt at oprette nye visumbetingelser.\" Det amerikanske handelskammer peger i sit søgsmål på, at manglen på høtkvalificeret arbejdskraft i USA er 'veldokumenteret,' samt at det er afgørende for innovation og samhandel med andre lande, at det er muligt for udlændinge at komme ind på det amerikanske arbejdsmarked med et H1-B i lommen. Handelskammeret mener, at den store prisstigning især vil ramme små iværksætter-selskaber. H-1B-visummet er meget anvendt også herhjemme, og udmeldingen har derfor også rejst bekymring herhjemme. Læs også:",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251020T084500Z",
    "date_download": "2025-10-20T09:05:03.652484+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293278/vil-tvinge-trump-til-at-traekke-heftig-prisstigning-paa-it-visaer-tilbage-skal-ikke-koste-650-000-kroner",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ddad097d6c4d6a54e9837773460bfef8",
    "processed_at": "2025-10-20T11:06:11.111498",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses legal and economic issues related to H-1B visas and Donald Trump's policies, with no mention of artificial intelligence or related technologies.",
      "keywords": [
        "H-1B",
        "visas",
        "Trump",
        "IT industry",
        "Chamber of Commerce"
      ]
    }
  }
]