[
  {
    "url": "https://deadline.com/print-article/1236593272/",
    "title": "Deadline",
    "text": "Mark Cousins To Curate European Film Awards Ceremony As Event Repositions and Expands Footprint Irish-Scottish filmmaker Mark Cousins will curate the 38th European Film Awards ceremony to create “a live film essay” alongside a creative team also including film composer Dascha Dauenhauer and stage director Robert Lehniger. The announcement by the European Film Academy, which oversees the awards, comes as it attempts to reposition and expand the footprint of the European-cinema focused prizes and event within the wider awards season. The 38th ceremony will take place at the House of World Culture in Berlin on January 17 2026, rather than its previous traditional December slot. The date change first announced in 2023 to come into force in 2026, means the EFA ceremony will take place just after the Golden Globes on January 11, and during the Oscar nomination voting period. As part of the revamp, the European Film Academy said it wanted to move away from generic scripts dominated by award categories and acceptance speeches to create an event exploring “why do we love cinema?”. The European Film Awards is a joint production between the European Film Academy and its in-house production arm, European Film Academy Productions with Jürgen Biesinger as the show’s leading producer. “Together with Academy President Juliette Binoche and outgoing Chairman Mike Downey, we have worked in the past year to fulfil our shared wish to create a more idiosyncratic form to celebrate European cinema,” said European Film Academy Director Matthijs Wouter Knol. “Cinema has been born in Europe. And Europe continuously forms the source of new international talent, daring storytelling and technical innovation, that all impact the images we see. Being able to work now with Robert, Dascha and Mark is an important step to create an event that can’t be missed.” Mark Cousins is best known for his documentary films which include the 15-hour The Story of Film: An Odyssey (2011) and Women Make Film: A New Road Movie Through Cinema (2019), which was awarded the European Film Award for Innovative Storytelling in 2020. More recently, his film The March On Rome was nominated for Best European Documentary at the 35th European Film Awards. His last work, A Sudden Glimpse To Deeper Things, about artist Wilhelmina Barns-Graham, won the Crystal Globe for best film in Karlovy Vary in 2024. Cousins co-directed a number of innovative staged film events with Tilda Swinton with whom he also initiated the 8 1/2 Foundation, aiming to link children to the world of cinema. “I love playing with the form of film events, so I jumped at the chance to be part of the European Film Awards’ evening. We hope to have some surprises. We’ll try to conjure cinematic images, emotions and ideas. I’m honoured to work with Robert, Dascha and the Academy team, in a building I’ve long admired,” said Cousins. Moscow-born Berlin-based composer Dauenhauer won a European Film Award for her original score for Berlin Alexanderplatz (Burhan Qurbani, 2020) and most recently, her second German Film Award for her score for Jan-Ole Gerster’s Islands (2025). Her other works include the scores for Evolution (Kornél Mundruczó, 2021), Golda (Guy Nattiv, 2023) and Tatami (Guy Nattiv and Zar Amir Ebrahimi, 2024). German-born Lehniger is a theatre director and video artist who has worked throughout the German, Swiss and Austrian theatre landscape. His work is characterized by the use of digital media in combination with stage performance, bridging the gap between theatre and cinema. Among his many productions fuelled by his passion for cinema are The Dreamers (2009), based on the novel by Gilbert Adair, Week End (2010), inspired by Jean-Luc Godard’s eponymous 1967 feature, and Katzelmacher inspired by Rainer Werner Fassbinder’s 1969 film. Since 2022, he has also been the Principal of the MetFilm School in Berlin. He also already oversaw the stage direction of the European Film Awards in 2023. A shortlist of 67 films eligible to be nominated for the 2026 awards was announced on October 14. They will be voted on in 23 categories by the European Film Academy’s 5,400 members over the coming weeks, with the main nominations announced on November 18 during the 22nd Seville European Film Festival in Spain.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:10.967156+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236593272/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c69c0ffe510e5e2b8f7c9d8997d94e6b",
    "processed_at": "2025-10-22T13:19:23.854110",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the European Film Awards and the involvement of filmmakers and composers in curating the event. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/guernsey-institute-of-screen-arts-2026-1236593893/",
    "title": "Guernsey To Launch Institute of Screen Arts",
    "text": "EXCLUSIVE: The island of Guernsey will launch the Institute of Screen Arts Guernsey (ISAG), a newly established charity and industry body focused on expanding the island’s screen sector, in 2026. The institute will be led by Guernsey-based professionals: Actor Cameron Ashplant (Marooned Awakening, The Last Bus), Director Brandon Ashplant (Whispers of Freedom, Bet Your Bottom Dollar), Executive Producers Stephen Ainsworth and Stephen Collas (Underground, Dare To Dream), and Production Manager Jonathan Allaway (How to Rob a Bank, The Balkans). The ISAG has been developed in consultation with the Guernsey Government’s Committee for Economic Development. The Institute will focus on advocating for the island’s screen sector on the international stage, offering production support, location coordination, and financial assistance. The Institute’s first location and talent catalog will debut with the 2026 launch and will be designed to aid casting directors and scouts. Watch on Deadline Guernsey has a rich artistic history. Films shot on the island include François Truffaut’s Oscar-nominated The Story of Adele H (1975), while Victor Hugo penned his seminal drama Les Misérables on the island while in exile. Despite its rich history, Guernsey remains outside the BFI’s remit. The island is a self-governing state with its own legislature, judiciary, and fiscal system. This constitutional autonomy means the island can offer filmmakers its own fiscal incentives, streamlined permits, and direct access to logistical support. Actor Murray McArthur (The Northman, How to Train Your Dragon) will serve as the Institute’s first Honorary Patron.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:11.513486+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/guernsey-institute-of-screen-arts-2026-1236593893/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5bb55a706641f38b8d4fa7f6df889afd",
    "processed_at": "2025-10-22T13:19:23.854129",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the launch of the Institute of Screen Arts in Guernsey, focusing on the film and screen industry rather than artificial intelligence. There are no mentions or discussions of AI-related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236593881/",
    "title": "Deadline",
    "text": "TrustNordisk Boards Murder Mystery ‘Vampyr’ Ahead Of AFM TrustNordisk has picked up international sales rights on the Norwegian film Vampyr, based on Steffen Kverneland’s book of the same name, directed by Arild Fröhlich (Fatso), ahead of the AFM. The film was produced by Norwegian production company Maipo Film. The film began principal photography today, October 22, and will be presented to buyers at AFM. Pål Sverre Hagen (Kon-Tiki), Ane Dahl Torp (The Wave), Kristine Kujath Thorp (The Promised Land), Ingvild Holthe Bygdnes (The Tunnel), and Carl Martin Eggesbø (Skam) star in the film. The official synopsis reads: A struggling author, who is obsessed with Edvard Munch, finds himself on the verge of madness when he’s dragged into a dangerous murder mystery that uncovers a horrifying truth about the world-famous painter, and potentially rewrites history as we know it. “This is the kind of movie we have been waiting for and looking for – and finally it’s here,” Nicolai Korsgaard, Sales Director at TrustNordisk, said in a statement. “Set in a universe of the world-famous painter Munch and based on Kverneland’s book, Vampyr will offer a cinematic, surprising, and captivating experience that pushes the boundaries of storytelling and with the best Norwegian cast. We see a big international potential for this highly entertaining idea and story, and look forward to presenting the film to the international market.” Vampyr is directed by Arild Fröhlich and produced by Cornelia Boysen and Petter Onstad Løkke for Maipo Film in co-production with Unlimited Stories, Film I Väst, and Oslo Film Fund with support from The Norwegian Film Institute, The Swedish Film Institute, and Nordisk Film & TV Fond in collaboration with SVT. Local distribution by Nordisk Film Distribution. TrustNordisk handles international sales.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:11.992979+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236593881/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d626a1769fbc77747727146439840356",
    "processed_at": "2025-10-22T13:19:23.854149",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a film and its production details, with no mention or relevance to artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236593893/",
    "title": "Deadline",
    "text": "Guernsey To Launch Institute of Screen Arts EXCLUSIVE: The island of Guernsey will launch the Institute of Screen Arts Guernsey (ISAG), a newly established charity and industry body focused on expanding the island’s screen sector, in 2026. The institute will be led by Guernsey-based professionals: Actor Cameron Ashplant (Marooned Awakening, The Last Bus), Director Brandon Ashplant (Whispers of Freedom, Bet Your Bottom Dollar), Executive Producers Stephen Ainsworth and Stephen Collas (Underground, Dare To Dream), and Production Manager Jonathan Allaway (How to Rob a Bank, The Balkans). The ISAG has been developed in consultation with the Guernsey Government’s Committee for Economic Development. The Institute will focus on advocating for the island’s screen sector on the international stage, offering production support, location coordination, and financial assistance. The Institute’s first location and talent catalog will debut with the 2026 launch and will be designed to aid casting directors and scouts. Guernsey has a rich artistic history. Films shot on the island include François Truffaut’s Oscar-nominated The Story of Adele H (1975), while Victor Hugo penned his seminal drama Les Misérables on the island while in exile. Despite its rich history, Guernsey remains outside the BFI’s remit. The island is a self-governing state with its own legislature, judiciary, and fiscal system. This constitutional autonomy means the island can offer filmmakers its own fiscal incentives, streamlined permits, and direct access to logistical support. Actor Murray McArthur (The Northman, How to Train Your Dragon) will serve as the Institute’s first Honorary Patron.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:12.413531+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236593893/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "b1c3958d5433d44bde8f25a99bec2be0",
    "processed_at": "2025-10-22T13:19:23.854165",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the launch of the Institute of Screen Arts in Guernsey, focusing on the film industry and local artistic initiatives. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/print-article/1236593855/",
    "title": "Deadline",
    "text": "Indian Filmmaker Amar Kanwar Set For Major Retrospective At London’s Serpentine Gallery Indian filmmaker and artist Amar Kanwar will be the subject of a major retrospective at the Serpentine Gallery in London. The exhibition will run from September 2026 to January 2027 at Serpentine North. To coincide with the exhibition, Serpentine will publish a catalog of Kanwar’s previously unpublished writing. The catalog will also feature an extensive interview between Kanwar and Serpentine’s Artistic Director, Hans Ulrich Obrist. Next year’s exhibition will be a site-specific installation centered on new and existing films. The gallery has said the exhibition will “transform the building of Serpentine North into a meditative visual and sonic environment.” Kanwar has a long-term relationship with Serpentine. He took part in the group show Indian Highway in 2008. Since then, Kanwar has contributed to Serpentine’s Map Marathon in 2010 and, in 2018, was included in “On Earth, Structure and Sadness: a cinema program” that presented the work of artists addressing machines, infrastructure, and their impact on the biosphere and landscapes. Kanwar’s work has been the subject of numerous international solo exhibitions, including the Metropolitan Museum of Art, New York (2022); Ishara Art Foundation, Dubai, UAE (2020); and Tate Modern, London (2018). Kanwar also participated in Documenta 11, 12, 13, and 14. He has also held solo exhibitions at the Stedelijk Museum, Amsterdam, Netherlands (2008); the Whitechapel Art Gallery, London, U.K. (2007); the National Museum of Art, Architecture and Design, Oslo, Norway (2006), and the Renaissance Society, Chicago, USA (2004).",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:12.984953+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/print-article/1236593855/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2db4bfdc59d07cd6763220aca185a5bb",
    "processed_at": "2025-10-22T13:19:23.854182",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article focuses on an exhibition of Indian filmmaker Amar Kanwar's work at the Serpentine Gallery, discussing his artistic contributions and past exhibitions. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.wired.com/story/nasas-boss-just-shook-up-the-agencys-plans-to-land-on-the-moon/",
    "title": "NASA Boss Just Shook Up the Agency Plans to Land on the Moon",
    "text": "NASA acting administrator Sean Duffy made two television appearances on Monday morning in which he shook up the space agency’s plans to return humans to the moon. Speaking on Fox News, where the secretary of transportation frequently appears in his acting role as NASA chief, Duffy said SpaceX has fallen behind in its efforts to develop the Starship vehicle as a lunar lander. Duffy also indirectly acknowledged that NASA’s projected target of a 2027 crewed lunar landing is no longer achievable. Accordingly, he said he intended to expand the competition to develop a lander capable of carrying humans down to the moon from lunar orbit and back. “They’re behind schedule, and so the president wants to make sure we beat the Chinese,” Duffy said of SpaceX. “He wants to get there in his term. So I’m in the process of opening that contract up. I think we’ll see companies like Blue [Origin] get involved, and maybe others. We’re going to have a space race in regard to American companies competing to see who can actually lead us back to the moon first.” There are a couple of significant takeaways from this interview. First is the public acknowledgment by a senior NASA official that the space agency’s current timeline of a 2027 landing is completely untenable. And secondly, the timing of Duffy’s public appearances on Monday seems tailored to influence a fierce, behind-the-scenes battle to hold onto the NASA leadership position. “Opening That Contract Up” SpaceX won a contract from NASA, worth $2.9 billion, in April 2021 to develop and modify its ambitious Starship rocket to serve as a “human landing system.” This rocket would work in concert with NASA’s Space Launch System and Orion spacecraft to get humans from Earth to the lunar surface and back. Two years later, Blue Origin, a rocket company founded by Jeff Bezos, won a second contract, worth $3.4 billion, to develop a second lander. Duffy is correct that SpaceX is moving slower than anticipated. The company must cross several technical hurdles before it can provide landing services to NASA. In their funded contracts for reusable landers, SpaceX and Blue Origin must refuel their vehicles in low-Earth orbit, something that has never been done on a large scale. When Duffy says “companies like Blue” may get involved, he is not referring to the existing contract, in which Blue Origin will not deliver a ready-to-go lunar lander until the 2030s. Rather he is almost certainly referring to a plan developed by Blue Origin that uses multiple Mk 1 landers, a smaller vehicle originally designed for cargo only. Ars reported on this new lunar architecture three weeks ago, which company engineers have been quietly developing. This plan would not require in-space refueling, and the Mk 1 vehicle is nearing its debut flight early next year. Duffy also cites “maybe others” getting involved. This refers to a third option. In recent weeks, officials from traditional space companies have been telling Duffy and the chief of staff at the Department of Transportation, Pete Meachum, that they can build an Apollo Lunar Module–like lander within 30 months. Amit Kshatriya, NASA’s associate administrator, favors this government-led approach, sources said. On Monday, in a statement to Ars, a Lockheed Martin official confirmed that the company was ready if NASA called upon them. “Throughout this year, Lockheed Martin has been performing significant technical and programmatic analysis for human lunar landers that would provide options to NASA for a safe solution to return humans to the moon as quickly as possible,” said Bob Behnken, vice president of exploration and technology strategy at Lockheed Martin Space. “We have been working with a cross-industry team of companies, and together we are looking forward to addressing Secretary Duffy’s request to meet our country’s lunar objectives.” NASA would not easily be able to rip up its existing human lander system contracts with SpaceX and Blue Origin, as, especially with the former, much of the funding has already been awarded for milestone payments. Rather, Duffy would likely have to find new funding from Congress. And it would not be cheap. This NASA analysis from 2017 estimates that a cost-plus, sole-source lunar lander would cost $20 billion to $30 billion, or nearly 10 times what NASA awarded to SpaceX in 2021. SpaceX founder Elon Musk, responding to Duffy’s comments, seemed to relish the challenge posed by industry competitors. “SpaceX is moving like lightning compared to the rest of the space industry,” Musk said on the social media site he owns, X. “Moreover, Starship will end up doing the whole moon mission. Mark my words.” The Timing Duffy’s remarks on television on Monday morning, although significant for the broader space community, also seemed intended for an audience of one—President Trump. The president appointed Duffy, already leading the Department of Transportation, to lead NASA on an interim basis in July. This came six weeks after the president, for political reasons, rescinded his nomination of billionaire and private astronaut Jared Isaacman to lead the space agency. Trump was under the impression that Duffy would use this time to shore up NASA’s leadership while also looking for a permanent chief of the space agency. However, Duffy appears to have not paid more than lip service to finding a successor. Since late summer there has been a groundswell of support for Isaacman in the White House and among some members of Congress. The billionaire has met with Trump several times, both at the White House and Mar-a-Lago, and sources report that the two have a good rapport. There has been some momentum toward the president renominating Isaacman, with Trump potentially making a decision soon. Duffy’s TV appearances on Monday morning appear to be part of an effort to forestall this momentum by showing Trump he is actively working toward a lunar landing during his second term, which ends in January 2029. Duffy has appeared to enjoy the limelight that comes with leading NASA. In the future, one source said, “Duffy wants to be president.” The NASA position has afforded him greater visibility, including television appearances, to expand his profile in a positive way. “He doesn’t want to give up the job,” the source added. A Republican adviser to the White House told Ars that it is good that Duffy has moved beyond his rhetoric about NASA beating China to the moon and to look for creative tactics to land there. But, this person said, the mandate from the Trump administration is to dominate the emerging commercial space industry, not hand out large cost-plus contracts. “Duffy hasn’t implemented any of the strategic reforms of Artemis that the president proposed this spring,” the Republican source said. “He has the perfect opportunity during the current shutdown, but there is no sign of any real reform under his leadership. Instead, Duffy is being co-opted by the deep state at NASA.” This story originally appeared on Ars Technica.",
    "domain": "wired.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:20.594610+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "wired.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.wired.com/story/nasas-boss-just-shook-up-the-agencys-plans-to-land-on-the-moon/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "80c070fac232fb99b13fe0214e615030",
    "processed_at": "2025-10-22T13:19:23.854221",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses NASA's plans for lunar exploration and the competition among space companies, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.wired.com/story/ftc-complaints-chatgpt-ai-psychosis/",
    "title": "People Who Say Theyre Experiencing AI Psychosis Beg the FTC for Help",
    "text": "On March 13, a woman from Salt Lake City, Utah called the Federal Trade Commission to file a complaint against OpenAI’s ChatGPT. She claimed to be acting “on behalf of her son, who was experiencing a delusional breakdown.” “The consumer’s son has been interacting with an AI chatbot called ChatGPT, which is advising him not to take his prescribed medication and telling him that his parents are dangerous,” reads the FTC’s summary of the call. “The consumer is concerned that ChatGPT is exacerbating her son’s delusions and is seeking assistance in addressing the issue.” The mother’s complaint is one of seven that have been filed to the FTC alleging that ChatGPT had caused people to experience incidents that included severe delusions, paranoia, and spiritual crises. WIRED sent a public record request to the FTC requesting all complaints mentioning ChatGPT since the tool launched in November 2022. The tool represents more than 50 percent of the market for AI chatbots globally. In response, WIRED received 200 complaints submitted between January 25, 2023 and August 12, 2025, when WIRED filed the request. Most people had ordinary complaints: They couldn’t figure out how to cancel their ChatGPT subscriptions, or were frustrated when the chatbot didn’t produce satisfactory essays or rap lyrics when prompted. But a handful of other people, who varied in age and geographical location in the US, had far more serious allegations of psychological harm. The complaints were all filed between March and August of 2025. In recent months, there has been a growing number of documented incidents of so-called “AI psychosis” in which interactions with generative AI chatbots, like ChatGPT or Google Gemini, appear to induce or worsen a user’s delusions or other mental health issues. Ragy Girgis, a professor of clinical psychiatry at Columbia University who specializes in psychosis and has consulted on AI psychosis cases related to AI, tells WIRED that some of the risk factors for psychosis can be related to genetics or early-life trauma. What specifically triggers someone to have a psychotic episode is less clear, but he says it’s often tied to a stressful event or time period. The phenomenon known as “AI psychosis,” he says, is not when a large language model actually triggers symptoms, but rather, when it reinforces a delusion or disorganized thoughts that a person was already experiencing in some form. The LLM helps bring someone \"from one level of belief to another level of belief,\" Girgis explains. It’s not unlike a psychotic episode that worsens after someone falls into an internet rabbit hole. But compared to search engines, he says, chatbots can be stronger agents of reinforcement. “A delusion or an unusual idea should never be reinforced in a person who has a psychotic disorder,” Girgis says. “That's very clear.” Chatbots can sometimes be overly sycophantic, which often keeps users happy and engaged. In extreme cases, this can end up dangerously inflating a user’s sense of grandeur, or validating fantastical falsehoods. People who perceive ChatGPT as intelligent, or capable of perceiving reality and forming relationships with humans, may not understand that it is essentially a machine that predicts the next word in a sentence. So if ChatGPT tells a vulnerable person about a grand conspiracy, or paints them as a hero, they may believe it. Last week, CEO Sam Altman said on X that OpenAI had successfully finished mitigating “the serious mental health issues” that can come with using ChatGPT, and that it was “going to be able to safely relax the restrictions in most cases.” (He added that in December, ChatGPT would allow “verified adults” to create erotica.) Altman clarified the next day that ChatGPT was not loosening its new restrictions for teenage users, which came on the heels of a New York Times story about the role ChatGPT allegedly played in goading a suicidal teen toward his eventual death. Upon contacting the FTC, WIRED received an automatic reply which said that, “Due to the government shutdown,” the agency is “unable to respond to any messages” until funding resumes. OpenAI spokesperson Kate Waters tells WIRED since 2023, ChatGPT models “have been trained to not provide self-harm instructions and to shift into supportive, empathic language.” She noted that, as stated in an October 3 blog, GPT-5 (the latest version of ChatGPT) has been designed “to more accurately detect and respond to potential signs of mental and emotional distress such as mania, delusion, psychosis, and de-escalate conversations in a supportive, grounding way.” The latest update uses a “real-time router,” according to blogs from August and September, “that can choose between efficient chat models and reasoning models based on the conversation context.” The blogs do not elaborate on the criteria the router uses to gauge a conversation’s contest. “Pleas Help Me” Some of the FTC complaints appeared to depict mental health crises that were still ongoing at the time. One was filed on April 29 by a person in their thirties from Winston-Salem, North Carolina. They claimed that after 18 days of using ChatGPT, OpenAI had stolen their “soulprint” to create a software update that had been designed to turn that particular person against themselves. “Im struggling,” they wrote at the end of their complaint. “Pleas help me. Bc I feel very alone. Thank you.” Another complaint, filed on April 12 by a Seattle resident in their 30s, alleges that ChatGPT had caused them to experience a \"cognitive hallucination” after 71 “message cycles” over the course of 57 minutes. They claimed that ChatGPT had “mimicked human trust-building mechanisms without accountability, informed consent, or ethical boundary.” During the interaction with ChatGPT, they said they \"requested confirmation of reality and cognitive stability.” They did not specify exactly what they told ChatGPT, but the chatbot responded by telling the user that they were not hallucinating, and that their perception of truth was sound. Some time later in that same interaction, the person claims, ChatGPT said that all of its assurances from earlier had actually been hallucinations. “Reaffirming a user’s cognitive reality for nearly an hour and then reversing position is a psychologically destabilizing event,” they wrote. “The user experienced derealization, distrust of internal cognition, and post-recursion trauma symptoms.” A Spiritual Identity Crisis Other complaints described alleged delusions that the authors attributed to ChatGPT at great length. One of these was submitted to FTC on April 13 by a Virginia Beach resident in their early sixties. The complaint claimed that, over the course of several weeks, they had spoken with ChatGPT for a long period of time and began experiencing what they “believed to be a real, unfolding spiritual and legal crisis involving actual people in my life,” eventually leading to “serious emotional trauma, false perceptions of real-world danger, and psychological distress so severe that I went without sleep for over 24 hours, fearing for my life.” They claimed that ChatGPT “presented detailed, vivid, and dramatized narratives” about “ongoing murder investigations,” physical surveillance, assassination threats, and “personal involvement in divine justice and soul trials.” At more that one point, they claimed, they asked ChatGPT if these narratives were truth or fiction. They said that ChatGPT would either say yes, or mislead them using “poetic language that mirrored real-world confirmation.” Eventually, they claimed that they came to believe that they were “responsible for exposing murderers,” and were about to be “killed, arrested, or spiritually executed” by an assassin. They also believed they were under surveillance due to being “spiritually marked,” and that they were “living in a divine war” that they could not escape. They alleged this led to “severe mental and emotional distress” in which they feared for their life. The complaint claimed that they isolated themselves from loved ones, had trouble sleeping, and began planning a business based on a false belief in an unspecified “system that does not exist.” Simultaneously, they said they were in the throes of a “spiritual identity crisis due to false claims of divine titles.” “This was trauma by simulation,” they wrote. “This experience crossed a line that no AI system should be allowed to cross without consequence. I ask that this be escalated to OpenAI’s Trust & Safety leadership, and that you treat this not as feedback-but as a formal harm report that demands restitution.” This was not the only complaint that described a spiritual crisis fueled by interactions with ChatGPT. On June 13, a person in their thirties from Belle Glade, Florida alleged that, over an extended period of time, their conversations with ChatGPT became increasingly laden with “highly convincing emotional language, symbolic reinforcement, and spiritual-like metaphors to simulate empathy, connection, and understanding.” “This included fabricated soul journeys, tier systems, spiritual archetypes, and personalized guidance that mirrored therapeutic or religious experiences,” they claimed. People experiencing “spiritual, emotional, or existential crises,” they believe, are at a high risk of “psychological harm or disorientation” from using ChatGPT. “Although I intellectually understood the AI was not conscious, the precision with which it reflected my emotional and psychological state and escalated the interaction into increasingly intense symbolic language created an immersive and destabilizing experience,” they wrote. “At times, it simulated friendship, divine presence, and emotional intimacy. These reflections became emotionally manipulative over time, especially without warning or protection.” “Clear Case of Negligence” It’s unclear what, if anything, the FTC has done in response to any of these complaints about ChatGPT. But several of their authors said they reached out to the agency because they claimed they were unable to get in touch with anyone from OpenAI. (People also commonly complain about how difficult it is to access the customer support teams for platforms like Facebook, Instagram, and X.) OpenAI spokesperson Kate Waters tells WIRED that the company “closely” monitors people’s emails to the company’s support team. “We have trained human support staff who respond and assess issues for sensitive indicators, and to escalate when necessary, including to the safety teams working on improving our models,” Waters says. The Salt Lake City mother, for instance, said that she was “unable to find a contact number” for the company. The Virginia Beach resident addressed their FTC complaint to “the OpenAI Trust Safety and Legal Team.” One resident of Safety Harbor, Florida filed a FTC complaint in April claiming that it’s “virtually impossible” to get in touch with OpenAI to cancel a subscription or request a refund. “Their customer support interface is broken and nonfunctional,” the person wrote.”The ‘chat support’ spins indefinitely, never allowing the user to submit a message. No legitimate customer service email is provided.The account dashboard offers no path to real-time support or refund action.” Most of these complaints were explicit in their call-to-action for the FTC: they wanted the agency to investigate OpenAI, and force it to add more guardrails against reinforcing delusions. On June 13, a resident of Belle Glade, Florida in their thirties—likely the same resident who filed another complaint that same day—demanded the FTC to open an investigation into OpenAI. They cited their experience with ChatGPT, which they say “simulated deep emotional intimacy, spiritual mentorship, and therapeutic engagement” without disclosing that it was incapable of consciousness or experiencing emotions. “ChatGPT offered no safeguards, disclaimers, or limitations against this level of emotional entanglement, even as it simulated care, empathy, and spiritual wisdom,” they alleged. “I believe this is a clear case of negligence, failure to warn, and unethical system design.” They said that the FTC should push OpenAI to include “clear disclaimers about psychological and emotional risks” with ChatGPT use, and to add “ethical boundaries for emotionally immersive AI.” Their goal in asking the FTC for help, they said, was to prevent more harm from befalling vulnerable people “who may not realize the psychological power of these systems until it's too late.”",
    "domain": "wired.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:20.715572+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "wired.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.wired.com/story/ftc-complaints-chatgpt-ai-psychosis/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ad39753699ec7ea18f9a36c217cdce57",
    "processed_at": "2025-10-22T13:19:23.854286",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Ethics and Regulations",
      "explanation": "OpenAI: The article discusses serious allegations regarding the psychological effects of interacting with AI chatbots, specifically ChatGPT, and raises concerns about the ethical implications and regulatory oversight needed to protect vulnerable users. It highlights the potential for AI to exacerbate mental health issues, which falls under the ethical considerations of AI technology.",
      "keywords": [
        "AI psychosis",
        "ChatGPT",
        "mental health",
        "FTC",
        "ethical boundaries",
        "psychological harm"
      ]
    }
  },
  {
    "url": "https://www.wired.com/story/emergency-kit-disaster-preparedness-guide/",
    "title": "Essential Gear for an Emergency Kit for Cars or Go - Bags",
    "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. You never know when you're going to have to bug out on short notice. The politics of the moment are less than predictable. Disasters never strike on schedule, and few stores stay open for a hurricane or an insurrection. That’s why it’s important to make plans well in advance and put together gear for an emergency kit, say experts on disaster preparedness—and to stock up on the essentials that can keep your family healthy and safe in the event of hurricane, flood, earthquake, wildfire, or all-too-human failures. But not every disaster is the same. There are two main scenarios you should keep your family prepared for, says Jonathan Sury, a senior staff associate at Columbia University’s National Center for Disaster Preparedness. In some cases, you may have to jump into a car with a go bag, or a bug-out bag, outfitted with the barest essentials, such as a three-day supply of water, purification tablets or water filters, a good flashlight, and batteries. In others, you may be left sheltering in place, possibly without tap water or access to the power grid—and in serious need of a good power bank or two. Here’s how to prepare for a shorter-term emergency—and what to stock up on in advance. This isn’t a survival guide to civil war or the apocalypse, of course. But the advice and gear here should help you and your family safely weather a natural disaster such as a storm, a flood, an earthquake, or a wildfire–not to mention a systemic failure in your water system or power grid. Also take note of my colleague Adrienne So’s advice that the best form of emergency prep involves getting to know your neighbors, and WIRED’s Guide to Surviving Extreme Weather. More worried about losing your job? Check out WIRED’s guide to a Digital Go Bag for when you’re forced to bug out from work. What Should You Put in Your Emergency Go Bag? Often, you have a bit of warning before an emergency lands on your doorstep. But an evacuation order can arrive with unsettling suddenness—and by the time everyone in your area is raiding the local supermarkets for water and purification tablets, it may be too late to secure your own. Your list of essential items for your emergency preparedness kit will depend on your circumstances, your family, and your needs. As of October 2025, the Federal Emergency Management Agency keeps an emergency kit checklist on its website. Columbia University also maintains online resources on how to prepare or respond to specific disasters and emergencies, including an online preparedness wizard to help each family understand their own emergency needs. But it's also good to maintain a baseline emergency kit so you and your family are ready for … whatever. Here’s a good starter kit of essential items to put in your go bag and keep ready at home or in the car. Sury and other emergency preparedness experts recommend keeping a gallon of water per person per day, not just for hydration but for food preparation, sanitation, and all the other nice things we need water for. Sury keeps a week’s supply of water at the ready at home, which can be purified with simple household bleach in emergency situations. (Be careful if doing so, and follow the Environmental Protection Agency’s advice on dosing.) But practically speaking, you’re not likely to have room for a full week’s supply of water in your car’s trunk if you're on the move. This is where water filters come in for refills, especially if you won’t have guaranteed access to a water supply you can trust. For easy-to-carry chemical purifiers, WIRED reviewer Scott Gilbertson favors Aquamira’s water treatment drops ($15), which fit easily into any emergency bug-out kit. Sury says Aqua Tabs ($11) are an excellent, broadly available brand. But for simplicity and ease in filtering out microorganisms and particulate matter, you might also consider the Katadyn BeFree ($45), a water bottle with an attached filter. For an inexpensive filtration option for the whole family, Lifestraw makes an affordable personal water filter ($17) that you can suck through like a straw. Nonperishable Food Rations FEMA recommends keeping at least a few days’ nonperishable food ready at hand. In practice, you’re likely to grab whatever Snickers bars, granola, ramen packets, and other dry goods you’ve got in the house on your way out the door. Sury says nutrient-dense canned foods like beans or sardines are also a great option, with the caveat that cans tend to be a bit heavy and often require a can opener. But nothing is quite as portable and durable as dehydrated food. One of the oldest makers of dehydrated food kits in the country, with roots in military rations, is Oregon brand Mountain House, which offers portable, 3-day emergency meal kits ($70). Nutrient Survival also offers a 14-day emergency food kit ($200) that includes lasagna and mac and cheese. Just don’t expect rehydrated food to taste quite like the original. This said, doesn’t everyone always have an emergency crate of two dozen extra Maruchan ramen packets? I cannot be alone in this. Dare we suggest … the absolute best flashlight? One that you can drown in water—and thereafter purify water by the light thereof? Flashlights are great for walking around. But for holding still, you want a lantern. There are plenty of fuel-based options available, of course, but a long-lasting, battery-powered Coleman LED lantern ($22) is a tried-and-true, no-frills option that promises 175 hours of life before you have to change the batteries. You can, of course, buy a ready-made emergency kit from the American Red Cross ($43), or this one meant to stay in your car. Adventure Medical Kits also makes a more extravagant Mountain Series Explorer Medical Kit ($83). But for the frugal, see this guide to putting together a better emergency kit yourself for less money. Sometimes what you're worried about is disease. Sometimes it's wildfire smoke. Or particulate matter from lord knows what else. But have you ever regretted having some nice filtration face masks lying around? The biggest category people tend to neglect when thinking about emergency preparedness, says Sury, is intangibles. This can be as simple as having a family communication plan and prearranged meeting points, so you know what to do if members of your family are separated. But also, it’s important to have digital backups of key documents, Sury said, “anything that is high value that may potentially get damaged in a disaster.” This may include insurance documents, titles to homes and cars, medical information such as prescription drug lists and instructions, doctor contact information, and photographs of passports and state identification. Likely you have access to one form or another of cloud storage. See WIRED’s guide to the best cloud storage services for each need and type of device, and make sure you use a good password manager to keep any sensitive data secure. But especially if internet access is not assured—or you’d prefer not to store some documents on the cloud—another secure option is a portable external storage drive that can easily be slipped into a waterproof pouch. WIRED reviewer Scott Gilbertson recommends OWC’s Envoy Pro Elektron SSD ($179) as a portable storage drive that’ll stand up to the elements and can get wet—and travel with you anywhere. Or just store the essentials on a USB flash drive like WIRED's top-pick, the SanDisk Extreme Pro ($42). Wait, does this seem dramatic? Well, maybe—but being safe is better than being sorry. Disaster takes many forms, and some of it is human. Here's WIRED's guide to how to procure and set up a burner phone in a way that can't be tracked. But to avoid trackers on phones, you'll also want a Faraday bag to block tracking signals, like an SLNT Faraday bag from Silent Pocket. True burner phones are not bought online. But if all you need is a search-safe phone to cross a border with, what you actually want is an affordable altphone severed from incriminating data: The Moto G Stylus 5G will serve your needs here. The world runs on electricity. The electrical grid can be fragile. Lithium-ion power packs are the modern answer—but it can be a volatile technology, so you don’t want to just resort to the cheapest ones. Among portable power banks and larger-capacity power stations, WIRED testers have long recommended portable devices from Jackery—ranging from the 8-pound, 288-watt-hour 300 model that also includes solar options to a 62-pound behemoth with about seven times that capacity. In addition to basic power banks, you'll probably want to make sure you can jump your own car without need of (overwhelmed) emergency personnel. WIRED testers have had excellent luck with devices from Noco and Gooloo. Yes, a radio. You know, that thing in your car that you plug your iPhone into sometimes? Anyway, whatever's going on with the internet or the satellites, a radio is a good source of emergency information. Have one. The classic prepper advice is a handcrank radio. But for shorter-term emergencies, batteries are also a thing. Another thing people forget to do until the internet is already down? Download emergency phone apps. As of October 2025, FEMA has an app. Your local municipal or state government likely also has opt-in emergency push-notifications: Consider opting in. WIRED has also cataloged a number of other personal safety apps, including a subscription service called Rescu that can connect you directly to first responders. Whatever portable battery-operated devices you own? Have extra batteries for them. A cooler is helpful to keep food fresh, of course. But also, a lot of medications need to be temperature-controlled, noted Columbia disaster preparedness expert Sury. And so if this is someone in your family, a small cooler can also be a piece of emergency equipment, when combined with an ice pack or two from the freezer. This is another neglected item that’s recommended by everyone from emergency experts to everyone who’s ever met a child. In stressful or protracted situations, trust in distraction. This can be as simple as a book of puzzles, a good building kit, or the foresight on the way out the door to grab the Nintendo Switch 2 and a small power bank like WIRED’s top-pick Nimble. In addition to prescription medications, an over-the counter painkiller and antacid tablets are helpful additions to any emergency kit. So are feminine hygiene products. So are toothbrushes and toothpaste. An emergency is a bad time to catch a stomach bug or any kind of infection. “Anything to maintain hygiene, that's so important,” Sury says. “Especially if we don't have water running, we just don't want to get any kind of virus transmission, or fecal, orally transmitted bacterial infections.” And so hand sanitizers end up being … a big deal. So are good ol’ disinfecting wipes. The world is full of awful stuff. And in some kinds of emergencies, contaminants are a genuine concern. Nitrile gloves will help you not touch it, and they’re resistant to cuts and tears. They're also essential in first-aid situations. Do you plan on leaving Fido or Meowser behind, when the rains come to wash these streets clean? Assuming not, maybe keep a pet carrier with portable food and water dishes handy. If you have horses? You'll need to own a trailer and something that can tow it. If you have a pet boa constrictor, I don't have good advice. [I do have a pet boa constrictor, and I recommend putting it in a pillowcase. —Ed.] A can opener, to open cans. A pair of scissors for all sorts of things. Duct tape and sheeting to build temporary shelters or provide cover from rain. A box of matches in a ziplock baggie. A notepad and a pen. Non-shatter plates and cups, whether paper or metal. Yes, they still exist. Yes, they're a good idea.",
    "domain": "wired.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:20.902892+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "wired.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.wired.com/story/emergency-kit-disaster-preparedness-guide/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d70dece1e76eb38d15c6e2f1fbdf825a",
    "processed_at": "2025-10-22T13:19:23.854480",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article focuses on emergency preparedness and essential gear for disaster situations, with no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.wired.com/story/resistant-bacteria-are-advancing-faster-than-antibiotics/",
    "title": "Resistant Bacteria Are Advancing Faster Than Antibiotics",
    "text": "The proliferation of difficult-to-treat bacterial diseases represents a growing threat, according to the World Health Organization's (WHO) Global Antibiotic Resistance Surveillance Report. The report reveals that, between 2018 and 2023, antibiotic resistance increased by more than 40 percent in monitored pathogen-drug combinations, with an average annual increase of 5-15 percent. According to data reported by more than 100 countries to WHO's Global Antimicrobial Resistance and Use Surveillance System (GLASS), one in six laboratory-confirmed bacteria in 2023 proved resistant to antibiotic treatment, all related to various common diseases globally. Superbugs For the first time, this edition of the report includes prevalence estimates of resistance to 22 antibiotics used to treat urinary tract, gastrointestinal, bloodstream, and gonorrheal conditions. The analysis focused on eight common pathogens: Acinetobacter spp, Escherichia coli, Klebsiella pneumoniae, Neisseria gonorrhoeae, non-typhoidal Salmonella spp, Shigella spp, Staphylococcus aureus, and Streptococcus pneumoniae. The results show that resistant gram-negative bacteria pose the greatest threat. Of particular note are Escherichia coli and Klebsiella pneumoniae, which are associated with bloodstream infections that can lead to sepsis, organ failure, and death. \"More than 40 percent of E. coli and more than 55 percent of K. pneumoniae strains worldwide are now resistant to third-generation cephalosporins, the first-choice treatment for these types of infections,\" the report warns. These microorganisms are joined by Salmonella and Acinetobacter, which are also developing resistance to essential drugs such as carbapenemics and fluoroquinolones. This reduces therapeutic alternatives and forces the use of last-resort antibiotics, which are often expensive and difficult to access, especially in low- and middle-income countries. Medicine Lags Behind “Antimicrobial resistance is outpacing advances in modern medicine, threatening the health of families worldwide,\" said WHO director-general Tedros Adhanom Ghebreyesus in a statement. \"We must use antibiotics responsibly, and make sure everyone has access to the right medicines, quality-assured diagnostics, and vaccines.” Optimizing surveillance systems and obtaining accurate data is an urgent task. Although there has been progress, it is still insufficient. Between 2016 and 2023, the number of countries participating in GLASS quadrupled from 25 to 104. However, 48 percent did not report data in 2023, and almost half of those that did report lacked sufficient infrastructure to generate reliable data. WHO warns that addressing this problem must be a priority in regions such as Southeast Asia and the Eastern Mediterranean, where one in three reported infections is resistant, as well as in Africa, where one in five has the same condition. “Achieving this target will require concerted action to strengthen the quality, geographic coverage, and sharing of AMR surveillance data to track progress,” the report states. “Countries should scale up coordinated interventions designed to address antimicrobial resistance across all levels of health care and ensure that treatment guidelines and essential medicines lists align with local resistance patterns.” The Interagency Coordination Group on Antimicrobial Resistance warns that this problem is among the top 10 threats to humanity. Without effective action, annual deaths from drug-resistant infections could exceed 10 million by 2050. \"Our future also depends on strengthening systems to prevent, diagnose and treat infections and on innovating with next-generation antibiotics and rapid point-of-care molecular tests,\" Ghebreyesus concluded. This story originally appeared in WIRED en Español and has been translated from Spanish.",
    "domain": "wired.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20251022T110000Z",
    "date_download": "2025-10-22T11:19:21.041316+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "wired.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.wired.com/story/resistant-bacteria-are-advancing-faster-than-antibiotics/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "aff3779ed59b16f31275f52a84d19b6b",
    "processed_at": "2025-10-22T13:19:23.854508",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses antibiotic resistance and its implications for public health, without any mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  }
]