[
  {
    "url": "https://www.dr.dk/nyheder/politik/kommunalvalg/finn-og-louise-er-naboer-til-omdiskuteret-luksus-byggeri-215-biler-ekstra-er-jo-helt-vildt",
    "title": "Finn og Louise er naboer til omdiskuteret luksus - byggeri :  215 biler ekstra er jo helt vildt  ",
    "text": "Louise Mathiasen er lidt forvirret, da DR møder hende en formiddag i oktober, hvor solen kæmper med at trænge igennem skydækket over Nyborg Fjord. Hun har lige læst en ikke offentliggjort rapport, som DR har fået aktindsigt i. Rapporten er lavet af det rådgivende ingeniørfirma COWI og handler om, hvordan trafikken vil udvikle sig, hvis der opføres to nye boligblokke - et stenkast fra hendes hjem på Sølystvej, tæt ved fjorden. Et projekt, som deler vandene i den fynske kystby. For er det egentlig en god idé at rive en bevaringsværdig ejendom fra 1800-tallet ned for at give plads til 66 eksklusive lejligheder? Det vender vil tilbage til. På den ene og anden side For selv om Louise Mathiasen \"bestemt har en holdning\" til, om man skal bevare gamle bygninger frem for at bygge nyt, så er det helt konkrete og nære problemstillinger, som optager hende mest. Nemlig mængden af biler. Hun har læst den nye rapport, men kæmper med at forstå konklusionerne: For på den ene side fastslås det, at trafikbelastningen i hendes nærområde vil vokse betydeligt. Faktisk med 215 køretøjer i døgnet. På den anden side vurderes det, at \"trafikken kan afvikles med høj kvalitet og minimal forsinkelse\". Både adgangsveje og kryds kan håndtere det øgede tryk - uden problemer, hedder det. - Men 215 biler ekstra - det er jo helt vildt! Hvordan kan man komme frem til, at det ikke bliver et problem?, spørger Louise Mathiasen og slår ud med armene. - Se for eksempel svinget her på Sølystvej, hvor vi allerede i dag oplever farlige situationer med hårde opbremsninger og biler, der har svært ved at komme rundt. Med så mange ekstra køretøjer vil det da kun blive værre. Vi er meget bekymrede for trafiksikkerheden, siger hun. Ikke den virkelige verden Rapporten fra COWI peger faktisk på, at netop den smalle og kurvede Sølystvej potentielt kan blive en udfordring i forhold til den ene af de to adgangsveje til det nye boligkompleks. Oversigtsforholdene er dårlige, hedder det, og hastigheden bør sænkes til 30 kilometer i timen, lyder anbefalingen. Men det løser ingenting, mener en anden nabo, Finn Jørgensen. - Jeg synes ikke, at rapporten beskriver den virkelige verden, siger han. - I dag er mange beboere her i kvarteret nødt til at parkere med hjulene oppe på fortovene, så trafikken kan glide. Og det er jo ulovligt. Og hvis det hele bliver kaos, fordi der kommer endnu flere biler, så kan det jo være, at vi ikke længere må parkere uden for vores ejendom, siger han. Kommune: Bygning er bevaringsværdig Men sagen om Sølyst handler som sagt om mere end trafik. Mange nyborgensere nærer stærke følelser for den karakteristiske hovedbygning, som blev opført i 1895. Nyborg Kommune kategoriserer selv bygningen som 'bevaringsværdig', og af samme grund har Sølysts nuværende ejer, Bøg Madsen Ejendomme, over de senere år fået flere afslag hos kommunen, når de har bedt om lov til at fjerne den nedslidte og tomme bygning for at bygge nye boliger. Men i foråret 2025 vendte stemningen. Nu kunne både Venstre og et flertal i Socialdemokratiets byrådsgruppe bakke op om det ambitiøse projekt, som i første omgang omfattede 75 lejligheder i to syv-etagers etageejendomme. Senere er projektet blevet skaleret lidt ned. En etage er barberet væk og antallet af lejligheder hedder nu 66. SF: Det handler om identitet Men det ændrer ikke på, at borgmesterkandidat Suzette Frovin (SF) stadig er lodret imod. - Der er mange perspektiver i hele sagen om Sølyst. For os er det absolut vigtigste, hvordan vi behandler byens identitet og historie, og hvordan vi samarbejder med investorer i byen, siger Suzette Frovin. Sammen med Konservative og et mindretal i Socialdemokratiet stemte hun og SF imod, da et flertal i byrådet - bestående af Venstre og fem socialdemokrater - efter heftig debat gav grønt lys til, at der kan arbejdes videre med at lave en ny lokalplan for området, så det nuværende Sølyst kan rives ned og der kan bygges nye boliger på grunden. Den nye trafikrapport er en del af det arbejde. Og selv om rapporten endnu ikke er blevet lagt frem til politisk behandling, så har Suzette Frovin læst den. Hun bor nemlig selv i kvarteret. Og kender derfor alt til, hvor svært det allerede nu er at navigere rundt i de smalle gader. -I dag er det jo ofte nærmest umuligt for to biler at passere hinanden, fordi der holder så mange parkerede biler. Så jeg har ærligt talt meget svært ved at se, hvordan man skal kunne afvikle trafikken med så mange ekstra biler i døgnet. Har de mennesker, som har lavet den rapport, overhovedet været nede og se, hvordan der ser ud?, spørger SF-politikeren. Venstre: Det er ikke raketvidenskab I Venstre erkender gruppeformand Kaj Refslund, at trafikafviklingen i Sølyst-kvarteret allerede i dag er udfordret. Derfor synes han også, at beboernes bekymring er 'helt forståelig'. - Det er ikke raketvidenskab at regne ud, at vi er nødt til at gøre noget andet i forhold til trafikken end det, vi gør i dag. Så vi kommer til at se på en samlet trafikplan for hele området, og her vil vi selvfølgelig også gå i dialog med beboerne, siger Kaj Refslund. Og den den udmelding flugter godt med planerne i Nyborg Kommunes Klima- Park og Naturforvaltning. Her oplyser afdelingsleder Pernille Bech nemlig, at der skal arrangeres et borgermøde om Sølyst, når forslaget til en ny lokalplan samt et kommuneplantillæg sendes i offentlig høring. Det sker formentlig i foråret 2026. Men Finn Jørgensen på Sølystvej har ikke den store tiltro til, at et borgermøde vil gøre den store forskel. - Der er to partier i byrådet, som med djævelens vold og magt vil have det her projekt realiseret. Så jeg er desværre ret sikker på, at vi ender med sorteper, siger han.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T104500Z",
    "date_download": "2025-10-29T11:06:48.960831+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/politik/kommunalvalg/finn-og-louise-er-naboer-til-omdiskuteret-luksus-byggeri-215-biler-ekstra-er-jo-helt-vildt",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8a1c2af84894175f48d8195184cf19fc",
    "processed_at": "2025-10-29T12:10:03.380421",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses local community issues related to traffic and urban development, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/faergehavn-eksproprieres-i-stedet-koeb",
    "title": "Færgehavn eksproprieres i stedet for køb | Nyheder",
    "text": "Slagelse Kommune kan ikke bare sælge Halsskov Færgehavn til staten, som den ellers havde tænkt sig, for tidligere på måneden underkendte Ankestyrelsen salget. Derfor har staten valgt en anden taktik, og Transportministeriet skriver nu i en pressemeddelelse, at de vil ekspropriere Halsskov Færgehavn. Når man taler om ekspropriation, vil det sige, at staten tvinger en ejer til at afstå sin ejendom mod fuld erstatning, som vurderes af en kommission. Halsskov Færgehavn var det sted, hvor bilfærger til Fyn frem til 1998 gik fra. Staten ønsker at få fat i havnen i tilfælde af en beredskabskrise, hvor Storebæltsbroen lukket, og det er det statsejede selskab Sund & Bælt, der skal overtage havnen. Staten har lavet samme manøvre med ekspropriering ved Knudshoved Havn, hvor bilfærgerne afgik fra Fyn.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T104500Z",
    "date_download": "2025-10-29T11:06:49.111994+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/faergehavn-eksproprieres-i-stedet-koeb",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "bcde74c981036f98f17b1eb7e81d8772",
    "processed_at": "2025-10-29T12:10:03.380530",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the expropriation of a ferry harbor by the state and does not mention artificial intelligence or related topics. It focuses on legal and governmental actions regarding property rather than any AI concepts.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/indland/det-foeles-som-en-snydekode-til-livet-debattoer-opfordrer-kvinder-til-finde-en-mand-der-er-klogere",
    "title": "  Det føles som en snydekode til livet : Debattør opfordrer kvinder til at finde en mand , der er klogere end dem selv | Indland",
    "text": "Vil du have en snydekode til livet? Så skal du som kvinde finde dig en mand, der er ’kognitivt stærkere’ end dig selv. Sådan lyder det fra Julie Grove, der er debattør og skribent, i et debatindlæg i Berlingske. Hun har nemlig – for første gang i sit liv – en partner, der overgår hende på det intellektuelle plan. Og det anbefaler hun også andre kvinder at gå efter. - Livet bliver ganske enkelt lettere, når man slår sig sammen med en, der kan præstere bedre på afgørende områder. Det føles næsten som at have fundet en snydekode i livets store spil, skriver Julie Grove i sit debatindlæg. Og hvordan er det så en snydekode, tænker du måske? - Hvis nu jeg skulle sammenligne mig med en computer: Jeg er en udmærket computer, rimelig driftssikker. Men når du har en partner, som lige er det skarpere, så er der bare lidt mere processing power (en computers evne til at behandle data og udføre opgaver, red.) i den computer, siger Julie Grove i P1 Morgen. - Jeg har lagt mærke til, at han er bedre til at connect the dots hurtigere, end jeg er. Jeg kan sagtens komme frem til den rigtige konklusion, men det tager mig længere tid. Det betyder, at der er tankeressourcer, jeg kan outsource til ham, for så ved jeg, at det bliver processed hurtigere, end hvis jeg selv gør det. I sit debatindlæg skriver hun desuden, at hun ”bruger naturligvis stadig sit eget hoved”, men at det ”letter en kæmper byrde, at jeg ikke behøver at frygte dårlige beslutninger, når jeg vender ryggen til”. Har selv fravalgt kloge mænd Julie Grove har tidligere været feminist, og dengang fravalgte hun mænd, blandt andet fordi de var intellektuelt klogere end hende. Noget, som hun oplever, at mange kvinder gør i dag. I sit debatindlæg skriver hun: - Jeg tvivler på, at mange feminister i den fødedygtige alder ville have nemt ved at acceptere en konstellation, hvor de ikke er den klogeste, selvom deres liv ville blive bedre. Hvad er det konkret, du mener, der får kvinder til at fravælge de her ”kognitivt stærke” mænd?, spørger værten Anne Kirstine Hermann i P1 Morgen. De seneste næsten ti år har kvinderne taget føringen, når det gælder uddannelse. Ifølge Danmarks Statistisk har der siden 2017 været flere kvinder end mænd med en lang videregående uddannelse. Eksperter peger på, at der er mange højtuddannede single kvinder, netop fordi de gerne vil have en mand med samme eller bedre kognitivt niveau. Hvorfor køber du ikke den forklaring på, hvorfor der er mange ufrivilligt single kvinder? - Jamen det er jo også en del af det, siger Julie Grove. Men det er jo det præcis modsatte af det, du siger i din kommentar? At det er, fordi kvinder ikke vil være sammen med kloge eller kognitivt stærke mænd? - Jeg tror ikke, at kvinder er bevidste om, at de gør det her. Det, jeg ser, er, at det er en ego-ting. Der er den her idé om, at vi skal være lige. Verden er ikke sort-hvid, men jeg ser bare de her tendenser. Mærker det særligt i den politiske diskussion Men hvordan ved man så, at en mand er klogere end en selv? Det er særligt, når samtalen falder på politik, at Julie Grove kan mærke den intellektuelle forskel. Selvom hun understreger, at hun og hendes partner ikke altid er enige, og at hun ikke altid giver ham ret, bare fordi han er klogere end hende. Men politik er jo ikke en nøjagtig videnskab, det handler om værdi og ideologier. Der er vel ikke et rigtigt og forkert svar. Så hvordan ved du, at din kæreste har mere ret, når I diskuterer politik? - Det kan jeg jo se på konsekvensberegningen. Jeg giver ham ikke nødvendigvis ret i alting, fordi vi ikke nødvendigvis er det samme sted politisk. Det er netop derfor, at jeg mener, at det vel er svært at måle politiske holdninger op mod hinanden, og så sige, at den ene er kognitivt stærkere end den anden? - Jamen hvis jeg kan se, at hans konsekvensberegning er bedre end min. Altså hvis jeg har en holdning, og vi tænker den holdning hele vejen ud, hvad afstedkommer det? Så kan jeg nogle gange sidde og tænke: \"pis, nu havde han ret igen\". Julie Grove oplever, at mange kvinder ikke tør vælge den ”ukorrekte mand”, fordi der er mere på spil end blot parforholdet. Men det er en nødvendig risiko, mener hun. Hør mere om det i P1 Morgen.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T104500Z",
    "date_download": "2025-10-29T11:06:49.160099+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/indland/det-foeles-som-en-snydekode-til-livet-debattoer-opfordrer-kvinder-til-finde-en-mand-der-er-klogere",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0d7997716b840f4cc25b1fd843b9b011",
    "processed_at": "2025-10-29T12:10:03.380687",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses personal relationships and the dynamics of intelligence between partners, using a metaphor related to computers but does not focus on artificial intelligence as a field or technology.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/indland/landsret-stadfaester-dom-over-politiledere-i-tibet-sag",
    "title": "Politiledere dømt for at give falsk forklaring i Tibet - sag",
    "text": "Artiklen er opdateret med oplysning om frifindelse for en del af sagen. Østre Landsret dømmer to tidligere politiledere for at afgive falsk forklaring for retten i Tibetsagen. Dermed er dommen i Landsretten en stadfæstelse af byrettens straf på 30 dages betinget fængsel. Daværende vicepolitiinspektør Claus Hjelm Olsen og den tidligere politikommissær Henrik Oryé er dømt for at have løjet i retten om, hvordan politiet i København håndterede Kina-kritiske demonstranter. De to politiledere har hele tiden nægtet sig skyldig og gik i ankesagen efter at blive frifundet. Demonstranter protesterede i 2012 over det kinesiske styres behandling af Tibet under et kinesisk statsbesøg i København. I august 2013 vidnede de to ledere om politiets behandling af demonstranter under statsbesøget. Det skete i et retsmøde, hvor seks demonstranter mente, de var blevet ulovligt anholdt. Flere borgere havde anlagt sag mod Københavns Politi for ulovlig frihedsberøvelse. I landsretten blev Claus Hjelm Olsen frifundet for en tidligere udtalelse om det tibetanske flag, som byretten ellers havde dømt ham for. Landsretten mente ikke, at der var bevis for, at han bevidst løj, skriver Ritzau. Fik også kritik af Tibet-kommission Tibet-sagen handler om, at politiet forsøgte at holde demonstranterne væk fra den kinesiske delegation på besøg i København. Demonstranter blev blandt andet forhindret i at vise Tibets flag for Kinas daværende præsident Hu Jintao. Tibetkommissionen har tidligere konkluderet, at demonstranternes ytringsfrihed blev krænket. De to politiledere fik også kritik af kommissionen. De har tidligere fortalt i retten, at der ikke var en ordre om at fjerne det tibetanske flag under statsbesøget, men siden kom det frem, at sådan en ordre fandtes, hvilket medførte hård kritik fra kommissionen. Statsadvokaten mente efter sagen, at de to politiledere også havde givet urigtige og vildledende oplysninger, som skulle bruges i svar til Folketinget om sagen. Men de blev ikke tiltalt for dette, fordi den del af sagen allerede var forældet.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T104500Z",
    "date_download": "2025-10-29T11:06:49.225770+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/indland/landsret-stadfaester-dom-over-politiledere-i-tibet-sag",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5a94194239ee67209ec3bae4c445c25d",
    "processed_at": "2025-10-29T12:10:03.380782",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a legal case involving police leaders and their false testimonies related to protests in Denmark concerning Tibet. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/krimi/44-aarig-doede-i-ulykke-politiet-har-anholdt-formodet-flugtbilist/10991823",
    "title": "44 - årig døde i ulykke : Politiet har anholdt formodet flugtbilist",
    "text": "Midt- og Vestjyllands Politi har anholdt en 38-årig, der mistænkes for at være involveret i en dødelig trafikulykke i Silkeborg i weekenden. Det skriver Midtjyllands Avis. Anholdelsen fandt sted tirsdag. Ulykken fandt sted på Nordskovvej ved Silkeborg og kostede en 44-årig mand livet. Politiet blev alarmeret om ulykken kort før klokken 06 lørdag morgen, da en forbipasserende fandt den afdøde 44-årige i vejkanten. Politiet formoder, at den 44-årige blev ramt af en bil, som den anholdte førte, og som efterfølgende flygtede fra ulykkesstedet. Manden er sigtet for uagtsomt manddrab og for ikke at have hjulpet en person i hjælpeløs tilstand. Det oplyser Michael Svendsen fra lokalpolitiet i Silkeborg til avisen. Den 38-årige blev løsladt efter endt afhøring. Over for Midtjyllands Avis ønsker Michael Svendsen ikke at svare på, hvordan den 38-årige forholder sig til sigtelsen. I forbindelse med ulykken efterlyste politiet den bil, som man mente havde været involveret i ulykken. Samtidig blev en mand og en kvinde efterlyst.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T094500Z",
    "date_download": "2025-10-29T11:06:58.777199+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/krimi/44-aarig-doede-i-ulykke-politiet-har-anholdt-formodet-flugtbilist/10991823",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "03498f98ee630853ee699026b07bacbe",
    "processed_at": "2025-10-29T12:10:03.380826",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a traffic accident and the subsequent police investigation, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bt.dk/nyheder/kedelig-dmi-melding-en-typisk-dansk-efteraarsdag",
    "title": "Kedelig DMI melding : En typisk dansk efterårsdag",
    "text": "Hvis du elsker en god dansk efterårsdag, er der godt nyt til dig. For onsdag vil både byde på blæsevejr, grå skyer og regn sidst på dagen. Dog er der lidt sol til de morgenfriske, for solen vil skinne de første timer af onsdagen. »Man skal skynde sig at nyde de solstrejf i morgentimerne. Når vi når frem til middag, er der ikke meget sol tilbage, og der vil komme flere skyer og lidt regn til sidst.« Sådan lyder meldingen fra Mette Zhang, som er vagthavende meteorolog hos DMI. »Selvom temperaturen er mild, vil det føles så træls med den vind,« siger hun. Temperaturen onsdag vil ligge mellem 9 til 12 grader, hvilket ifølge meteorologen er mildt taget sæsonen i betragtning. »Man kan godt sige, at temperaturen er mild for slutningen af oktober, men det bliver samtidig blæsende.« Her kan det lokalt blive op til kuling ved kysterne i den sydlige del af landet. Så lad dig ikke snyde af de enkelte solstrejf på himlen, der onsdag morgen titter frem. Det er blot en kort affære.",
    "domain": "bt.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T100000Z",
    "date_download": "2025-10-29T11:07:01.681861+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bt.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.bt.dk/nyheder/kedelig-dmi-melding-en-typisk-dansk-efteraarsdag",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1cf6a121f70c98e7e17b8acc385b3d46",
    "processed_at": "2025-10-29T12:10:03.380867",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses weather conditions in Denmark and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bt.dk/politik/nanna-retter-skyts-mod-mette-f-efter-influencer-besoeg-jeg-bliver-lidt-frustreret",
    "title": "Nanna retter skyts mod Mette F . efter influencer - besøg :  Jeg bliver lidt frustreret  ",
    "text": "Det er ikke risikofrit at invitere influencere til at udtale sig som eksperter. Sådan lyder budskabet fra forperson Nanna Kornerup Nielsen fra Børns Værd, efter statsminister Mette Frederiksens (S) møde med seks store influencere fredag. Her skulle de – sammen med fire fagpersoner – diskutere vilkårene for børnefamilier i Danmark. Og det ærgrer Nanna Kornerup Nielsen. »Jeg bliver lidt frustreret over, at man ikke har nogle større ambitioner. Vi savner større ambition for, hvor man vil hen på børneområdet,« siger hun til B.T. Størstedelen af deltagerne var ikke eksperter eller fagpersoner, men i stedet seks store influencere, som tilsammen har over en million følgere på Instagram. Ifølge Nanna Kornerup Nielsen negligerer man de centrale problemstillinger for børn og småbørnsfamilier, når størstedelen af mødedeltagerne er influencere. »Det kan have nogle risici, fordi man ikke tager fat i de kerneproblemstillinger, som er på børneområdet. Jeg kunne godt tænke mig, at man i stedet inviterede eksperter i børns udvikling,« siger hun. Flere af de influencere, der deltog i mødet, beskæftiger sig med emnet til daglig og har en stemme i den offentlige debat. Kan de ikke have nogle værdifulde input? »De har helt sikkert nogle relevante input, men det er langt fra alle, der lever et liv som dem,« siger hun og fortsætter: »De fleste forældre har et almindeligt arbejdsliv fra 8 til 16, og mange børn er rigtig lang tid i dagtilbud.« Nanna Kornerup Nielsen mener, at man overser de vigtigste temaer – blandt andet, hvordan man tidligt i livet kan forebygge børns mistrivsel. »Det er allerede i vuggestuen, at forebyggelsen skal begynde. Her sker der afgørende udvikling i børns følelsesliv,« siger hun og fortsætter: »Hvis vi ikke sikrer, at der er nok nærværende voksne omkring de mindste børn i dagtilbud, løser vi ganske enkelt ikke den samfundsopgave, som forebyggelse af mistrivsel er.« B.T. har spurgt statsminister Mette Frederiksen, om hun kan forstå Nanna Kornerup Nielsens kritik. I et skriftligt svar understreger familieordfører for Socialdemokratiet, Trine Bramsen, at der også var repræsentanter til stede fra fagorganisationer. »Regeringen mødes hele tiden med både fagprofessionelle og almindelige danskere. I denne uge skal statsministeren for eksempel besøge en daginstitution i Københavnsområdet,« skriver hun og fortsætter: »Rundbordssamtalen fredag kan derfor ikke ses isoleret som udtryk for, hvad regeringen foretager sig.« Til B.T. understreger Social Demokratiet, at der var tale om et enkelt møde med de danske influenter, og statsministeren oftest mødes med relevante fagpersoner.",
    "domain": "bt.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T100000Z",
    "date_download": "2025-10-29T11:07:01.731697+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bt.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.bt.dk/politik/nanna-retter-skyts-mod-mette-f-efter-influencer-besoeg-jeg-bliver-lidt-frustreret",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "7f1b3c4eb4c9073b39e2f938749a911e",
    "processed_at": "2025-10-29T12:10:03.380929",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the concerns of inviting influencers to discuss children's issues in Denmark, focusing on the importance of expert input rather than AI-related topics. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bt.dk/erhverv/ikonisk-cafe-sat-til-salg",
    "title": "Ikonisk café sat til salg",
    "text": "Skulle du gå med en drøm om at eje en ikonisk beværtning, så kan den drøm nu gå i opfyldelse. For Café Lindevang, der ligger på Frederiksberg i København, er nemlig sat til salg. Det skriver KøbenhavnLIV. Cafeen, der sælger klassiske danske retter, er i dag ejet af Carsten Jensen og John Hansen på henholdsvis 66 og 68 år. Sammen har makkerparret besluttet sig for, at det er tid til at skrue ned for arbejdet, og derfor har de sat restaurationen til salg på 3.795.000 kroner. Der er dog én ting, som Carsten Jensen håber, at de nye ejere vil bibeholde. »Står det til os, fortsætter Lindevang med at være det gode rustikke spisested, som det altid har været. Jeg vil da på det kraftigste fraråde en ny ejer at male væggene hvide og ændre konceptet,« siger han. Samtidig slår Carsten Jensen fast, at de ikke har travlt med at sælge stedet, der har eksisteret siden 1938. Skulle du være fristet, får du 50-60 pladser til spisende gæster med i købet. Og i sommermånederne er der yderligere 40-50 pladser til udeservering og 50 pladser i den overdækkede gårdhave.",
    "domain": "bt.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T100000Z",
    "date_download": "2025-10-29T11:07:01.776627+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bt.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.bt.dk/erhverv/ikonisk-cafe-sat-til-salg",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d4091a80cc6b5ef0c6214194d3715f1e",
    "processed_at": "2025-10-29T12:10:03.380971",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the sale of a café and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bt.dk/krimi/seniorsergent-anklaget-for-bedrageri-pengene-roeg-ind-paa-hans-private-bankkonto",
    "title": "Seniorsergent anklaget for bedrageri : Pengene røg ind på hans private bankkonto",
    "text": "For få år siden skulle han i audiens hos dronning Margrethe for at have modtaget fortjenstmedaljen i sølv for 40 års tjeneste i Forsvaret. Nu er en 61-årig seniorsergent på Flyvestation Karup blevet tiltalt for stillingsmisbrug og årelangt bedrageri for et samlet beløb på 172.700 kroner. Derfor vil den militære anklager fra Forsvarets Auditørkorps kræve ham idømt fængsel, når seniorsergenten i næste uge skal stilles for byretten i Viborg. Ifølge anklageskriftet i sagen, som B.T. har fået aktindsigt i, er de omfattende ulovligheder foregået på to måder. For det første har den 61-årige mand, der også var skydebefalingsmand i Forsvarets Ejendomsservice, ifølge tiltalen i de fem år fra 2016 til 2021 ved bedrageri skaffet sig selv en uberettiget vinding på 74.700 kroner, som stammede fra Midt- og Vestjyllands Politi. Politikredsen lejede nemlig et våbenrum i bygning 209 på Flyvestation Karup af Forsvaret, men lejeindtægten endte i sidste omgang forbavsende nok på seniorsergentens private bankkonto. Og for det andet er han tiltalt for tjenestemisbrug og pligtforsømmelse af særlig grov karakter i fem forhold. Her har han ifølge anklageskriftet i årene 2022-24 via sin betroede adgang til flyvestationens sikkerhedskontor sørget for, at Idrætsforeningen Flyvestation Karup og DGI Midtjylland Skydning slap for at betale leje af flyvestationens skydebaner til fælles skydearrangementer. I det militære IT-program bookede han skydebanerne, som han i strid med retningslinjerne selv godkendte. Samtidig anvendte han et internt ordrenummer, der normalt anvendes af Forsvarets Sanitetskommando. Derved kom Sanitetskommandoen til at afholde mindre udgifter for skydearrangementerne, samtidig med at Forsvaret gik glip af lejeindtægter fra idrætsforeningerne. Ved den kommende retssag vil der eventuelt blive nedlagt påstand om erstatning, fremgår det af anklageskriftet fra Forsvarets Auditørkorps. Hans forsvarer oplyser til B.T, at manden nægter sig skyldig. For en halv snes år siden blev den nu 61-årige seniorsergent hyldet med årets hæderspris af idrætsforeningen på sin militære arbejdsplads for sit »trofaste og uegennyttige« arbejde.",
    "domain": "bt.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251029T100000Z",
    "date_download": "2025-10-29T11:07:01.818202+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bt.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.bt.dk/krimi/seniorsergent-anklaget-for-bedrageri-pengene-roeg-ind-paa-hans-private-bankkonto",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3c17751884e49856ef246acfdcc82836",
    "processed_at": "2025-10-29T12:10:03.381024",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a legal case involving a senior sergeant accused of fraud and misuse of position within the military, with no mention or relevance to artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293390/nu-vender-barndommens-raedsler-tilbage",
    "title": "Nu vender barndommens rædsler tilbage",
    "text": "Det kan godt være, at ikke alle Stephen Kings historier er vædet i blod og barneskrig. Men det er den helt nye HBO Max-serie Welcome to Derry til gengæld. Første afsnit ud af otte har netop haft premiere, og her møder vi hovedpersonerne, der bor i den fiktive Maine-provinsby Derry. Mange vil kende Derry fra Kings bog ”IT”, hvor den er hjemstavn for en af forfatterens mest ikoniske skabninger. Nemlig en overnaturlig, dæmonisk skikkelse, der lever af børns rædsel og tager form efter det, offeret er allermest bange for. Ofte møder man ”det onde” – der for øvrigt også er romanens danske titel – i skikkelse af den dansende dræberklovn Pennywise. Men selv om han ikke direkte dukker op i seriens første afsnit, så møder vi ham helt sikkert senere. Det skulle i hvert fald være ganske vist, at skuespilleren Bill Skarsgård gentager sin rolle fra den seneste filmudgave af historien. Welcome to Derry foregår mange år før netop den seneste filmversion af IT, der tager sit udspring i slutningen af 1980'erne. Derimod foregår store dele af selve bogen længe før. Ja, det er ærligt talt lidt forvirrende, men jo altså mest hvis man har læst IT. Ellers kan man være ligeglad. Hvorom alting er, så foregår Welcome to Derry i 1962, hvor drengen Matty forsøger at flygte fra byen og sit voldelige hjem. Det går ikke helt efter planen. Senere ankommer major Leroy Hanlon til byens militærbase og får en særdeles varm velkomst, mens en lille gruppe børn har en række overnaturlige oplevelser i form af stemmer fra afløbet og den slags. Undervejs er der flere hentydninger til særlig handling og personer i IT og andre dele af Stephen Kings univers. For eksempel er både major Hanlon og et af seriens børn i familie med den oprindelige fortællings hovedpersoner. Så selv om Welcome to Derry foregår i samme by og univers som IT, så er historie og medvirkende altså ikke gengangere. Ligeledes har Stephen King heller ikke selv været direkte involveret i dens manus og produktion. Til gengæld lader serien – ud over bekæmpelsen af lede overnaturlige væsener – stadig til at kredse om venskab og mobberi. Men her er dog endnu det element i form af en nærliggende flybase og måske et mystisk militært program, som vi endnu ikke ved så meget om. Desuden er hele seriens æstetik og gengivelse af en konform amerikansk lilleby med lurende ondskab under overfladen i de tidlige tressere et skud rå nostalgi direkte i blodbanerne. Men selv om seriens hovedpersoner til en vis grad er børn, så er Welcome to Derry i udpræget grad ikke en serie for de yngste. Og med en lidt overraskende slutning på første – og meget lovende – afsnit er det ærligt talt svært at levere kvalificerede gæt på, hvad vi kan vente os af de næste syv afsnit.",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251029T101500Z",
    "date_download": "2025-10-29T11:07:36.442598+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293390/nu-vender-barndommens-raedsler-tilbage",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "469a04c342d01ffda5a812a9016feaeb",
    "processed_at": "2025-10-29T12:10:03.381082",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a new HBO Max series based on Stephen King's universe, focusing on its plot, characters, and themes. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/2025/oct/29/wednesday-briefing-catastrophic-reports-as-jamaica-reels-from-worst-storm-since-records-began",
    "title": "Wednesday briefing :  Catastrophic  reports as Jamaica reels from worst storm since records began | Hurricanes",
    "text": "Good morning. Hurricane Melissa, the strongest storm to hit Jamaica since records began in 1851, made landfall at about midday local time on Tuesday. With winds reaching 185mph and torrential rains, it knocked out power lines, cut off the internet, and demolished buildings; the death toll and extent of the damage are still unknown. The storm has already hit Haiti and the Dominican Republic; though it was at one stage downgraded to a tropical storm, now it has strengthened again and is expected to arrive imminently in Cuba, where more than 700,000 people have been evacuated. “The reports that are coming in are catastrophic,” Jamaican energy and transport minister Daryl Vaz told Sky News. “Not very much survives a Category 5 hurricane, in terms of infrastructure.” Melissa is unprecedented in Jamaica – but it is the third category 5 hurricane, the highest designation on the Saffir-Simpson scale measuring wind speed, since hurricane season in the Atlantic region began in June. For the very latest, head to the live blog. For today’s newsletter, I spoke to Natricia Duncan, the Guardian’s Caribbean correspondent in Kingston, about the devastation Melissa has left in its wake. Here are the headlines. Five big stories - Economy | Rachel Reeves has said Britain can defy gloomy economic forecasts after the fiscal watchdog infuriated ministers by predicting a productivity downgrade would leave her with a £20bn gap to fill in her forthcoming budget. - Sudan | Ethnically motivated mass killings and other atrocities are being reported from El Fasher after the paramilitary Rapid Support Forces took control of the city in Sudan’s western Darfur region over the weekend. - UK news | Downing Street has defended the prospect of paying more to house asylum seekers in disused barracks instead of hotels, arguing that quelling public disquiet was worth the extra cost. No 10 said that “communities don’t want asylum seekers housed in hotels, and neither does the government”. - Middle East | Israeli warplanes struck Gaza on Tuesday night, shortly after Israel’s prime minister, Benjamin Netanyahu, ordered the military to carry out “powerful strikes” in Gaza, in the most serious test of the increasingly shaky US-brokered ceasefire. - Television | Prunella Scales, the actor best known for playing Sybil Fawlty in the classic comedy series Fawlty Towers, has died aged 93. Scales, who was married to fellow actor Timothy West, was diagnosed with Alzheimer’s disease in 2013. In depth: ‘There is no infrastructure in the region that can withstand a category 5 hurricane’ In an advisory message on Hurricane Melissa published yesterday, the National Hurricane Center in the US painted a bleak picture of its likely consequences. For anything in the path of the ring of thunderstorms around the eye of the hurricane, known as the eyewall, “total structural failure is likely, especially in higher elevation areas”, it said. “Catastrophic flash flooding and numerous landslides are likely … Peak storm surge heights could reach 9 to 13ft above ground level, near and to the east of where the centre of Melissa makes landfall. This storm surge will be accompanied by large and destructive waves.” Here’s a useful visual guide to how the storm developed. At a press briefing, the Jamaican prime minister, Andrew Holness, asked the public to heed the severity of the threat. “You have been warned. It’s now up to you to use that information to make the right decision. I have been on my knees in prayer.” For many Jamaicans, Natricia Duncan said, last year’s Hurricane Beryl – which was less severe but did damage costed at about $200m – is fresh in the memory. “It’s only a year ago,” she said. ‘“Everybody has a very recent memory of how destructive the impact was, and they know how much worse this one could be. So people are really frightened.” Why is Hurricane Melissa so dangerous? The winds generated by the hurricane are exceptionally fast and destructive – but the storm itself has moved very slowly, at 2-4mph. That is a disastrous combination: it means the storm lingers, doing more damage before it moves on. “This is a dire situation unfolding in slow motion. A major hurricane slowly crawling toward an island with powerful winds, extreme rainfall, and damaging storm surge is a perilous situation for a place like Jamaica,” AccuWeather’s chief meteorologist Jonathan Porter said. “Slow-moving major hurricanes often go down in history as some of the deadliest and most destructive storms on record.” Natricia pointed to the devastation wrought by Hurricane Dorian in the Bahamas in 2019, where “it just sits over a country and has the opportunity to do maximum damage”. There is a psychological impact of that slow pace, she added. “You know it’s coming, and you prepare for it, and you deal with it. But when it’s moving so slowly, that extra time means that the uncertainty and anticipation keeps growing and growing. And there are constant updates that seem to get worse and worse.” What is the extent of the damage so far? Even before the storm reached Jamaica, powerful winds brought down power lines in Saint Elizabeth parish on the south-west of the island. The most vulnerable areas were communities in Jamaica’s mountains and hills, where winds were expected to reach speeds up to 30% greater than on lower ground. With seven deaths already reported across the Caribbean, including three in Jamaica, the Kingston authorities did not confirm any official toll overnight. But, Natricia said, “the bottom line is that the country is facing a very tragic and difficult situation, especially in the Saint Elizabeth area. I’ve been trying to reach people there and it hasn’t been possible. They really, really need help.” In total, the International Federation of Red Cross and Red Crescent Societies (IFRC) estimated that about 1.5 million people could be affected in Jamaica alone, a number that an IFRC official said was a potential underestimate. The Jamaican authorities said they expected about 50,000 people to be displaced. It is hoped that airports can be reopened on Thursday to allow the delivery of emergency supplies. Minister of local government Desmond Mckenzie said that St Elizabeth was “under water” and that the damage there was extensive. He also warned of severe conditions in Clarendon parish on the southern coast, and said some families were trapped in their homes with rescue not yet possible. About 15,000 people are in shelters, and more than half a million are without electricity. The storm also damaged four hospitals and left one without power, forcing officials to evacuate 75 patients. How well prepared is Jamaica for this kind of storm? Holness said there are 850 shelters across the island, enough for more than 20,000 people. And 50 generators are available to help secure clean water supplies. But officials have warned some shelters are overcrowded, with others in safer areas less full, and said that “every drop will count” to maintain access to water. Many of the shelters are school buildings that were not designed as evacuation centres, and there are reports that some residents arrived to find them closed. Natricia spoke to some people living in Port Royal, one severely affected area, who were reluctant to evacuate. “Even though it’s unprecedented, some are wary of shelters, maybe they’ve had stuff stolen or felt unsafe in the past,” she said. “Even among people who aren’t moving there’s an element of fear, of not wanting to let go of the familiarity of their homes.” While there are building codes in place that seek to mandate safer construction, there is a large informal building sector in Jamaica where such codes are unlikely to be followed. “You have people building homes by putting together what they can find - maybe they’re making a roof out of zinc sheeting,” Natricia said. “When I think about how much of that there is in Jamaica, I worry that 900 shelters doesn’t seem to be enough for the potential need.” Meanwhile, in Haiti, which has also been hit by the storm, the World Food Program (WFP) said it had only been able to make about 15% of the food it would normally provide available. It blamed a drop in contributions from donor countries now focused on Gaza and Ukraine. Cuba’s president, Miguel Díaz-Canel, denied claims that an ongoing economic crisis had limited his government’s ability to act. In Jamaica, there was a sense that once as much as possible had been done, the only option was to wait. Holness said: “There is no infrastructure in the region [of the Caribbean] that can withstand a category 5. The question now is the speed of recovery.” What are the key factors in the recovery operation? Much of the work for the aftermath is already under way. Many shelters are designated as distribution hubs for aid once the storm passes, while supplies such as food rations and medical supplies have been pre-positioned by the Red Cross and WFP. There are so-called strike teams ready to reconnect hospitals and water plants to the grid as quickly as possible, and aid agencies such as the WFP have mapped air and sea corridors to deliver further supplies. Cholera-prevention and water-purification kits have been placed in regional hospitals, and Jamaica has triggered the Caribbean Catastrophe Risk Insurance Facility to ensure emergency funds. While all those measures will be important, there is also a clear sense of practical limits on what can be prepared in advance, Natricia said. “I interviewed a minister who said ‘How do you prepare for a category five? What do you do when it’s that severe?’ I really feel for Caribbean governments because it is a very hard thing to find an answer to. The infrastructure you built is gone and you still owe for it and it plays out again and again.” Is the hurricane related to the climate crisis? In short: yes. As Oliver Milman writes in this piece, there is a likely link between the speed at which Melissa grew into a category 5 hurricane and the rapid heating of the world’s oceans. The director of the Meteorological Service of Jamaica, Evan Thompson, said that the rapid strengthening of the storm was due to excessively high water temperatures: storms draw energy from warm water, and the exceptional conditions probably make Melissa more powerful than it would otherwise have been. Shel Winkley, a meteorologist at the science nonprofit Climate Central, told NPR that hot ocean temperatures were made 500 to 700 times more likely by the climate crisis. With two storms in quick succession, people may now be more aware that similar disasters in the future are more likely, Natricia said. “People may start to rethink how they live. But it’s also a fact that not everybody has the luxury of making those choices. We know the stark reality in the Caribbean now is that we can have a day’s notice that some monster is going to come that humans can’t really match.” What else we’ve been reading - Don McCullin (above) is 90, and sceptical of the value of his photographs. “I feel as if I’ve been over-rewarded, and I definitely feel uncomfortable about that, because it’s been at the expense of other people’s lives,” he tells Emine Saner. “It’s done absolutely no good at all.” You may have more faith in his work as an act of witness; in any case, the images are extraordinary. Archie - Campaigner Kwajo Tweneboa’s piece on where Awaab’s law, which came into force on Monday, will fall short is a really important read in a time where we don’t talk about housing rights enough. Poppy Noor, deputy newsletters editor - Hello! I am a woman who loves using exclamation points! Largely to soothe, make you think I am joking, or easy-going, or just to let you know that whatever I just asked of you, no worries if not!! So I very much enjoyed today’s pass notes on women’s excessive exclamation mark use. Poppy - As Marina Hyde suggests, the hardest question about Sarah Pochin’s crusade against diversity in advertising is ... genuinely, who cares? “I’ve tried to be driven mad by this, but it’s incredibly hard to get that invested in the commercial future of big sofa,” she writes. “Maybe that makes me an enemy of growth.” Archie - This piece interviewing some very big actors who have been besieged by stage fright gave me a whole new understanding of how the famous cope (or don’t cope) with fear – plus a new phrase: “Doing a Stephen Fry”. Poppy Sport Football | England ran out comfortable 3-0 victors over Australia in their friendly, with goals from Aggie Beever‑Jones, Lucy Bronze and Georgia Stanway. But a bad knee injury to Michelle Agyemang deflated the party atmosphere. Cricket | In their second one-day international, England had reduced New Zealand to 173-5 a few minutes ago after 33 overs. Follow it live here. Tennis | Cameron Norrie produced the greatest win of his career as he recovered from a set down to topple the world No 1 Carlos Alcaraz 4-6, 6-3, 6-4 in the second round of the Paris Masters. Although he has defeated Alcaraz on two previous occasions, Norrie’s triumph marks his first ever victory over a reigning No 1. The front pages “Reeves vows to defy gloom after £20bn budget blow” – the chancellor shows a brave face in the Guardian, while the Express demands on behalf of its readership that “OAPs must be given a ‘fair deal’ in budget”. “Councils told to end four-day weeks” – that’s the Telegraph. The Times runs with “Labour to miss 1.5m homes target, housebuilders warn”. The i paper splashes on “Storm of the century: 185mph hurricane bigger than Katrina” while the Metro calls Melissa “Pure fury” and the Mirror has “Hell at 185mph”. The Mail has “Afghan held over murder of dog walker came to the UK in a lorry”. Top story in Wednesday’s Financial Times is “Microsoft tops $4tn valuation after OpenAI restructuring”. Today in Focus The comeback of the mountain gorilla Patrick Greenfield hikes up the Virunga mountains in east Africa to trace the remarkable comeback of the mountain gorilla Cartoon of the day | Ella Baron The Upside A bit of good news to remind you that the world’s not all bad Annabel Lee (pictured above) spent her school days dodging cardio at all costs (hands up, anyone else who regularly volunteered to be goalkeeper). When she did exercise, it was all about burning calories – thanks to 90s diet culture for that. But then she tried a 2km junior parkrun with her five-year-old daughter. “Running alongside her, I was amazed at her attitude and ability,” says Lee for this week’s The one change that worked. “She did not complain. She did not try to bunk out early. She appeared to be genuinely enjoying herself. Afterwards … my daughter told me she had loved the run – and to my surprise, so had I.” Lee is now training for a marathon and junior parkruns have become a regular occurrence. “I’ve stopped focusing on how ‘good’ or ‘bad’ my runs are … Instead I follow my daughter’s lead and relish the moment, grateful that my body is able to propel me around the track alongside her.” Sign up here for a weekly roundup of The Upside, sent to you every Sunday Bored at work? And finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T091500Z",
    "date_download": "2025-10-29T11:07:48.795275+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/2025/oct/29/wednesday-briefing-catastrophic-reports-as-jamaica-reels-from-worst-storm-since-records-began",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "644fbe134c7cd58bd32223bfa9942120",
    "processed_at": "2025-10-29T12:10:03.381854",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses Hurricane Melissa and its impact on Jamaica, focusing on the storm's effects, recovery efforts, and related humanitarian issues. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://edition.cnn.com/2025/10/29/politics/fema-investigation-trump-dhs-probe-noem",
    "title": "An investigation into FEMA didnt fit Trump narrative . His DHS ordered a new probe that did",
    "text": "In the final month of the 2024 presidential campaign, Donald Trump put his critique of FEMA’s response to Hurricane Helene front and center, making false claims that funding was stolen for illegal migrants and the agency ignored requests for help. One particular claim had legs – that Republican residents were not getting the aid they needed because of their political affiliation. An investigation that began under then-President Joe Biden and carried over into the Trump administration ultimately cleared the Federal Emergency Management Agency, finding no evidence of a systemic effort to deny aid based on politics while singling out one supervisor’s actions as illegal and improper. But at the Department of Homeland Security, which oversees FEMA, leadership including Secretary Kristi Noem weren’t satisfied, three former senior FEMA officials told CNN. Within weeks, leaders ordered a new investigation that came to a much different conclusion. Noem announced last week that the DHS probe found “for years, FEMA employees under the Biden Administration intentionally delayed much-needed aid to Americans suffering from natural disasters on purely political grounds.” She called it “textbook political discrimination” against Trump supporters. The investigation looked at whether FEMA workers who went door-to-door in disaster zones recorded any protected private information about survivors’ political views. It found roughly 100 field reports — a small fraction out of tens of thousands of cases during the Biden administration — where FEMA workers visiting homes mentioned campaign signs or made notes related to “political beliefs.” Investigators flagged a few instances where canvasser notes mentioned “Trump” or “Biden,” but in most cases, workers were documenting gun signage, which also was categorized as political. The report does not show that disaster survivors were denied aid because of these notations, and sources say the gun notations were often made for safety reasons. Yet Noem portrayed the findings as proof of FEMA’s “widespread” and “systematic” bias and said she would refer the issue to the Justice Department for potential prosecution — her latest public attack on an agency she argues needs sweeping reforms or even abolition. Behind the scenes, insiders accuse DHS and Noem of stoking rumors and misinformation to help justify tearing FEMA down, as some argue it’s the Trump administration using disaster aid as a political weapon. “They’ve been looking to prove that narrative any way they can, and to me, this is just a fabricated way of advancing it when really it’s not factually there,” said one of several FEMA officials who asked not to be named for fear of retribution. “If we do something wrong, okay, hold us accountable,” the official added. “But don’t fabricate it because it meets your political narrative. That’s just bad government.” Two hurricanes and a political firestorm The political firestorm began last September after Hurricane Helene devastated western North Carolina. Then-candidate Trump accused FEMA and the Biden administration of ignoring Republican areas and spending all its disaster aid on undocumented immigrants. FEMA workers soon faced threats and hostility in disaster zones, and some teams were pulled from areas for safety. Weeks later, Hurricane Milton hit the Florida coast. FEMA teams, now stretched thin up and down the coast, reported widespread harassment fueled by Trump’s claims. In late October, FEMA field supervisor Marn’i Washington delivered a now infamous directive to her 11 staffers deployed in Florida: “Avoid homes advertising Trump.” Washington told CNN at the time that her supervisors had issued the orders, citing concerns about abuse from Trump supporters. However, the investigation later determined that no such directive was given; it was Washington’s own interpretation of how to protect her team. FEMA leadership working under the Biden administration fired Washington and denounced her actions, deploying staff to the homes that may have been skipped. Then-FEMA administrator Deanne Criswell was called before Congress, where she condemned the directive as illegal and unacceptable, and said she’d already referred the case for further investigation. “I stand by the testimony I provided to Congress under oath. When the initial incident came to light, I immediately took decisive action and addressed the situation,” Criswell told CNN in a statement last week. “I remain confident that we responded appropriately to the information we had.” Still, Florida’s attorney general filed a lawsuit alleging civil rights violations against FEMA and Criswell. To some, Washington’s actions were proof that Trump was right: FEMA is biased against Republicans. An investigation clears FEMA Over the next four months, FEMA’s Office of Professional Responsibility, Homeland Security’s Office of the Inspector General and the Office of Special Counsel investigated the incident and broader agency culture – a probe that carried into Trump’s term. Days after his inauguration, Trump visited western North Carolina and floated the idea of eliminating FEMA. In March, Trump’s acting FEMA administrator, Cameron Hamilton, told lawmakers that three additional staffers had been fired in connection with the Washington incident, primarily for poor supervision or misleading investigators, two sources told CNN. But Hamilton’s letter to Congress said investigators found “no evidence that this was a systemic problem, nor that it was directed by agency or field leadership.” In fact, they found the opposite: that politics rarely came up in disaster zones. “Tens of thousands of records were screened and reviewed. We found there was no reasonable evidence to authenticate a statement that denial of aid or assistance occurred based upon political bias from FEMA leadership,” Hamilton told CNN this week. “These isolated incidents were awful and a breach of public trust, however I did not see evidence that they were systemic across the agency. I say this as a lifelong Republican and supporter of President Trump.” The probe formally cleared Criswell and FEMA in April, and Florida settled its lawsuit with no damages paid. At the time, agency leaders believed the case was closed and perhaps the findings would ease the anti-FEMA rhetoric from Trump and Noem. They were wrong. A second look at FEMA wrongdoing Roman Jankowski, the newly appointed head of DHS’s Privacy Office and an alum of the Heritage Foundation, launched a separate review weeks after the internal probe concluded and requested the data investigators had relied on, multiple sources said. Jankowski took a different approach, focusing on whether FEMA aid workers violated privacy laws by recording protected information — such as political beliefs — and whether that information could have been used to withhold disaster aid for political reasons. His review went beyond the initial investigation, which focused solely on the 2024 hurricane season, and examined data from the entirety of Biden’s four years in office. “He definitely made it clear that he suspected FEMA was involved in broad-scale wrongdoing,” said a senior FEMA official who spoke directly to Jankowski about the review. “You could tell he had already arrived at a conclusion that FEMA as an agency needed to be severely punished, which was evident in his tone and language.” Jankowski’s team released its report last week. The 22-page report concludes FEMA canvassers going door-to-door repeatedly violated – or may have violated – privacy laws by collecting information on survivors’ political beliefs, and in a handful of cases, bypassed certain homes based on the details they noted. But more than a dozen current and former FEMA officials argue that the evidence does not support claims of a systemic problem. They point out canvassers referenced Trump just 15 times in their reports, and it remains unclear whether workers never returned to those homes. “I’m not a statistician, but when you’re looking at four years of data across tens of thousands of damaged homes, it doesn’t seem significant,” former FEMA chief of staff Michael Coen, who served under the Biden and Obama administrations, told CNN. “It doesn’t demonstrate that people were discriminated against in a systematic way.” FEMA officials say these freeform notes are primarily used to alert colleagues about field conditions, especially for safety, and were not surprised that most of the so-called “partisan” notes referenced gun signage. After Hurricane Helene, those safety worries reached a fever pitch. Trump’s relentless attacks on FEMA had sparked a wave of threats against the teams trying to help survivors in North Carolina, leaving workers on edge. “We were hearing that guys in trucks with guns were out looking for FEMA employees, and the teams were freaked out,” a former senior official deployed to North Carolina said. “Let’s have common sense. FEMA employees are not law enforcement officers. They’re not walking around with bulletproof vests. This idea that they’re just going to run into harm’s way to register somebody is ridiculous.” The report points to a few specific entries from canvassers who allegedly skipped homes, such as: “Survivor very anti govt anti Biden. Told me to tell Biden to go [f***] himself” and “…a lot of explicit political flags, posters, etc. ‘F*** Joe Biden’ ‘MAGA 2024’ ‘Joe Biden Sucks’ ‘Trump 2024.’ We do not recommend anyone visiting this location.” DHS raised concerns that such notes likely led FEMA teams not to return to the homes. But Noem has been more definitive in her claims about what the investigation found, saying the probe found “FEMA employees systematically refused to visit the houses of disaster survivors that displayed signs and flags they disagreed with, including those with campaign signs supporting President Trump.” Trump’s FEMA ended door-to-door canvassing earlier this year, largely because of safety concerns and the fact that most survivors now apply for FEMA assistance online or through call centers, not through canvassers. Several current and former senior FEMA officials acknowledged that some canvassers may have violated privacy laws and agreed that reviewing those cases would be appropriate. However, they cautioned that using this as evidence of an agencywide systemic effort to deny aid based on politics is unfounded. “Whether or not there was bias in note taking, that’s a highly subjective analysis, but we didn’t find it to be sufficient to conclude wide-spread impact,” Hamilton said this week of the first internal investigation. The next phase of Trump’s war on FEMA As Noem paints the agency as partisan and inept, the new FEMA Review Council is set to present recommendations for reforms in the coming weeks. Trump has vowed to start phasing out FEMA after hurricane season, though he hasn’t detailed what that will entail. From the outset, Noem positioned herself as Trump’s point person to fulfill his promise to dismantle FEMA. She now says the goal is to eliminate FEMA “as it exists today,” and she’s made clear that “cleaning house” and asserting control are central to that process. “She’s trying to drive this narrative of how woke, terrible and unaccountable FEMA is, which is why they need to abolish it,” one former top official said. Meanwhile, current and former FEMA officials say her attacks continue to erode public trust in the agency responsible for helping disaster survivors in their most vulnerable moments. “It’s dangerous,” said Coen, the former FEMA chief of staff. “The faith in FEMA has declined. When people lose their trust in the federal government in a time of need, they’re going to feel more helpless.” Some FEMA officials note the irony of these accusations, as Trump himself faces criticism for politicizing disaster aid — repeatedly posting on Truth Social about sending millions to states that supported him. Last week, Trump announced $2.5 million for Missouri after speaking with its Republican governor, despite FEMA recommending denial because the damage was below the agency’s threshold for federal aid to be distributed. “That request was dead and buried in our minds,” a senior FEMA official involved in the process told CNN. “Our damage assessments didn’t seem to indicate the recovery was beyond the State’s capacity. And believe me, we’re generally eager to help our state partners when it’s warranted.” The Trump administration had previously fast-tracked FEMA money to Missouri while emergency funds for other states remained frozen. In contrast, Democratic-led states like Maryland and Washington have been denied disaster aid by the president, even when their damage far exceeded FEMA’s threshold and approval was recommended. Noem has ramped up her rhetoric in recent months. Last month, she issued a press release announcing the firing of a FEMA staffer and an agency contractor for viewing sexually explicit content on government devices. “We are cleaning house at FEMA to make this dysfunctional agency work for the American people the way that it was intended,” she wrote at the time. Since pledging to dismantle FEMA at the start of the administration, DHS leaders have subjected staff to polygraph tests, publicly fired employees, and placed dozens on administrative leave without warning or explanation. More than a quarter of FEMA’s full-time workforce has left through layoffs and buyouts, including dozens of senior leaders. Behind the scenes, DHS has consolidated power at FEMA, filling leadership roles with political appointees and pushing out career experts who helped shape disaster response and recovery.",
    "domain": "edition.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T103000Z",
    "date_download": "2025-10-29T11:07:51.687438+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "edition.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://edition.cnn.com/2025/10/29/politics/fema-investigation-trump-dhs-probe-noem",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "f7bfbd7daccabeb1f428f490eaac7d0f",
    "processed_at": "2025-10-29T12:10:03.382440",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political issues surrounding FEMA and its response to disasters, particularly in relation to Donald Trump's administration. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.npr.org/2025/10/29/nx-s1-5585292/word-of-week-neurodivergent",
    "title": "How  neurodivergent  became a word for many types of minds",
    "text": "How 'neurodivergent' became a word for many types of minds Our minds work in different ways. Despite all the research into our brains, a lot has yet to be discovered. But in recent years, many people have championed a way to describe some of what we do know. And that way is through the term \"neurodivergent,\" which took off on Google trends amid widespread coronavirus lockdowns in June 2020. Since the pandemic, \"neurodivergent\" has made waves online, in the media and in academic studies to help talk about neurological differences more inclusively. The term really got its start back in the late 1990s, and was added to the Merriam-Webster dictionary in 2002. In 2019, the Oxford English Dictionary added it as well.. So for the latest \"Word of the Week,\" we're talking about being \"neurodivergent.\" What does neurodivergent mean? Neurodivergent is an umbrella term that describes people whose way of processing information is different from what society considers normal, according to Nick Walker, a psychology professor at the California Institute of Integral Studies. \"Brains differ from each other in the way fingerprints do. 'Neurodivergence' establishes this idea that within the spectrum of neurodiversity, there are dominant norms and divergences from those dominant norms,\" he said. There is a widespread belief that \"neurodivergent\" is a medical term, limited to diagnoses such as autism or attention-deficit/hyperactivity disorder. \"It super is not,\" said neurodivergence activist Kassiane Asasumasu, who is credited with coming up with the word. And there are different ways people become neurodivergent, said Walker. Some are born that way. Others develop neurodivergences because of things like traumatic head injuries or long COVID. And intentional neurodivergence can happen, for example, in people who meditate frequently or use psychedelics, Walker said. Where the word comes from In the late '90s, Asasumasu was a high school student, active on online forums for people with autism. \"Neurodiversity\" had been coined a few years earlier by autistic civil rights activists. People often confuse neurodivergence and neurodiversity, but there is an important difference, Walker said. \"The spectrum of human neurodiversity includes everybody ever, including people who are within the dominant norms,\" he said. \"With neurodivergence, you diverge from something. You differ in some way from some socially constructed norm.\" But \"neurodiversity\" began being used as a synonym for autism, and everyone else was deemed neurotypical. Asasumasu said while \"neurodiversity\" was progressive, it wasn't enough. \"You've got typical, and what's the opposite of typical?\" she said. She began using neurodivergent first online, where she had the term in her AOL signature, and it became especially popular within online communities for autistic people. Then it spread to her school, where her peers were using it in face-to-face conversations. Asasumasu, now a board member for the nonprofit Foundations for Divergent Minds, said she felt the need for a more general term. For one, some people have multiple neurodivergences. The term \"neurodivergence\" offers people who have them a way to express their differences without revealing their medical history or other private details, she said. It's also a way for people with neurodivergences to band together and leverage social and political power. \"It's just good to have solidarity across disability,\" Asasumasu said. How it became popular \"Neurodivergent\" gained widespread traction within the neurodivergent community in the 2010s, said Morénike Giwa Onaiwu, a researcher on neurodivergence and founder of the nonprofit Advocacy Without Borders. Walker remembers being taken aback when around 2010 or 2011, a student of his said they were neurodivergent while introducing themselves to the class. \"That was the moment where I was like, 'Oh, this is taking off somehow,'\" he said. Then in 2020, the coronavirus pandemic helped thrust the term into news articles and casual conversation. Isolation and the onset of remote work led to public discussions about accessibility accommodations and mental health, Onaiwu said. \"These were a lot of the accommodations that [neurodivergent people] had been begging for, and advocating for, that we were always told were not possible,\" she said. \"But when the rest of the world needed it, it was something that was possible.\" However, Asasumasu said the word has started to become less inclusive as it becomes more popular. Like \"neurodiversity\" in the '90s, people tend to now use \"neurodivergent\" as a synonym for autism, leaving out divergences like depression, Alzheimer's, bipolar disorder, and more. \"It is a very, very large tent,\" she said. \"However big you think it is, it is bigger than that.\" In other ways, \"neurodivergent\" continues to expand. \"Neurospicy\" has emerged as a synonym, which Onaiwu said she first saw being used by people of color drawing inspiration from their various cultural cuisines. \"Neurodivergent\" is also becoming popular in other English-speaking countries, such as the United Kingdom and Australia, Walker said. Onaiwu said her academic works have been translated into other languages, but notes that what is considered neurodivergent in some places may not be the same in others. For example, avoiding eye contact can be common in some places, and therefore might not be seen as a sign of neurodivergence as it could in the U.S. Some cultures may be more accepting and don't feel the need to label neurodivergences, while they may be heavily stigmatized in others. As people continue to learn about the experiences of those with neurodivergences, Onaiwu encourages them to stay grounded in shared humanity. \"They matter just by virtue of being human,\" she said.",
    "domain": "npr.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T101500Z",
    "date_download": "2025-10-29T11:07:54.701702+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "npr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.npr.org/2025/10/29/nx-s1-5585292/word-of-week-neurodivergent",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "aacea19392f8d01fcf8c097c048c4d5c",
    "processed_at": "2025-10-29T12:10:03.382521",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the concept of neurodivergence and its social implications, without any mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.npr.org/2025/10/29/nx-s1-5588623/chain-restaurant-family-dinner-culture",
    "title": "Love or hate chain resta ? We want to hear from you : NPR",
    "text": "Love or hate chain restaurants? We want to hear your story Chain restaurants (think Red Lobster, Chili's, Cracker Barrel, etc.) can be found across the country, serving up familiar fare and comforting memories to millions. Even amid high food prices and increasingly stiff competition, these restaurants endure. NPR is exploring why and how — and what keeps people coming back. For many, these cozy, recognizable spaces are where some of life's most memorable moments unfold. Does this sound like you? We want to hear your stories. What role have chain restaurants played in your life? Do they hold a special place in your heart — or a spot on your personal do-not-return list? NPR reporters are hitting the road to examine the role chain restaurants play in American culture. Your stories may help shape our reporting — and we may even reach out to meet up with a few of you along the way. Please note: Your submission will be governed by our general Terms of Use and Privacy Policy. As the Privacy Policy says, we want you to be aware that there may be circumstances in which the exemptions provided under law for journalistic activities or freedom of expression may override privacy rights you might otherwise have.",
    "domain": "npr.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T101500Z",
    "date_download": "2025-10-29T11:07:55.118975+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "npr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.npr.org/2025/10/29/nx-s1-5588623/chain-restaurant-family-dinner-culture",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "441ac5738d948a9148489697b380b0f0",
    "processed_at": "2025-10-29T12:10:03.382566",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses chain restaurants and their cultural significance, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://knpr.org/npr/2025-10-29/families-could-start-losing-access-to-head-start-if-shutdown-continues",
    "title": "Families could start losing access to Head Start if shutdown continues",
    "text": "Beginning Nov. 1, more than 65,000 children will be at risk of losing access to Head Start, the federal early-learning program for low-income families. That's because federal funding for individual Head Start programs cannot be disbursed while the government is shut down. The leaders of 134 local Head Start programs, as well as another half-dozen whose funding lapsed on Oct. 1, are now debating how long they can go before closing their doors, says Tommy Sheridan of the National Head Start Association. \"They are scrambling,\" Sheridan says. \"There is a ton of hard work, a ton of goodwill, a ton of dedication – but hard work, goodwill and dedication don't keep your doors open, unfortunately.\" Among the states hit hardest by this Nov. 1 deadline: Florida, Georgia, Missouri and Ohio. Nationally, Head Start serves roughly 750,000 infants, toddlers and preschool-age children, providing not just childcare and early learning but also free meals, health screenings and family support. Local Head Start programs are funded annually, though at different times of the year. Some programs get their money on Oct. 1, others on Nov. 1 and so on. As such, Sheridan says, if the shutdown lasts until December, still more programs would see their funding run out. Without federal funding, Sheridan says, some programs will have to close immediately. Others have the resources to stay open at least another week, in hopes that politicians in Washington can resolve their differences. Head Start closures could hit Florida's migrant farm workers Daniel Jaime manages six Head Start centers across three Florida counties as part of the East Coast Migrant Head Start Project – a nonprofit that serves the children of migrant and seasonal farmworkers. \"It's a pretty hard deadline,\" Jaime says of Nov. 1, when his centers will have to close unless their funding is somehow extended. \"We're all hoping for a miracle that things change.\" Jaime was born in Florida and attended Head Start as the child of a farmworker. He later sent his own children to Head Start as a farmworker himself. Right now, he says, fall peppers and cucumbers need picking, with tomatoes due next month and strawberries soon after. If he can't provide Head Start care to the children of the workers that growers rely on to harvest these crops, he worries, markets and ultimately consumers could feel the blow. In the short term, Jaime also worries that some workers may have no choice but to leave their children in less-than-ideal settings to keep working – like with an adult in the community who's informally looking after many of the children who would otherwise be in Head Start. \"That's a big thing for me right now, is knowing that we have our babies out there, and we can't serve them,\" he says. How some centers will manage to stay open While some programs may be forced to close after Friday, others have cobbled together plans to stay open at least a little longer. \"We have determined that we can continue services through Nov. 14,\" says Corey Holcomb, who runs a Head Start program serving more than 250 children across Michigan's Upper Peninsula. \"After that, if the shutdown is still going on, we would have to close.\" Holcomb says she has been exploring funding options since the beginning of October. That includes weighing taking out a loan, something her agency and board of directors decided was \"not a viable option.\" Her plan now is to lean on reserve funds while also temporarily cutting expenses. \"We've asked for deferments on rent payments and some utility bills,\" Holcomb says. The programs that may be best positioned to stay open, even without federal funding, are in the roughly 14 states that also provide state dollars to support Head Start, including Oregon. \"I have hope,\" says Suey Linzmeier, executive director of Head Start of Yamhill County in northern Oregon. Her program serves 314 children or, as she puts it: \"314 more opportunities to change a life for the better.\" While many Head Start programs receive little state financial support, Linzmeier says roughly 60% of her program's funding comes from Oregon. Without those dollars, she would likely have to close their doors on Nov. 1. \"I don't even know what we would do\" she says. Head Start celebrated its 60th anniversary this year. And while it has enjoyed bipartisan support in the past, the Trump administration reportedly weighed cutting the program from its budget proposal and, earlier this year, temporarily withheld Head Start funding. Holcomb in Michigan says a staff member recently told her, \"If somebody in Congress could just come and spend one hour in our classroom and see the work that we're doing and how important it is…\" Her voice trails off. \"Our children need us.\" Copyright 2025 NPR",
    "domain": "knpr.org",
    "domain_category": "unknown",
    "language": "English",
    "date_publish": "20251029T100000Z",
    "date_download": "2025-10-29T11:07:55.617575+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "knpr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://knpr.org/npr/2025-10-29/families-could-start-losing-access-to-head-start-if-shutdown-continues",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "051c1ce8128fd8d12460fcb831fa42e2",
    "processed_at": "2025-10-29T12:10:03.382753",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the impact of a government shutdown on the Head Start program, focusing on funding issues and the implications for low-income families and children. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/south-korea-trade-deal-appears-elusive-trump-seeks-126954342",
    "title": "South Korea trade deal appears elusive as Trump seeks $350B investment",
    "text": "South Korea trade deal appears elusive as Trump seeks $350B investment After a charm offensive in Japan that culminated in $490 billion in investment commitments, President Donald Trump is set to meet with South Korea’s leader on Wednesday as a trade deal with that country appears more elusive GYEONGJU, South Korea -- After a charm offensive in Japan that culminated in $490 billion in investment commitments, President Donald Trump met with South Korea's leader on Wednesday as a trade deal with that country appears more elusive. Top officials in Washington and and Seoul say the sticking point for an agreement continues to be the logistics behind Trump’s demand that South Korea invest $350 billion in the United States. Korean officials say putting up cash could destabilize their own economy, and they’d rather offer loans and loan guarantees instead. The country would also need a swap line to manage the flow of its currency into the U.S. The disparity between what Trump is asking for and what South Korea can deliver threatens to overshadow the meeting between Trump and South Korean President Lee Jae Myung in Gyeongju, a historical city playing host to the annual Asia-Pacific Economic Cooperation summit. Trump said the two countries are “wedded,” praising their “very special relationship” during remarks at a business forum. He also said they're “very close” to a deal. Speaking broadly about international trade, Trump suggested a more conciliatory approach than his usual confrontational stance. “The best deals are deals that work for everybody,\" he said. Lee, speaking at the forum before Trump arrived, warned against trade barriers. “At a time when protectionism and nationalism are on the rise and nations focus on their immediate survival, words like ‘cooperation,’ ‘coexistence,’ and ‘inclusive growth’ may sound hollow,\" he said. \"Yet, paradoxically, it is in times of crisis like this that APEC’s role as a platform for solidarity shines brighter.” Oh Hyunjoo, a deputy national security director, told reporters that the negotiations have been proceeding “a little bit more slowly” than expected. “We haven’t yet been able to reach an agreement on matters such as the structure of investments, their formats and how the profits will be distributed,” she said Monday. It's a contrast from Trump's experience in Japan, where the government has worked to fulfill its commitment of $550 billion in investments as part of an earlier trade agreement. Commerce Secretary Howard Lutnick announced up to $490 billion in commitments during a dinner with business leaders in Tokyo. Trump bonded with Japan's new prime minister, Sanae Takaichi, on his trip Tuesday, taking her with him as he spoke to U.S. troops aboard an aircraft carrier and then unveiling several major energy and technology projects in America to be funded by Japan. In contrast, U.S. Treasury Secretary Scott Bessent, speaking to reporters aboard Air Force One on Monday, said a deal wasn't ready in South Korea. “Just a lot of details to work out,” he said, although he suggested they were close. For now, South Korea is stuck with a 25% tariff on automobiles, putting automakers such as Hyundai and Kia at a disadvantage against Japanese and European competitors, which face 15%. Lee took office in June and had a warm meeting with Trump at the White House in August, when he cranked up the flattery. He also showered Trump with gifts in Gyeongju, presenting him with a gold medal and crown. The medal represents the Grand Order of Mugunghwa, the country’s highest honor. Trump is the first U.S. president to receive it. Trump said “it’s as beautiful as it can possibly be” and “I’d like to wear it right now.” Next was a replica of a royal crown from the Silla Kingdom, which existed from 57 B.C. to 935 A.D. The original crown was found in a tomb in Gyeongju, the kingdom’s capital. But there's been points of tension since then, notably a U.S. immigration raid on a Hyundai plant in Georgia in September. More than 300 South Koreans were detained, sparking outrage and a sense of betrayal. Lee said companies would likely hesitate to make future investments unless the visa system was improved. “If that’s not possible, then establishing a local factory in the United States will either come with severe disadvantages or become very difficult for our companies,\" he said. \"They will wonder whether they should even do it.” South Korea’s Foreign Ministry said in early October that the U.S. had agreed to allow South Korean workers on short-term visas or a visa waiver program to help build industrial sites in America. Asked Monday about the immigration raid, Trump said, “I was opposed to getting them out,” and he said an improved visa system would make it easier for companies to bring in skilled workers. While in South Korea, Trump is also expected to hold a closely watched meeting on Thursday with Chinese leader Xi Jinping. Washington and Beijing have clashed over trade, but both sides have indicated that they're willing to dial down tensions. Trump told reporters aboard Air Force One on Wednesday that he expects to lower tariffs targeting China over the flow of fentanyl ingredients. “They’ll be doing what they can do,” he said. Trump added that “China is going to be working with me.” Trump sounded resigned to the idea that he wouldn't get to meet North Korean leader Kim Jong Un on this trip. The president previously floated the possibility of extending his stay in South Korea, but on Wednesday said “the schedule was very tight.” North Korea has so far dismissed overtures from Washington and Seoul, saying it won’t resume diplomacy with the United States unless Washington drops its demand for the North’s denuclearization. North Korea said Wednesday it fired sea-to-surface cruise missiles into its western waters, in the latest display of its growing military capabilities as Trump visits South Korea. Trump brushed off the weapons test, saying “he’s been launching missiles for decades, right?” The two leaders met during Trump's first term, although their conversations did not produce any agreements about North Korea's nuclear program. ___ Associated Press writers Kim Tong-hyung and Hyung-jin Kim contributed from Seoul, South Korea, and Josh Boak contributed from Tokyo.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T091500Z",
    "date_download": "2025-10-29T11:08:01.120927+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/south-korea-trade-deal-appears-elusive-trump-seeks-126954342",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "90958ec9be777a2a37796564011ce8c9",
    "processed_at": "2025-10-29T12:10:03.382843",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a trade deal between the U.S. and South Korea, focusing on investment commitments and economic relations, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/singapore-faces-pressure-reveal-carbon-tax-concessions-oil-126964450",
    "title": "Singapore faces pressure to reveal carbon tax concessions to oil giants",
    "text": "Singapore faces pressure to reveal carbon tax concessions to oil giants Environmentalists fear carbon tax concessions to global oil giants may undermine efforts to shift to cleaner energy SINGAPORE, Singapore -- Carbon tax concessions granted to global oil giants may undermine incentives to shift to cleaner energy, environmentalists fear. So conservation groups in Singapore are seeking more transparency over what discounts the city-state of 6 million giving polluters for taxes on their climate-changing emissions. Singapore is the only Southeast Asian country to have imposed a carbon tax so far. Most of the European Union, California, South Korea and Japan also do so. Indonesia, Malaysia and Thailand are preparing to implement similar taxes next year and Vietnam and Brunei are considering the idea. The groups are pressing the Singaporean government to disclose more information about “allowances” Singapore’s National Climate Change Secretariat (NCCS) has awarded to certain companies. The government says the tax breaks are “not a free pass\" for corporations to continue emitting. But it has balked at providing details or even full data about the impact of the carbon tax. Singapore accounts for only 0.1% of global carbon emissions, but its emissions per person were 27th highest out of 142 countries, said Vinod Thomas, a senior fellow at the ISEAS-Yusof Ishak Institute, a Singapore-based think tank. “Singapore is being watched and is being seen as a leader,” Thomas said, adding that \"it matters to a great extent what others will do. If one country alone reduces emissions, that's great. But the atmosphere only cares about the total, so it is critical the rest of Southeast Asia also plays its part.\" Implemented in 2019, the carbon tax was set to increase every few years to allow emissions-intensive, trade-exposed companies time to invest in cleaner technologies. But the island nation has granted closed-door concessions to certain businesses. The NCCS says the deals are private because corporations raised valid concerns about how information on allowances could be used to compromise their business strategies and operations. Only facilities with credible plans for ending their net carbon emissions have been granted partial concessions, it said. The policy partly is meant to prevent carbon leakage, a term for when companies move to countries with less stringent climate regulations. While the tax covers around 70% of Singapore’s emissions, the NCCS has not disclosed the exact amount of emissions reductions brought on by the carbon tax. It says it is “difficult to isolate the exact amount of emissions reductions” and that more information will be provided “in due course.” Local climate groups issued a joint letter in September demanding more information about the scale and scope of the tax breaks, contending that “transparency is not incompatible with competitiveness.” “We can’t even come to a conclusion about whether the carbon tax is effective because we don’t have the data,” said Rachel Cheang, co-founder of Energy CoLab, a youth-led local climate group. “Any conversation with the government is just not on equal ground.” The city-state’s carbon tax started at 5 Singapore dollars ($3.7) per ton of emissions. It has risen gradually, to 25 Singapore dollars ($19) per metric ton last year, and will be 45 Singapore dollars ($34.70) in 2026. By the end of this decade, it’s expected to be 50-80 Singapore dollars (about $40-$60) per metric ton. The carbon tax burden falls most heavily on global energy companies — like ExxonMobil, which operates Singapore’s largest refining facility on Jurong Island; Shell, which runs the country’s oldest refinery on Pulau Bukom and Chevron, which has a 50% interest in the Singapore Refining Co. ExxonMobil and Chevron did not respond to requests for comment. Shell said “We won’t be commenting.” There is no publicly available data on the amount of carbon released by high-emitting companies in Singapore. Such information “would help the public hold them accountable for their emissions,” said Ho Xiang Tian, co-founder of the local environmental group LepakInSG. Ordinary Singaporeans have a stake in this since the tax may be passed on in the form of higher utility rates. LepakInSG calculates a set carbon tax of 50 Singapore dollars would increase the household utility bill for a 4-room, government-subsidized apartment by 8 Singapore dollars ($6.20) a month. That's probably tolerable for most families and may encourage people to conserve electricity, said Ho, but “We have also called for the government to ensure protection for the more vulnerable groups, to ensure it will not disproportionately impact them.” The push for a more transparent policy coincides with the derailing this month by U.S. President Donald Trump of a months-long international effort to set up the first global tax on shipping emissions. Trump vehemently opposes charging such fees. Progress toward expanding carbon taxes will face obstacles as long as the U.S. — the world’s second largest emitter after China — stays committed to fossil fuels, said Shi-Ling Hsu, a professor at Florida State University’s College of Law and author of “The Case for a Carbon Tax: Getting Past Our Hang-ups to Effective Climate Policy.” “There’s going to be a big block on global carbon taxes as long as Trump is in office,\" Hsu said. For Cheang and others in Singapore, that adds to the urgency of providing more transparency over how its carbon tax works. “We have a huge responsibility, in that sense, to uphold a certain amount of integrity in the way that we are designing and implementing our policies,” she said. ___ The Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T091500Z",
    "date_download": "2025-10-29T11:08:01.370014+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/singapore-faces-pressure-reveal-carbon-tax-concessions-oil-126964450",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "90e5433b60c097ca3e2c0664cabe83bc",
    "processed_at": "2025-10-29T12:10:03.382920",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses carbon tax concessions in Singapore and their implications for environmental policy, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/amnesty-us-strike-yemen-prison-killed-dozens-african-126960513",
    "title": "Amnesty says US strike on a Yemen prison that killed dozens of African migrants may be a war crime",
    "text": "Amnesty says US strike on a Yemen prison that killed dozens of African migrants may be a war crime Amnesty International says a U.S. airstrike in April that killed 60 detained African migrants should be investigated as a possible war crime DUBAI, United Arab Emirates -- An American airstrike in April on a prison run by Yemen's Houthi rebels that killed over 60 detained African migrants should be investigated as a possible war crime, activists said Wednesday. The call by Amnesty International renews scrutiny on the April 28 strike in Yemen's Saada province. The attack came as part of an intense campaign of airstrikes waged under U.S. President Donald Trump targeting rebels for disrupting shipping through the Red Sea corridor amid the Israel-Hamas war. The U.S. military's Central Command has yet to offer any explanation for the strike on the prison, which previously had been hit by a Saudi-led coalition also fighting against the Houthis and had been known to hold detained African migrants trying to reach Saudi Arabia through the war zone. “We take all reports of civilian harm seriously and are working to release the assessment results for Operation Rough Rider soon,\" said U.S. Navy Capt. Tim Hawkins, a spokesperson for Central Command. After the strike, the Houthis displayed debris likely from two, 250-pound precision-guided GBU-39 small-diameter bombs used by the U.S. military, Amnesty said. Survivors interviewed by Amnesty, all Ethiopian migrants detained while trying to reach Saudi Arabia, told the rights group that they saw no Houthi fighters posted inside the building. Amnesty said the strike appeared to be an “indiscriminate attack” as it assessed there was no clear military objective. International law prohibits striking sites like hospitals and prisons unless the structures are being used to plan attacks or stockpile weapons — and even then, every precaution should be made to avoid hurting civilians. Amnesty said the Houthis recently put the death toll in the strike at 61, lower than the 68 it initially reported. Gunfire could be heard in footage filmed after the airstrikes, with the Houthis saying their guards fired warning shots around the time of the strikes. The April strike recalled a similar strike by a Saudi-led coalition battling the Houthis in 2022 on the same compound, which caused a collapse killing 66 detainees and wounding 113 others, a United Nations report later said. The Houthis shot dead 16 detainees who fled after the strike and wounded another 50, the U.N. said. The Houthis denied any misconduct in the April strike, but Amnesty noted the rebels' “ongoing crackdown on ... activists, journalists, human rights defenders and humanitarian workers” limited its ability to investigate. The Houthis hold at least 59 United Nations staffers and more aid group workers, with the rebels seizing electronics at U.N. offices in recent days. The Iranian-backed rebels, under economic pressure, also increasingly have been threatening Saudi Arabia in recent weeks as well. “I didn’t actually believe that it was possible that the U.S. would carry out an airstrike on the same compound, resulting in a significant level of civilian harm,\" said Kristine Beckerle, Amnesty's deputy Middle East and North Africa director. “It kind of defies belief that the U.S. would not have known.” The U.S. airstrikes against the Houthis began over the rebels' attacks on shipping under U.S. President Joe Biden. However, the attacks sharply escalated under Trump's Operation Rough Rider, hitting some 1,000 targets in Yemen. Those strikes hit power stations, mobile phone infrastructure and military targets in Yemen. However, activists say the attacks also killed civilians, particularly an April strike on an oil depot that killed more than 70 people. Airwars, a United Kingdom-based group studying casualties in aerial warfare, believes strikes in the Operation Rough Rider at least 224 civilians during the weekslong campaign — nearly as many civilians killed over more than 20 years of American strikes on the country. U.S. Army Gen. Michael Kurilla, CENTCOM's former commander, promised details on civilian casualties in the Yemen campaign “absolutely” would be made public during congressional testimony in June, though that has yet to happen. “One of the things that was relatively devastating is again you’re talking about people who left Ethiopia to travel to Yemen because they’re trying to get to the Gulf” to earn money for their families back home, Beckerle said. \"They have to have their family send money to them in Yemen to deal with the effects of the injury.”",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T091500Z",
    "date_download": "2025-10-29T11:08:01.624990+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/amnesty-us-strike-yemen-prison-killed-dozens-african-126960513",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c0630188d7cacac28fdab99a65849208",
    "processed_at": "2025-10-29T12:10:03.382991",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a U.S. airstrike in Yemen and its implications regarding war crimes, focusing on humanitarian issues and international law. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/environment/story/2025-10-29/timber-industry-opposes-republican-resolution-to-stop-owl-killing-plan",
    "title": "Plan to kill 450 , 000 owls creates odd political bedfellows loggers and environmentalists",
    "text": "Plan to kill 450,000 owls creates odd political bedfellows — loggers and environmentalists - Share via - A plan by federal wildlife officials to protect spotted owls in in the Pacific Northwest by killing barred owls has created strange alliances. - Some Congressional Republicans, along with animals rights groups, want to stop the cull. - Loggers have joined environmentalists in raising the alarm about consequences if it doesn’t happen. The strange political bedfellows created by efforts to save spotted owls in the Pacific Northwest just got even stranger. Already Republican members of Congress were allied with animal rights activists. They don’t want trained shooters to kill up to 450,000 barred owls, which are outcompeting northern spotted owls, under a U.S. Fish and Wildlife Service plan approved last year that would unfold over three decades. Now, timber interests are aligning with environmentalists in favor of culling the owls. Federal wildlife officials approved a plan to cull barred owls in order to protect northern spotted owls, but it could be upended by funding cuts and congressional opposition. Some logging advocates are afraid nixing the plan will slow down timber harvesting. Roughly 2.6 million acres of timberlands in western Oregon managed by the Bureau of Land Management are governed by resource management plans contingent on the barred owl cull going forward, according to Travis Joseph, president and chief executive of the American Forest Resource Council, a trade association representing mills, loggers, lumber buyers and other stakeholders in the region. The area can produce at least 278 million board feet per year under current plans, “with the potential for significantly more,” Joseph said in a mid-October letter to Congress. If the cull is scrapped, he said, the federal agency likely will need to restart Endangered Species Act consultation for the northern spotted owl, which is listed as threatened. It’s a process that could take years. According to the letter, it would create “unacceptable risks and delays to current and future timber sales.” Timber production goals laid out by the Trump administration also could be jeopardized. Momentum to stop the cull gained ground this summer when Sen. John Kennedy, a conservative from Louisiana, introduced a resolution to reverse the Biden-era plan. That move reflected an unlikely alliance between some right-wing politicians and animal rights advocates who say it’s too expensive and inhumane. Some Democrats have also opposed the cull, and companion legislation in the House has bipartisan backers. The stakes are high. Many environmentalists and scientists maintain that northern spotted owls will go extinct if their competitors aren’t kept in check. Barred owls — which originally hail from eastern North America — are larger, more aggressive and less picky when it comes to habitat and food, giving them an edge when vying for resources. Last week, Politico’s E&E News reported that Kennedy said Interior Secretary Doug Burgum asked him to stand down from his effort to stop the owl-killing plan. The legislator told the outlet he would charge ahead anyway. “I don’t think the federal government ought to be telling God, nature — whatever you believe in — this one can exist, this one can’t,” Kennedy told E&E. “The barred owl is not the first species that has ever moved its territory and it won’t be the last.” Kennedy did not respond to The Times’ request for comment. A spokesperson for the Department of the Interior said they could not respond to the inquiry because of the government shutdown. “It’s strange that a Republican in the south is taking on the owl issue, specifically, when its consequences will impact western Oregon BLM timber sales,” Joseph said in an interview. “It will lead to lower revenues for counties, it will impact jobs and it will put the spotted owl on a trajectory towards extinction.” U.S. Forest Service layoffs have upended surveys for spotted owls in Southern and Northern California, threatening data collection for the declining birds. The stance aligns in part with that of environmental groups like the Environmental Protection Information Center and Center for Biological Diversity, which have supported culling barred owls to help the beleaguered spotted owls in their native territory. It’s an unexpected overlap, given environmentalists’ long history of fighting to protect old-growth forests in the region the owls call home. Tom Wheeler, chief executive of EPIC, said it’s possible that culling barred owls could lead to a bump in timber harvest on the BLM land in western Oregon but overall it would lead to more habitat being protected throughout the spotted owls’ expansive range. The presence of spotted owls triggers protections under the Endangered Species Act. If the cull boosts the spotted owl population as intended, it means more guardrails. “It puts us in admittedly an awkward place,” Wheeler said. “But our advocacy for barred owl removal is predicated not on treating the northern spotted owl as a tool against the timber industry and against timber harvest. What we’re trying to do is provide for the continued existence of the species.” Many Native American tribes support controlling barred owls in the region. In a letter to Congress last week, the nonprofit Intertribal Timber Council said barred owls threaten more than the spotted owl. “As a generalist predator, it poses risks to a wide range of forest and aquatic species that hold varying degrees of social and ecological importance to tribes, including species integral to traditional food systems and watershed health,” wrote the council, which aims to improve the management of natural resources important to Native American communities. Since 2013, the Hoopa Valley tribe in Northern California has been involved with sanctioned hunting of the owls and has observed the spotted owl population stabilizing over time, according to the letter. A GOP resolution aims to cancel a government plan to kill barred owls in the Pacific Northwest to protect spotted owls. Members from both parties have signed on. However, groups like Animal Wellness Action and Center for a Human Economy argue that the plan to take out so many barred owls over a vast landscape won’t work, aside from the high owl death toll. More barred owls simply will fly into where others were removed, said Wayne Pacelle, president of both groups. That makes habitat key — and the prospect of losing more to logging in western Oregon devastating, according to Pacelle. To stop the owl-culling plan, both chambers of Congress would need to pass a joint resolution and President Trump would need to sign it. If successful, the resolution would preclude the agency from pursuing a similar rule, unless explicitly authorized by Congress. The plan already faced setbacks. In May, federal officials canceled three related grants totaling more than $1.1 million, including one study that would have removed barred owls from over 192,000 acres in Mendocino and Sonoma counties",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T104500Z",
    "date_download": "2025-10-29T11:08:12.398491+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/environment/story/2025-10-29/timber-industry-opposes-republican-resolution-to-stop-owl-killing-plan",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "16adb42f055bf22180217426ae812606",
    "processed_at": "2025-10-29T12:10:03.383075",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a plan regarding the culling of barred owls to protect northern spotted owls, focusing on political alliances and environmental implications. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/drive/culture/article-all-electric-vehicles-still-have-a-long-way-to-go-in-rural-canada/",
    "title": "All - electric vehicles still have a long way to go in rural Canada",
    "text": "Electric cars make a lot of sense in the city, where they can be easily recharged at home or at any number of fast public chargers. But how about in the more remote areas of Canada, on the road less travelled? I’ve just returned from a 3,000-kilometre Ontario road trip in a Hyundai Ioniq 9, visiting Nakina and Nipigon for research into a book I’m preparing. Nakina is north of Geraldton and to get there I drove on Ontario’s Highway 11. This is officially an alternate route of the Trans-Canada Highway and was once the only road to link Canada’s east and west. Many long-distance truckers prefer this road because it’s a little shorter than taking the scenic and more hilly, traditional Trans-Canada along the north shore of Lake Superior. If you just want to drive to the other end, it gets the job done. It’s almost 1,000 kilometres from North Bay to Nipigon on Hwy. 11, with an extra 100 kilometres up to Nakina and back. The Ioniq 9 is completely electric and you can read my thoughts about it on this journey. Hyundai’s biggest EV has a 110-kilowatt-hour battery pack and is capable of driving at least 500 kilometres on a single charge. Maybe not so far when the legendary cold of Ontario’s northland hits each winter, but temperatures were mostly warm for this drive in September. Despite one of the longest ranges in the marketplace, I needed to plan ahead to know where and when to charge. I brought along my friend Neil, who’s owned electric vehicles for the last five years, to help with the planning; mostly, I brought him along to have somebody else to blame if we should find ourselves stranded. It helped a great deal that the Ioniq 9 has a Tesla-designed NACS (North American Charging Standard) charging port, so we could charge at most Tesla superchargers. Not all, however – some are still accessible only to Tesla vehicles. The process was simple at the first charging spot in Bracebridge. It was a Tesla station where there were several vacant chargers. The SUV topped up after 250 kilometres, costing $30.67, while we ate lunch next door at Boston Pizza. It continued to be simple after we topped up again overnight in North Bay at our hotel’s free charger. The next day, there was a 50-kilowatt charger in the Tim Horton’s parking lot at Temiskaming Shores that we thought was broken – the spot was overgrown and the charger looked in rough shape – but it turned out to be working just fine, and it was free to use. We needed to fill up little and often because Neil could find no chargers faster than 50 kilowatts beyond North Bay. If the Ioniq’s battery should be too depleted, a 50-kilowatt charge could take several hours. Hyundai says the SUV will charge from 10 to 80 per cent in 24 minutes if it’s plugged into a 350-kilowatt charger, but such charging capacity is still uncommon in Ontario, and especially away from the Windsor-Toronto-Montreal corridor. We filled up before dinner in Kapuskasing, then the next day after 100 kilometres in Hearst. Then it was 250 kilometres to the next fast-chargers in Geraldton. One of the two Ivy chargers at the Esso station was broken, but nobody was using the working charger, so all was well. “Do you get many EVs at your chargers?” I asked the clerk at the station. After all, they were the only fast chargers to be found before Nipigon, another 160 kilometres to the south-west. “We probably average two, maybe three cars a week,” said the clerk. And Neil and I realized we had not seen another electric vehicle since North Bay. Nor would we see another before reaching Nipigon a couple of days later. When I mentioned to a resident in Nakina that we were driving an electric car, she looked horrified, as if we were in a moon-buggy. The 50-kilowatt charge at Geraldton gave us enough range to easily reach Nipigon, where we were the only vehicle to plug in at the Tesla superchargers. The Tesla app stated the six chargers were each good for 250 kilowatts, but I only achieved 125 kilowatts. I’d wanted to try Nipigon’s Petro-Canada fast charger, but it had apparently been broken for months. We found another free charge at our hotel in Terrace Bay, made a Ford Mach-E wait half an hour for us to finish with the charger at Blind River, added some slow charge at Little Current, and then filled for the final time at Owen Sound, after crossing Georgian Bay on the Chi-Cheemaun ferry. Neil and I were excited in a nerdy way about the Electrify Canada chargers in Owen Sound. There were four of them, all available and all rated at 350 kilowatts. The Ioniq 9 had a 20-per-cent charge left in the battery and the temperature was a balmy 17 degrees Celsius – perfect for maximum charging speed. We wanted to see what 350 kilowatts felt like surging into the battery. The Ioniq, however, reached a maximum charging speed of just 236 kilowatts, impressive by any measure but far short of what we’d hoped to see. When we got home, I contacted Electrify Canada and was told the charger was working fine. So I contacted Hyundai Canada and asked why the charging speed had been just two-thirds of what I expected. “This is a good point of clarification,” wrote Jenn McCarthy, a spokeswoman for Hyundai Auto Canada Corp. “We do not advertise that the vehicle is capable of charging at 350kW, just that the approximate 10-to-80-per-cent charge time (can be) achieved on a 350kW charger.” Hmmm – semantics. At the end of the 3,000-kilometre, six-day journey, the big Hyundai had spent about nine hours plugged into chargers while we waited, and another couple of nights charging while we slept at hotels. Its electric consumption averaged 21.9 kilowatt-hours per 100 kilometres and the final cost for electricity was $370, or just over 12 cents per kilometre. You can compare that to a similar sized, gas-powered SUV cruising on the highway at 10 litres per 100 kilometres, which would cost about 13 cents a kilometre in gas. It’s not an apples to apples comparison, of course. Some charges were free. If you own an EV, most of your charging is probably at home and a fraction of the cost. The lesson learned, however, is that however smug we may be that EVs are the future, it’s an entirely different world once you leave the city. There’s no way that residents of Nakina or Kapuskasing or Hearst will welcome still-alien EVs with the long distances they must drive and the frigid winter temperatures they can now conquer easily with gasoline or diesel. We’re getting there, but like Highway 11 itself, there’s still a long way to go.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T094500Z",
    "date_download": "2025-10-29T11:08:15.657971+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/drive/culture/article-all-electric-vehicles-still-have-a-long-way-to-go-in-rural-canada/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c8f91e9a1ac66b0ce8a6cceb7bfa1de5",
    "processed_at": "2025-10-29T12:10:03.383151",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses electric vehicles and their charging infrastructure in rural Canada, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://nationalpost.com/news/canada/there-are-political-risks-in-taking-decisions-minister-say",
    "title": "  I think there a risk aversion in government , energy minister says",
    "text": "Hodgson:Look, I think the civil service is very good at pointing out, “these are the risks of this, this.” And it’s like, “yeah, but here are the rewards.” In the private sector, you have to take risks to get the rewards. Oftentimes the risks are … the risks are very politically obvious. The rewards are diverse to all Canadians. So we have to keep recognizing that, yes, there are political risks in taking decisions, but those rewards go to all Canadians, and that’s ultimately our job is to serve all Canadians. So, don’t over-index on risk. Consider the risks carefully, but also make sure you’re focusing on what are the rewards. What are the rewards for all Canadians? And sometimes we have to take those political risks.",
    "domain": "nationalpost.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251029T093000Z",
    "date_download": "2025-10-29T11:08:27.733747+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nationalpost.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://nationalpost.com/news/canada/there-are-political-risks-in-taking-decisions-minister-say",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0096b38931c6f296651e48ac11a6c65a",
    "processed_at": "2025-10-29T12:10:03.383202",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses risk management in government and the private sector, focusing on political risks and rewards for Canadians. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://variety.com/2025/film/festivals/elvis-producer-australia-incentives-tokyo-film-festival-1236564272/",
    "title": "  Elvi Producer Touts Australia Film Incentives at Tokyo Festival",
    "text": "Schuyler Weiss, producer of Baz Luhrmann’s “Elvis,” made a compelling case for Australia’s film ecosystem at an MPA seminar during the Tokyo International Film Festival, speaking from his unique position as both a local Australian producer and facilitator of major Hollywood productions. Weiss, who has worked with Luhrmann for approximately 20 years on productions including “Australia,” “The Great Gatsby” and “Elvis,” outlined how sophisticated production incentives have helped transform the Gold Coast into one of the country’s fastest-growing film centers. “I stand here, on the one hand, as a local Australian film producer who is as concerned as anyone with the health, the growth, the future of our domestic production industry, but I also spend a big part of my day actively bringing large scale Hollywood backed global productions to Australia,” Weiss said, noting his upcoming work on Luhrmann’s “Joan of Arc.” Popular on Variety Australia’s multi-tiered incentive system features a 30% production attraction rebate for international productions, standalone post-production incentives, and various programs specifically for Australian producers at the federal level. Individual states add their own incentives, creating what Weiss described as a “co-opetition” that spreads work around the country while avoiding bottlenecks in Sydney or Melbourne. Even local governments participate — the Gold Coast city council offers municipal-level incentives. “You can coordinate all the levels of government to be the wind in the sails of your production,” Weiss explained. He emphasized that incentives must be clear and accessible for quick decision-making, noting he’s “seen the spreadsheets in the corridors of power and big movie studios in Hollywood, where without great regard to what the content is going on screen, they’re just looking at whether they should shoot in London or the Gold Coast or Bratislava, as if those things are interchangeable.” Working with the MPA, Australia recently strengthened and clarified the 30% location attraction rebate, replacing what Weiss called “something that was just, frankly, kind of unwieldy and confusing.” The incentives operate on a rolling basis to accommodate the industry’s unpredictable timelines. Weiss stressed that government incentives represent an investment rather than a gift, with returns of four to five times every dollar spent. The economic impact extends beyond industry payroll to rental cars, hotels, meals and other services. “The penetration goes so deeply into the economy when big film productions come to town that the incentives offer a tremendous return on investment, but it’s also an investment in the future,” he said. Screen Australia serves as the interface between the industry and government, with Weiss praising the agency’s clear governance structure. The incentive system has enjoyed bipartisan political support for 18 years, providing the reliability necessary for infrastructure investment. Over two decades, Australia has hosted dozens of major movies and international productions, elevating filmmakers like George Miller and Luhrmann to the highest levels while they continued working domestically. “Elvis” featured 100% Australian visual effects work, with so many shots that Weiss joked the VFX team were “victims of their own success” because the recreations of Memphis locations like Beale Street looked so authentic that visitors from Tennessee believed they had filmed on location. In reality, the production built a five-block backlot set of Memphis on a former city dump on the Gold Coast that had been grassed over. Weiss highlighted the skills transfer between large international productions and local films. After “Elvis” wrapped, he produced a smaller Australian film, “How to Make Gravy,” for the local market, giving department members from the big production their first head-of-department roles on a feature. “That hand in hand between the international industry and the local industry is really, really gratifying to be a part of,” he said. Australia now has world-class production facilities in Sydney, Melbourne and the Gold Coast, with emerging centers in South Australia and Western Australia. However, the industry faces capacity constraints — even director Ron Howard couldn’t secure soundstage bookings for two back-to-back Gold Coast productions, per Weiss. Weiss identified post-production and visual effects as “the next big frontier” for Australian industry growth. The country offers a 30% PDV (post-production, digital and visual effects) rebate nationally, with Queensland adding an extra 15%. “We want people who shoot their movie anywhere, shoot their movie in Japan, shoot their movie in Thailand, shoot their movie in Canada, or maybe even actually in Hollywood, to feel like they would do post production in Australia regardless of where the movie is shot,” Weiss said. He noted that a company recently committed to moving 100 employees from Sydney to the Gold Coast, with plans to grow to 300-500 positions within a few years, attracted by the rebate structure. International production location incentives now include mandates for skills development spending, which Weiss applauded for training young technicians. Weiss noted that production company Bazmark, is partnering with multiple levels of Australian government to develop the Miami Arts Depot (MAD), a permanent integrated creative community on 35,000 square meters of former municipal land on the Gold Coast, approximately one kilometer from the beach. The facility will house post-production, visual effects, technology companies, production companies and industry organizations. “We want to create a hub there that will offer the best in class vendors and facilities for our industry to use, and also for the benefit of our international productions and partners,” Weiss said. The project aims to foster intersection between film, technology and design while maintaining physical space for creative collaboration. “At the end of the day, our industry, the movie business, is the most collaborative art form ever devised,” he noted.",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251029T093000Z",
    "date_download": "2025-10-29T11:09:13.958356+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/film/festivals/elvis-producer-australia-incentives-tokyo-film-festival-1236564272/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "32352eb23ef65539aabf0aa5b8c31062",
    "processed_at": "2025-10-29T12:10:03.383291",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses film production incentives in Australia and the impact on the local film industry, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/neil-zeiger-martin-proctor-flickers-films-ashley-pharoah-1236600324/",
    "title": "Neil Zeiger & Martin Proctor Launch Flickers Films",
    "text": "EXCLUSIVE: Industry vets Neil Zeiger and Martin Proctor have launched indie label Flickers Films with a slate of co-productions that includes a new drama from Ashes to Ashes screenwriter Ashley Pharoah and documentary filmmaker Ann Hawker’s first dramatic movie. The new banner will cover film and TV, and span scripted and docs. Zeiger was Creative Director of scripted at Keeping Faith producer Nevision, developing and producing titles including Brian Cox directorial debut Glenrothan, which Protagonist is selling internationally. Proctor’s credits include The Day the Silence Died and Sam Shepard movie Blackthorn. Having worked together in theater and then at the BBC, the pair actually ran a prodco called Flickers back in the 1980s, which made projects including Liam Neeson movie Lamb and Adrian Dunbar TV drama Reasonable Force. The new incarnation of Flickers is privately backed and has projects in the works with partners including ITV Studios-backed World Productions and producer-distributor APC. Ashley Pharoah-penned drama Charlie King is being developed with World, and Zeiger said it will be “a UK-based high-end thriller that is also procedural at its root.” Watch on Deadline Elsewhere, dark comedy Bad Priest comes from filmmaker Jamie Patterson (Tucked) and will be a co-pro with APC. In film, there is An Austrian Holiday, which hails from documentary filmmaker Ann Hawker. It has been set up with Astria Films in the UK and WEP Films in Germany and the hope is to go into production in 2026. In factual, the slate includes Bolivian prison doc Inside Out, which goes inside the walls of the notorious San Pedro prison, run by inmates. “We have about 200 hours of material, because it was made in collaboration with the prisoners,” Proctor said. “We’re going to go back 20 years on and we pick up with about half a dozen of these guys to see what’s happened to them, if they’ve managed to rehabilitate themselves, or whether they’re still inside.” Proctor said the new indie is looking to work up films and TV that offer a different take. “There’s so much content, but we’re looking for things that have a fresh voice and a fresh perspective, something that gives you a feeling that you’ve been woken up to something that you hadn’t seen before.” Zeiger added: “Flickers is a new company and it’s like a startup, but it reflects the same values that it did when we first started, which was working with emerging talent, different and diverse voices and showing different perspectives.”",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251029T093000Z",
    "date_download": "2025-10-29T11:09:22.467154+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/neil-zeiger-martin-proctor-flickers-films-ashley-pharoah-1236600324/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3bdd5e459c88cac68ab678aa3a67ed7d",
    "processed_at": "2025-10-29T12:10:03.383336",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the launch of an indie film label and its projects, with no mention of artificial intelligence or related topics. It focuses on film and television production rather than AI.",
      "keywords": []
    }
  }
]