[
  {
    "url": "https://www.bbc.com/travel/article/20251027-sleepy-hollow-the-town-that-renamed-itself-for-halloween",
    "title": "Sleepy Hollow : The town that renamed itself for Halloween",
    "text": "Sleepy Hollow: The town that renamed itself for Halloween Two centuries after Washington Irving wrote The Legend of Sleepy Hollow, the once-industrial town of North Tarrytown has rebranded itself around his ghostly horseman – and discovered that myth still sells. It was early October in Sleepy Hollow, New York, when I saw the Headless Horseman for the first time. He burst from the tree line on horseback and parted the fog as he galloped towards me, his cloak billowing behind him – a giant spectre in the dark night. After a couple of laps around the show's mock graveyard, the crowd cheered as the Horseman trotted over. Tonight's rider, a woman, welcomed everyone to pet her horse, a rescue named Eagle. As I gave Eagle a scratch, people lined up for tarot readings, vendors sold art and oddities at a pop-up market beside the barn and a roving band paraded through the grounds. This was Twilight Village at Philipsburg Manor – one of Sleepy Hollow's many immersive Halloween events. The next night, I saw the Headless Horseman again at Irvington's 'Legend' at Sunnyside, a storytelling performance at American writer Washington Irving's historic home. I saw the Horseman everywhere else too: on street signs and police squad cars, on t-shirts and storefronts and even on the Christmas ornament I bought as a souvenir. But I wasn't here for the spooky sights; I'd come to learn how a fictional place could transform into a real one – and how one story reshaped an entire town. A town reborn Few places in the United States are as entwined with a single story as Sleepy Hollow. Immortalised in Washington Irving’s 1820 tale The Legend of Sleepy Hollow, the town became synonymous with its ghostly rider – the Headless Horseman – and helped shape early American gothic fiction. The legend grew from Hudson Valley folklore and has since inspired countless retellings in film, literature and popular culture. With social media, increasing numbers of travellers have discovered that Sleepy Hollow, just a 50-minute train ride north of New York City, is a real place they can visit. But few know that the Halloween hotspot wasn't always called that – and for much of the 20th Century, it was better known for building cars than for ghost stories. How Sleepy Hollow got its name It's a common misconception that Irving coined the name, but it actually predates him by more than a century, with Dutch colonisers in the 1600s referring to the village as \"Slaepers' Haven\" and \"Slaepers' Hol\". The anglicised version, \"Sleepy Hollow\", was used informally in the region from then on. Between 1870 and 1996, the town was officially named North Tarrytown. When the General Motors plant that had operated in the area for a century closed in the mid-1990s, residents were forced to reimagine their town's future. Seeing the need for a rebrand, they voted in favour of changing the name to Sleepy Hollow. The rebrand worked and the town embraced its new identity. The Headless Horseman became the town's unofficial mascot – and the official mascot of the local high school. But while locals expected some tourism with the new moniker, they didn't foresee just how completely their town on the Hudson River would transform into a Halloween pilgrimage site. Across the street from Philipsburg Manor sit three of Sleepy Hollow's most famous attractions: the Old Dutch Church (founded in 1697 and featured in Irving's story); the Sleepy Hollow Cemetery, where the Headless Horseman first appears cloaked in a white mist; and the cemetery's rustic bridge that looks similar to the Headless Horseman Bridge he gallops over in the tale. Earlier that day, I met with cemetery superintendent Jim Logan, whose family has been involved in the cemetery's business for decades. As we drove across the 90-acre labyrinth of rolling hills, worn headstones and forest to inspect a burial plot, he told me that finding the balance between running an active cemetery and welcoming tourists \"has become an increasing challenge\". The cemetery has always drawn visitors – its notable graves include Washington Irving, Andrew Carnegie, Walter Chrysler and William Rockefeller – but since tours began about 20 years ago to fund restoration, numbers have grown exponentially. Logan told me that some visitors don't realise this is still a working cemetery, assuming it was fabricated by Irving, and there have been instances where tourists have refused to move for funeral processions. He recalled one encounter with gallows humour, noting that a woman once saw the cemetery logo on their van and asked if they'd \"put out the gravestones\" for the season. They'd done two burials that morning. He added that confusion is especially common among first-time visitors expecting Hollywood's Sleepy Hollow. \"Here in the cemetery, we notice that a fair number of visitors don't really understand what they're coming to visit,\" he said. \"We'll have people looking for a covered bridge. That was Disney and Tim Burton.\" The business of Halloween That blurred line between fiction and reality is something Julia McCue knows well. McCue is the owner of Horsefeathers restaurant-bar that's been a staple in Tarrytown, a mile south of Sleepy Hollow, since 1981. The place is so popular that you can expect a long line to get in, but it means that McCue's plan to become the best Halloween bar in the country is going well. During autumn, the moody interior is transformed with an atmospheric Halloween display that social media has turned into a must-see attraction. McCue sees the full spectrum of visitors to Sleepy Hollow. Often, she says, they didn't know the town was a real place until they saw it on social media. Others come expecting a Halloween theme park rather than the small, normal town that it is. \"It's not a tourist trap,\" she tells me. \"We are just a town that is trying to entertain people while they're here.\" On the village's main street, nearly every storefront is decorated for the season, from restaurants and shops to banks and the fire station. Even the local funeral home has a giant Headless Horseman and an even larger skeleton grinning at passersby. They need to be committed because it's important for business. Leah Bloom, who owns the Sleepy Hollow Bookshop, says the six weeks leading up to Halloween are crucial for survival. \"We could not exist in a town this size without the influx of tourist business,\" she says. More like this: • Where did Halloween originate? • Pomfret, Vermont: The fall foliage town that banned influencers • Four of Europe's most fascinating pre-Christian winter festivals Much of that influx began with The Great Jack O'Lantern Blaze launched 21 years ago in the neighbouring town of Croton-on-Hudson. This massive Halloween event features more than 7,000 illuminated jack-o'-lanterns, all carved by hand onsite, with synchronised lighting, special effects and a spooky original soundtrack. The walking path glows with elaborately carved tableaus – animals, zombies, flower gardens, a spinning carousel and even a pumpkin Statue of Liberty. It's widely considered one of the best family-friendly Halloween events in the US, drawing more than 100,000 visitors each season. With the success of The Blaze, Historic Hudson Valley, the nonprofit behind the region's heritage sites, developed new Halloween events at its other venues, including Washington Irving's Sunnyside at Philipsburg Manor. Sleepy Hollow Cemetery followed suit, adding special themed tours and night tours that sell out weeks in advance during October weekends. My favourite was one of these eerie evening rambles. For two hours, our guide Amanda led us by kerosene lanterns to the tombs of some of the cemetery's most notable and intriguing residents. It wasn't a haunted tour but a historical one, filled with intrigue, humour and surprisingly touching stories. At Irving's grave, she acknowledged, \"This is why most of you are here\" and explained that Irving is on his third headstone because tourists chipped away pieces of the previous ones to bring home as souvenirs. Two hundred years after Irving spun a story from local lore, the town has brought that legend to life for visitors. Irving's tale is open-ended, allowing readers to choose whether they believe the Headless Horseman is real or not. And the town of Sleepy Hollow offers visitors the same choice: to believe in the legend – or simply admire how storytelling shaped a town's second life. -- If you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week. For more Travel stories from the BBC, follow us on Facebook and Instagram.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251028T124500Z",
    "date_download": "2025-10-28T13:10:41.053322+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/travel/article/20251027-sleepy-hollow-the-town-that-renamed-itself-for-halloween",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e83f26bf253ed33eefbf9299882c0d01",
    "processed_at": "2025-10-28T14:14:28.943357",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the town of Sleepy Hollow, its history, and its transformation into a Halloween destination. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/2025/oct/28/mass-killings-reported-el-fasher-sudan-paramilitary-group-rapid-support-forces",
    "title": "Mass killings reported in Sudanese city seized by paramilitary group",
    "text": "Reports of ethnically motivated mass killings and other atrocities are emerging from El Fasher after the paramilitary Rapid Support Forces took control of the city in Sudan’s western Darfur region last week. Video released by local activists showed a fighter known for executing civilians in RSF-controlled areas shooting a group of unarmed civilians sitting on the ground at point-blank range. Different footage shared by pro-democracy activists purportedly showed dozens of people lying dead on the ground alongside burnt-out vehicles. The footage has not been verified. In a statement on Tuesday, the Joint Forces – who are allied with Sudan’s army – accused the RSF of having executed more than 2,000 unarmed civilians in recent days. The claim could not be verified but Yale University’s Humanitarian Research Lab, which has been monitoring the war in Sudan using open-source intelligence and satellite imagery, said on Monday it had found evidence consistent with alleged mass killings by the RSF. On Tuesday the Yale lab said the city “appears to be in a systematic and intentional process of ethnic cleansing of Fur, Zaghawa, and Berti Indigenous non-Arab communities through forced displacement and summary execution”. This included what appeared to be “door-to-door clearance operations” in the city, it said. The RSF said on Sunday it had seized control of the army’s main base in the city and released a statement saying it had “extended control over the city of El Fasher from the grip of mercenaries and militias”. The Sudanese army chief, Gen Abdel Fattah al-Burhan, said on Monday that his forces had withdrawn from El Fasher “to a safer location”, acknowledging the loss of the city. The RSF has been engaged in a bloody civil war with the army since April 2023 after a power struggle between the two sides. More than 150,000 people have been killed and more than 14 million displaced due to the fighting. Fears had been mounting in recent weeks for the safety of tens of thousands of civilians trapped in the city by an 18-month RSF siege. The UN rights chief, Volker Türk, said on Monday there was a growing risk of “ethnically motivated violations and atrocities” in El Fasher. His office said it was “receiving multiple alarming reports that the Rapid Support Forces are carrying out atrocities, including summary executions”. The UN Human Rights Office said there were reports of “summary execution of civilians trying to flee, with indications of ethnic motivations for killings”, as well as videos showing “dozens of unarmed men being shot or lying dead, surrounded by RSF fighters who accuse them of being [Sudanese army] fighters”. News agencies have been unable to contact civilians in the city, where the Sudanese Journalists’ Syndicate says communications, including satellite networks, have been cut off by a media blackout. Shayna Lewis, a Sudan specialist at Preventing and Ending Mass Atrocities, one of the groups closely in touch with Darfur civilian society, accused the RSF of massacring civilians. She said: “Residents of El Fasher who previously left the city are finding out about the death of their loved ones through footage of executions that are widely circulating on social media.” There are grave fears of a repeat of the RSF massacres that took place in West Darfur’s capital, Geneina, after it captured the city in 2023, when up to 15,000 civilians – mostly from non-Arab groups – were killed. According to the UN, more than 1 million people have fled El Fasher since the start of the war and about 260,000 civilians, half of them children, remain trapped without aid. Many have resorted to eating animal fodder. The UN’s migration agency said more than 26,000 people had fled the fighting in El Fasher since Sunday, either seeking safety in the outskirts of the city or heading to Tawila, 45 miles to the west. In Tawila, teams from Médecins Sans Frontières said they were facing a massive influx of wounded coming from El Fasher to the town’s hospital. Since Sunday evening, 130 had been hospitalised, including 15 in critical condition, MSF said. The RSF’s capture of El Fasher, the last remaining major city in Darfur controlled by the army, gives the paramilitary group control over all five state capitals in Darfur and marks a significant turning point in the war. The army is now excluded from a third of Sudanese territory, a development that experts say raises the possibility the country could face partition. Agence France-Presse contributed to this report",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251028T124500Z",
    "date_download": "2025-10-28T13:10:54.264538+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/2025/oct/28/mass-killings-reported-el-fasher-sudan-paramilitary-group-rapid-support-forces",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1e5070b0e56c5dc1cefe27c596f59a2d",
    "processed_at": "2025-10-28T14:14:28.944160",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses mass killings and atrocities in Sudan, focusing on the conflict involving paramilitary groups and the humanitarian crisis. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/commentisfree/2025/oct/28/want-to-go-to-uk-university-do-not-ask-me-to-help-you-write-your-personal-statement",
    "title": "Want to go to a united kingdom university ? Dont ask me to help you write your personal statement | Zoe Williams",
    "text": "It’s university entrance season, and so begin the trials of the personal statement, which now takes the form of three questions: “Why do you want to study this course or subject?; How have your qualifications and studies helped you to prepare for this course or subject?; What else have you done to prepare outside education, and why are these experiences useful?” – 4,000 characters for the Ucas form, in which every 17- and 18-year-old has to express their uniqueness, while at the same time answering the same generic questions. I can’t help my own kids with this because they’re Stemmy (as in science and maths-oriented). their scope of interests is expressed in formulae, and if I ever have the audacity to ask them to translate it back into words, they shake their heads and go, “You’re never going to understand electron configuration”, in the exact tone of voice you’d use to tell a dog sitting in a suitcase that it isn’t allowed to come on holiday. But I have had a number of kids doing work experience with me, wanting to study such things as politics, sociology, English and international relations. I should theoretically know my way around the language of persuasion on this territory, but to the Great Admissions Tutor of the collective imagination, nothing is ever good enough. All the plucky, regular-person stuff you’d have put on such a form in the 90s – I helped an old lady once; I have a babysitting syndicate; I’m a keen crocheter – is completely out. Today’s applicant can be a lieutenant of 10 years’ standing in the climate activist army, with three A* predictions, but still conclude mournfully that everyone’s been on 20 Extinction Rebellion marches, and you’ll only stand out if you’ve been on the flotilla with Greta Thunberg. They have this madly impressive private school kid in their heads who spent the summer in Beijing interning for the Central Military Commission, and maybe they’re right, but when you tell them that admissions tutors can also read, and will be able to decipher the word “Eton”, they don’t believe you. They pore over the thesaurus trying to find different ways to say “passionate” and “fascinated”, then it all comes out sounding like ChatGPT, so they put it through ChatGPT to make it sound less like ChatGPT. Then they’ve sailed over their character limit, so they change all instances of “incredibly” to “so”, and so sound like Nancy Mitford. I just want to get a big red pen and scrawl: “I’d like to see you get three A* predictions and also save the world, Mr/Ms Pointy Head. These are great kids. Let them into your university.” Zoe Williams is a Guardian columnist",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251028T124500Z",
    "date_download": "2025-10-28T13:10:54.317754+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/commentisfree/2025/oct/28/want-to-go-to-uk-university-do-not-ask-me-to-help-you-write-your-personal-statement",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3f36d43b851db0da2ab1ea1bf8b73221",
    "processed_at": "2025-10-28T14:14:28.944217",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the challenges students face when writing personal statements for university applications, with a brief mention of ChatGPT in the context of writing style. However, the focus is not on AI itself but rather on the implications of using AI tools in personal statement writing.",
      "keywords": [
        "personal statement",
        "university",
        "ChatGPT"
      ]
    }
  },
  {
    "url": "https://abcnews.go.com/Health/wireStory/new-hampshire-man-resumes-dialysis-after-record-271-126907932",
    "title": "New Hampshire man resumes dialysis after record 271 days living with a pig kidney",
    "text": "New Hampshire man resumes dialysis after record 271 days living with a pig kidney A New Hampshire man lived with a pig kidney for a record 271 days before surgeons removed it last week as the organ's function declined WASHINGTON -- A New Hampshire man is resuming dialysis after living with a gene-edited pig kidney for a record 271 days, doctors said Monday. His experience is helping researchers in their quest for animal-to-human transplants. Tim Andrews, 67, had the organ removed on Oct. 23 because its function was declining, according to Mass General Brigham. In a statement, his transplant team called Andrews “a selfless medical pioneer and an inspiration” to patients with kidney failure. Andrews’ experience illustrates lessons researchers have learned with each experiment involving what's called xenotransplantation. The first attempts using pig organs gene-edited to be more humanlike – two hearts and two kidneys – were short-lived. Then researchers began considering patients not nearly as sick as prior recipients for these experiments — and an Alabama woman’s pig kidney lasted 130 days before it had to be removed last spring, the record Andrews surpassed. More than 100,000 people, most needing kidneys, are on the U.S. transplant list, and thousands die waiting. Andrews, of Concord, New Hampshire, knew his blood type is particularly hard to match and sought an alternative, getting into shape to qualify for Mass General’s xenotransplant pilot study. His doctors said he remains on the transplant list. In June, the Mass General team transplanted a pig kidney into another New Hampshire man who continues to fare well. The pilot study is set to conclude with a third pig kidney transplant later this year. Two companies, eGenesis and United Therapeutics, are preparing to begin more rigorous clinical trials of pig kidney transplants. Surgeons in China also are pursuing this new field, reporting a pig kidney transplant last spring and separately a transplanted pig liver that had to be removed after 38 days. ___ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251028T124500Z",
    "date_download": "2025-10-28T13:11:13.870034+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/Health/wireStory/new-hampshire-man-resumes-dialysis-after-record-271-126907932",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e26f7de921c7c8fb48ea637c27d8127f",
    "processed_at": "2025-10-28T14:14:28.944549",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a medical case involving xenotransplantation, specifically the use of a pig kidney in a human patient. While it mentions gene editing, it does not focus on artificial intelligence or its applications. The main theme is organ transplantation rather than AI.",
      "keywords": [
        "xenotransplantation",
        "pig kidney",
        "gene-edited",
        "transplant"
      ]
    }
  }
]