[
  {
    "url": "https://www.dr.dk/nyheder/politik/kommunalvalg/danskerne-skal-til-kommunalvalg-se-hvilke-emner-vaelgerne-gaar-mest-op-i",
    "title": "Danskerne skal til kommunalvalg : Se , hvilke emner vælgerne går mest op i",
    "text": "Lokalpolitikerne skal kæmpe om vælgernes gunst, for den 18. november er der kommunal- og regionsrådsvalg. Men hvad er egentlig de vigtigste emner for vælgerne? Det har 102.897 danskere svaret på. Epinion har foretaget en meningsmåling for Constructive Institute, der er et uafhængigt center for journalistik, placeret på Aarhus Universitet. De danskere, der har deltaget i undersøgelsen, er blevet præsenteret for 13 lokalpolitiske temaer og er blevet bedt om at vælge de tre emner ud, som, de mener, er vigtigst for lokalpolitikerne at tage sig af. Her mener 45 procent, at skole og uddannelse er blandt de tre vigtigste emner. 42 procent mener, at sundhed, trivsel og socialt udsatte er i top tre, mens 39 procent vurderer, at ældrepleje er blandt de vigtigste emner. Helt i bund ligger temaet digitalisering - kun to procent af dem, der har besvaret undersøgelsen, mener, at det er blandt de vigtigste emner. Der er dog store lokale forskelle på, hvad folk synes er vigtigst. I Hillerød Kommune mener 55 procent af de adspurgte, at transport og infrastruktur et af de tre vigtigste emner. I Fanø Kommune mener 35 procent, at klima og bæredygtighed er blandt de vigtigste emner, mens 53 procent af de adspurgte i Læsø Kommune mener, at borgerinddragelse og nærdemokrati er på førstepladsen over de vigtigste emner. Alt det kan du gå på opdagelse i herunder, hvor du også kan finde din egen kommune. De klassiske temaer Ifølge Ulrik Kjær, der er professor ved Institut for Statskundskab på Syddansk Universitet, er det ikke synderligt overraskende, at det er netop emner som skole, sundhed og ældrepleje, som vælgerne finder særligt vigtige i kommunerne. - Når der er kommunalvalg, så er det de store kommunale velfærdsområder, som folk virkelig interesserer sig for. Og det er områder, som kommunerne tager sig af, siger han. Han tilføjer, at der dog har været kommunalvalg, hvor emner som integration og klima har spillet en større rolle. - Men generelt er det daginstitutioner, skoler og ældreområdet, som gang på gang lander oppe i toppen af vælgernes bevidsthed. I denne måling er det dog kun 11 procent, der mener, at dagtilbud er blandt de vigtigste emner. Ulrik Kjær peger desuden på, at politikerne også har en interesse i at fokusere på velfærdsemnerne i deres valgkamp. - Politikerne gør nok også deres for at trække valgkampen over mod de emner, fordi der er rigtig mange vælgere, der er i kontakt med disse områder, og derfor er det mere spændende at appellere til vælgere på de områder.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:10.282552+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/politik/kommunalvalg/danskerne-skal-til-kommunalvalg-se-hvilke-emner-vaelgerne-gaar-mest-op-i",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2815333d7b5e283715a120ac981182eb",
    "processed_at": "2025-10-22T11:16:30.290292",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses local political issues and voter concerns in Denmark, focusing on topics such as education, health, and welfare, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/ukraine-har-affyret-shadow-missiler-mod-krudt-fabrik-i-rusland",
    "title": "Ukraine har affyret Shadow - missiler mod  krudt - fabrik  i Rusland | Nyheder",
    "text": "Ukraine har angrebet inde i Rusland med britiske Shadow-missiler, som har ramt en kemikaliefabrik i Brjansk-regionen. Det oplyser det ukrainske militær, som kalder det et succesfuldt angreb, ifølge BBC. - Brjansks kemifabrik er et centralt anlæg i aggressorstatens militærindustrielle kompleks, skriver det ukrainske militær på X. Ifølge militæret producerer fabrikken krudt, sprængstoffer og raketbrændstof-komponenter, der bruges i russisk ammunition og missiler, som affyres mod Ukraine. I Rusland har den lokale guvernør, Alexander Bogomaz, skrevet på X, at der har været et angreb i Brjansk uden at skrive hvorhenne. Her fremgår det, at flere ukrainske droner skal være forpurret, men der nævnes intet om ødelæggelser på en våbenfabrik.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T074500Z",
    "date_download": "2025-10-22T09:15:10.459179+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/ukraine-har-affyret-shadow-missiler-mod-krudt-fabrik-i-rusland",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c707a27f283b4e115624de5333c97d81",
    "processed_at": "2025-10-22T11:16:30.290330",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a military attack involving missiles and a chemical factory in Russia, with no mention of artificial intelligence or related technologies. It focuses on military actions rather than AI topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/om-dr/nyheder/dr100/helle-har-spillet-laengst-i-dr-symfoniorkestret-disciplinen-er-en-anden-end-da",
    "title": "Helle har spillet længst i DR Symfoniorkestret :  Disciplinen er en anden , end da jeg startede  | DR100",
    "text": "Hvem kender denne måneds 100-års jubilar DR Symfoniorkestret bedst? Det findes der formentlig ikke et helt klart svar på, men violinist Helle Hanskov Palm kunne være et af de bedre bud. Da orkestret fejrede sit 60-års jubilæum i 1985, var hun lige begyndt et halvt år forinden, og med sine nu over 40 års erfaring i DR Symfoniorkestret, er hun i dag den, der har spillet i orkestret længst. Lige nu arbejder Helle Hanskov Palm under den syvende chefdirigent for orkestret, Fabio Luisi. Og gennem de snart 15.000 dage i orkestret har utallige andre dirigenter og kolleger været inde over, ligesom hun har henved 100 forskellige musikalske værker over nodestativet hvert eneste år. - Der har været mange personligheder og skægge originaler i symfoniorkestret gennem årene, beretter Helle Hanskov Palm, der i de første år arbejdede sammen med kolleger, der var startet i 1930’erne og 1940’erne. Så på den måde har hun gennem tiden arbejdet sammen med musikere, der har været med i store dele af DR Symfoniorkestrets 100-årige historie. Den officielle 100-års-dag er den 28. oktober, og en af de store markeringer sker ved koncerterne den 30. og 31. oktober, hvor chefdirigent Fabio Luisi dirigerer orkestret i Mahlers 8. Symfoni og får selskab på scenen af både DR Koncertkoret, BBC Singers og Københavns Drengekor. Et helt andet orkester De første to år spillede Helle Hanskov Palm 2. violin i orkestret, før hun nu i over 38 år har spillet 1. violin. Dengang var der to kvinder, der spillede førsteviolin. I dag er 13 ud af 21 førstevioliner kvinder. - Det var et helt andet orkester, jeg kom ind i dengang, siger Helle Hanskov Palm, som aldrig glemmer, hvordan en ældre koncertmester kom hen til hende i Radiohusets kantine på Frederiksberg i den allerførste pause på hendes allerførste arbejdsdag. - Jeg fattede ikke et ord af, hvad han sagde hele den pause. Senere viste det sig, at han lige skulle teste mig, og at han var ekspert i at tale sort, griner hun og tilføjer, at det næppe ville ske i dag. - Der er stadig plads til sjove kommentarer, og jeg har altid godt kunnet lide den uhøjtidelige tone i orkestret. Men disciplinen er en helt anden, end da jeg startede. Da talte vi af og til om, at mandagsprøverne ikke var gode, fordi musikerne ikke var forberedte og havde øvet på forhånd. Sådan er det slet ikke længere, siger Helle Hanskov Palm. Hun startede selv med at spille klaver som barn, men gik som 10-årig over til violin. Helle Hanskov Palm kom også senere på konservatoriet. - Det er faktisk meget sjovt. For mens jeg gik på konservatoriet, var der en, der sagde til mig: ’Hvorfor går du ikke til prøve i Radiosymfoniorkestret, som det hed dengang? Det endte jeg med at gøre, og da jeg spillede mig til en plads som 2. violin, stoppede jeg på konservatoriet. Så jeg fik aldrig uddannelsen, men så fik jeg så meget andet, smiler Helle Hanskov Palm, som vi møder, efter hun har været til en særlig fotosession i anledning af 100-års-fejringen. Tid og sted forsvandt Faktisk var det en særlig oplevelse i barndommen, som i sin tid fik Helle Hanskov Palm – og faktisk også hendes to søstre – til at gå den musikalske vej: - Jeg kan stadig huske min egen første, store musikoplevelse som måske 10-årig i Tivolis Koncertsal. Vi hørte Mendelssohns Violinkoncert, og det var, som om jeg gik ind i en boble, hvor tid og sted forsvandt. Nu er det over 50 år siden, men lige siden dengang har jeg ønsket at skabe den oplevelse for andre. Man behøver ikke at føle, at man skal forstå musikken, hvis man bare lader sig flyve med. Det vil altid være den største gave, vi som orkester kan give til publikum, siger hun. Da hun kom til DR Symfoniorkestret i 1985, var det et mindre orkester end i dag. Omdrejningspunktet var Radiohuset på Frederiksberg og Radiohusets Koncertsal. Torsdagskoncerterne, som DR har holdt helt siden september 1933, var det centrale i musikernes arbejde, og derudover var der også en række turneer og pladeindspilninger. Dengang var det ikke usædvanligt, at musikerne var afsted for eksempel tre uger i Tyskland på turné. Arbejde som en elitesport - Der er virkelig sket en stor udvikling for orkestret de senere år, og det har været en helt fantastisk rejse. Jeg forklarer ofte vores arbejde som en elitesport. Man skal træne for at holde formen i top, hvis man vil levere på højt plan, siger Helle Hanskov Palm. Én af de helt markante ændringer skete, da DR Koncerthuset åbnede i januar 2009, og DR Symfoniorkestret dermed flyttede fra Radiohusets Koncertsal til Koncertsalen i DR Byen. - Salen skulle jeg lige vænne mig til, men det er jo en helt fantastisk sal. Og lige pludselig kunne vi høre hinanden. Akustikken var helt anderledes end i Radiohuset, siger Helle Hanskov Palm, der også oplevede, at kravene blev flere. - En chefdirigent som først Rafael Frühbeck de Burgos (2011-2014, red.) stillede højere krav, end vi havde oplevet tidligere, og det samme gør Fabio Luisi, som vi fik som chefdirigent i 2017. Han kan på en positiv måde få os til at spille bedre. Der står stor respekt om ham, vores kemi med ham er god, og han har løftet orkestret. Jeg føler mig enormt privilegeret, siger Helle Hanskov Palm, der også oplever, at orkestrets medlemmer er blevet bedre til at støtte hinanden. Blandt andet når der skal øves. - Er der for eksempel en, der kender værket godt, læner vi også op ad hinanden og deler erfaringer. Der var ikke helt det samme sammenhold, da jeg startede i orkestret, og vi er også blevet gode til at være sociale sammen. Det er blevet en mere harmonisk gruppe, siger førsteviolinisten. Opgaverne er også blevet flere og anderledes end i starten, og i dag kommer DR Symfoniorkestret ud til et bredere publikum end i 1985. Der er både radiotransmissioner, koncerter på tv, en kanal på YouTube, albumudgivelser, turneer og meget andet. Skulle lige vænne sig til kameraerne - Noget, der er helt mærkbart forandret, er, at DR Symfoniorkestret er kommet mere på TV. Der går jo næsten ikke en uge, hvor vi ikke er det. Først skulle vi lige vænne os til kameraerne, men det har vi for længst nu. Selv synes jeg for eksempel, det har været sjovt at skulle levere musikken til ’Den klassiske musikquiz’ på DR2 og DRTV. Hvor tit kommer du ellers til at spille musik baglæns, spørger Helle Hanskov Palm. Skal hun sige det, er hun vildest med at spille de mere ’klassiske’ værker af de store komponister, men det har været spændende udfordringer at give de såkaldte ’konceptkoncerter’, hvor DR Symfoniorkestret for eksempel byder på musik fra de bedste adventurefilm, Hollywood-klassikere, computerspil eller 100 års Disney-produktioner for blot at nævne nogle. De tiltrækker også et andet publikum, så flere bliver nysgerrige på DR Symfoniorkestret. - Turneerne er også stadig noget særligt. Man bliver udfordret, man får prøvet nye koncertsale, og der bliver stillet andre krav, ligesom du oplever kollegerne på andre måder end i hverdagen, siger Helle Hanskov Palm, der senest udenlands har spillet i Royal Albert Hall i London, da DR Symfoniorkestret i sensommeren spillede ved promenadekoncerterne, det traditionsrige BBC Proms. - Vi har et godt publikum herhjemme, men det var også en helt særlig oplevelse at opleve englænderne. Taget løftede sig i Royal Albert Hall, og englænderne blev meget entusiastiske og begejstrede, beretter hun. Emil Holms violiner bruges stadig Selv synes hun, det er imponerende, at det orkester, hun nu har tilbragt over 40 år i, fylder 100. - Det var godt tænkt af Emil Holm (DR’s første chef, red.), at han grundlagde det, og selv om det er længe siden, han døde, sætter han stadig spor. Emil Holm indkøbte virkeligt gode violiner, som fortsat bliver brugt af orkestret, siger Helle Hanskov Palm. Ligesom hun som otteårig fik en helt særlig koncertoplevelse, som gav hende lyst til selv at spille, har det gennem alle årene betydet meget for Helle Hanskov Palm at give koncertgængerne en musikalsk oplevelse og en særlig følelse i fantastiske koncertsale. - Den dag, jeg ikke skal spille her og ikke have den oplevelse, bliver speciel. Det bliver en svær beslutning at tage, når jeg skal stoppe. Den skal heldigvis ikke træffes lige nu, smiler Helle Hanskov Palm. - • Læs mere om DR Symfoniorkestrets 100-års fejring her. - •",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T074500Z",
    "date_download": "2025-10-22T09:15:12.104824+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/om-dr/nyheder/dr100/helle-har-spillet-laengst-i-dr-symfoniorkestret-disciplinen-er-en-anden-end-da",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ae7d5172f45b30e8940ca82b1440fb55",
    "processed_at": "2025-10-22T11:16:30.290419",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the history and experiences of a violinist in a symphony orchestra, focusing on music and performance rather than artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/penge/stoerste-dyk-i-fem-aar-guldprisen-faldt-med-seks-procent/10984675",
    "title": "Største dyk i fem år : Guldprisen faldt med seks procent",
    "text": "Efter en hæsblæsende fremgang og den ene rekord efter den anden i 2025 dykker guldet kraftigt. Prisen på det ædle metal faldt tirsdag aften med 5,6 pct. til omtrent 4111 dollars per ounce, men den var tidligere også i minus med så meget som 6,3 pct. i 4082 dollars. - Handlere tager gevinster hjem efter et meget robust rally (periode med vedvarende optur, red.), siger Bart Melek, som er global chef for råvarestrategi hos TD Securities, til Bloomberg News. Guldprisens vilde ridt har fået mange til at springe på. Men nogle har også valgt at gå andre veje. Og eksperter vurderer, at en overset investering kan fordoble på et år. Nyt fra Trump Tirsdagens tilbagegang skyldtes dels, at investorer har taget gevinst hjem, men der blev også trykket på salgsknapperne på grund af en styrkelse af den ellers hårdt prøvede dollar. Frasalget skete i kombination med mindre ængstelse omkring handelskrigen mellem Kina og USA, da USA's præsident, Donald Trump, mandag sagde, at alt nok skal 'blive godt' med Kina. - Når der hurtigt kommer så mange penge ind i et segment, er det helt naturligt at forvente, at nogle af de penge også forlader det igen, når folk har fået en hurtig gevinst, siger Helen Amos, råvareanalytiker hos BMO Capital Markets. Kan stadig fortsætte op Verdens største guldkøber, Indien, fejrer i disse dage desuden Deepavali, en stor hinduistisk festival, hvilket betyder, at en del af efterspørgslen i markedet holder fri. Det ædle metal satte ellers rekord så sent som mandag aften med en slutnotering i 4356,30 dollars per ounce efter en hæsblæsende stigning i 2025 på 67 procent og efter en fremgang siden starten af august på 31 procent - Det signalerer ikke nødvendigvis slutningen på bullmarkedet for denne aktivklasse. Men den slags vilde bevægelser efter meget stærke stigninger kan skabe en vis frygt blandt investorer og handlere, lyder det fra Matt Maley, chefstrateg hos Miller Tabak. Tirsdagens prisfald er samtidig det største af sin slags siden august 2020, og da tirsdagens fald var størst, skulle man helt tilbage til april 2013 for at finde et større minus. Den store fremgang for guldprisen i år har været drevet af, at investorerne i højere grad har valgt at søge sikkerhed fra handelskrig, geopolitiske spændinger og krige. Udviklingen kommer også af en uforudsigelig amerikansk politik, herunder angreb på centralbankens uafhængighed i USA og forhøjede prissætninger i aktiemarkedet. Det er blevet døbt 'debasement trade' eller på dansk 'forringelseshandel', hvor investorerne tilmed skyer de ellers så sikre amerikanske statsobligationer. Tirsdag falder sølvprisen også på spotmarkedet med 7,7 procent til 48,40 dollars per ounce.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T083000Z",
    "date_download": "2025-10-22T09:15:14.248971+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/penge/stoerste-dyk-i-fem-aar-guldprisen-faldt-med-seks-procent/10984675",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0848c177e4a5c2d44cfbda3cad335fe6",
    "processed_at": "2025-10-22T11:16:30.290462",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the fluctuations in gold prices and factors influencing the commodity market, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/penge/fra-aalborg-til-dubai-ukendt-rigmand-har-danmarks-vildeste-garage/10983411",
    "title": "Fra Aalborg til Dubai : Ukendt rigmand har Danmarks  vildeste garage  ",
    "text": "Abonnementet kan opsiges når som helst til udløb af indeværende betalingsperiode. Samlet mindstepris svarer til prisen på den første betalingsperiode. Herefter kan abonnementet opsiges med løbende måned plus én måneds varsel.Fortrydelsesret i medfør af forbrugeraftaleloven - læs mere her. Faste intropriser for 3 mdr. til nye kunder, der ikke har været kunder hos Ekstra Bladet+ de seneste seks mdr. v/betaling med kreditkort el. MobilePay. Fortsætter som løbende abonnement efter de første 3 mdr. Samlet mindstepris svarer til prisen på den første betalingsperiode. Abonnementet kan når som helst opsiges til udløb af indeværende betalingsperiode.Fortrydelsesret i medfør af forbrugeraftaleloven - læs mere her.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T083000Z",
    "date_download": "2025-10-22T09:15:14.308643+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/penge/fra-aalborg-til-dubai-ukendt-rigmand-har-danmarks-vildeste-garage/10983411",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "db70f1a6dc4c17084002f616fa047f99",
    "processed_at": "2025-10-22T11:16:30.290483",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article content does not mention artificial intelligence or any related topics. It appears to focus on subscription terms and conditions, which are unrelated to AI.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/nyheder/eu-reagerer-paa-kinas-trusler/10984754",
    "title": "EU reagerer på Kinas trusler",
    "text": "EU har brug for hurtigere at få adgang til kritiske råmaterialer. Derfor vil EU-Kommissionen nu accelerere arbejdet for at få adgang til de vigtige råmaterialer, der er afgørende for grøn teknologi og en lang række digitale produkter. Det siger EU-Kommissionens formand, Ursula von der Leyen. Udmeldingen kommer i en tale til EU-Parlamentet onsdag, efter at Kina har begrænset EU's adgang til sjældne jordarter. - Jeg vil foreslå yderligere tiltag. Og jeg vil accelerere de tiltag, vi allerede har foreslået, siger von der Leyen. EU og EU-landene har i en årrække været tøvende, mens Kina har formået at sætte sig på en lang række kritiske råmaterialer. Lige fra lithium, der er afgørende for batterier til elbiler, til sjældne jordarter, som er afgørende for stort set alle elektriske produkter med digitale komponenter. Det vil sige alt fra køkkenmaskiner til avanceret militært udstyr. Den manglende adgang til kritiske råmaterialer truer Europas mulighed for at være førende i den grønne omstilling, siger von der Leyen: - Der er en grund til, at Kina massivt investerer i grøn omstilling og batterier. - De ser en markedsmulighed. De ser fremtiden, siger von der Leyen. EU har i de seneste uger fået en skræmmende advarsel om, hvor sårbare europæiske virksomheder er over for Kinas dominans på området for kritiske råmaterialer. Kina har indført eksportkontrol på sjældne jordarter. Ifølge EU-Kommissionen er det i øjeblikket kun omkring halvdelen af ansøgningerne fra europæiske virksomheder, der bliver godkendt. Det kan true produktionen, job og i sidste ende EU's mulighed for at agere uafhængigt på verdensscenen. Derfor skal Europa gøre mere for at få adgang til de kritiske råmaterialer, siger von der Leyen. - Vi har ikke råd til at falde ned i nye, farlige afhængigheder. Vi har set, hvad der sker, når et enkelt land får kontrol med kritiske produkter og teknologier. - I ethvert øjeblik kan vores afhængighed bruges til pression. - Eksportrestriktioner kan blive indført over natten, og virksomheder i Europa kan blive tvunget til at begrænse deres produktion, siger von der Leyen. Ud over at accelerere indsatsen for selv at få adgang til de vigtige råmaterialer har EU-Kommissionen også intensiveret kontakterne til de kinesiske myndigheder. EU-Kommissionens handelskommissær, Maros Sefcovic, har inviteret kinesiske repræsentanter til Bruxelles i de kommende dage for at diskutere adgangen til sjældne jordarter. - Kinas begrænsninger på eksport af sjældne jordarter er uretfærdig og skadelig. - Det underminerer vores bilaterale forhold, sagde Maros Sefcovic tirsdag. Møderne kommer på et kritisk tidspunkt, hvor forholdet mellem EU og Kina bliver stadig mere anstrengt. Det er nemlig ikke kun EU, der er utilfreds. Kina er på sin side rasende over den hollandske regerings beslutning om at tage kontrol med den kinesiskejede chipproducent Nexperia. Nexperia er baseret i Holland, men ejet af Kina. Beslutningen skyldes ifølge den hollandske regering, at Kina er ved at true 'beskyttelsen af vigtig teknologisk viden og kapacitet på hollandsk og europæisk jord'. Eller sagt med andre ord: Ligesom med de sjældne jordarter er Kina ved at begrænse Europas adgang.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T083000Z",
    "date_download": "2025-10-22T09:15:14.464626+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/eu-reagerer-paa-kinas-trusler/10984754",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a4efe8c44f4aa6ba28a6ecf516678001",
    "processed_at": "2025-10-22T11:16:30.290525",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the EU's response to China's restrictions on critical raw materials and does not focus on artificial intelligence or related technologies. While it mentions digital products, it does not delve into AI topics specifically.",
      "keywords": [
        "EU",
        "China",
        "critical raw materials",
        "green technology",
        "digital products",
        "export control"
      ]
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293308/openai-er-klar-med-sin-foerste-ai-browser-her-er-atlas-det-kan-den-nye-browser",
    "title": "OpenAI er klar med sin første AI - browser : Her er Atlas - det kan den nye browser",
    "text": "Det har ligget lige til højrebenet, og nu er OpenAI klar med sin nye og længe ventede første webbrowser, som skal tage kampen direkte op med Googles i dag altdominerende Chrome-browser. Den nye AI-browser fra OpenAI hedder ChatGPT Atlas. Motoren under browseren er i sagens natur OpenAI's avancerede AI-systemer - og i sigtekornet er de 800 millioner mennesker, der i dag ugentligt anvender ChatGPT. Dem vil OpenAI gerne have endnu bedre fat i ved at tilbyde dem mulighed for at foretage også deres søgninger og deres internetbrowsen i et OpenAI-produkt. Reuters skriver, at den nye browser kan sætte yderligere skub i det store skifte over mod AI-baserede søgninger på nettet - hvor det i dag er Google-algoritmen, der sidder på nærmest hele markedet. Der er allerede i dag tydelige tegn på, at søgninger bevæger sig hurtigt over mod en mere dialog-orienteret facon, hvor brugerne i stigende grad ønsker at være i samtale med søgemaskinen - og få præcise svar. Der findes i dag allerede en stribe AI-baserede browsere. De tæller blandt andet Comet fra Perplexity, Brave Browser og Neon fra Opera. OpenAI's store fordel er her de mange brugere, som allerede i dag anvender ChatGPT. I Atlas kan man få direkte adgang til ChatGPT, som kan opliste søgeresultaterne, sammenligne produkter og analysere data på ethvert site, som man tilgår via Atlas-browseren. Via betalingsversionen af ChatGPT kan man få AI'en til at optræde i 'agent mode,' hvor AI'en handler på ens vegne i Atlas. Det gør, at AI'en eksempelvis kan finde, bestille og betale en given rejse på internettet via Atlas helt selv. Eller at den selv kan finde en opskrift og indkøbe alle ingredienserne uden menneskelig indblanding. Atlas er i første omgang tilgængelig til macOS. Senere vil følge versioner til Windows, iOS og Android.",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:18.598263+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293308/openai-er-klar-med-sin-foerste-ai-browser-her-er-atlas-det-kan-den-nye-browser",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "10dda91e20afae8ce85821c424ecd72b",
    "processed_at": "2025-10-22T11:16:30.290559",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Technology and Infrastructure",
      "explanation": "OpenAI: The article discusses OpenAI's new AI browser, ChatGPT Atlas, and its features that leverage AI technology for web browsing and search functionalities. It focuses on how AI is integrated into the browser and its implications for user interaction with search engines.",
      "keywords": [
        "OpenAI",
        "AI-browser",
        "ChatGPT Atlas",
        "AI-system",
        "AI-based searches",
        "dialog-oriented",
        "agent mode"
      ]
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293309/ny-film-klar-paa-fredag-naar-verden-er-20-minutter-fra-undergang",
    "title": "Ny film klar på fredag : Når verden er 20 minutter fra undergang",
    "text": "Voksede man op i 1970’erne og 1980’erne, var der hverken Onkel Reje eller John Dillermand i fjernsynet. Næh, dengang var radio og tv for børn tit noget med hånddukker eller langskæggede mænd, der jublede over Tvinds vindmølle og sang lange, bange sange om atomtruslen iført en mundering af hængemule, hønsestrik og kapitalismekritik. Nej, ikke alt var ubetinget bedre i gamle dage. Med murens fald troede vi, at atomballaden trods alt var et afsluttet kapitel. Men nu buldrer krigstrommerne desværre igen. Én god ting er dog, at vi i dag – i stedet for hippier og hængemuler – har Hollywood-film, der viser hvordan det alt for nemt kan gå rigtig galt. Sådan en film er ”A House of Dynamite” af Kathryn Bigelow med fremragende skuespillere som blandt andet Rebecca Ferguson, Jared Harris og Idris Elba i front. Her drejer Bigelow spændingsknappen helt ned på frysende 11 minusgrader, da en missilaffyring sætter USA i alarmberedskab, og der kun er 20 minutter til atomkatastrofen. Herfra udfolder filmen sig i parallelle forløb som en kirurgisk dissektion af systemer og beslutninger fra militærbasen i Alaska til Situation Room i Det Hvide Hus. Bigelow har altid haft flair for det højeksplosive – The Hurt Locker og Zero Dark Thirty er allerede moderne klassikere – men denne gang er adrenalinen blandet med et isnende fravær af helte. Kameraet dvæler ved protokoller, data og menneskelig fejlbarlighed, og spændingen opstår præcis dér, hvor systemet begynder at vakle. Det pudsige – eller skræmmende – er, at de fleste af os nok har en idé om, at det bliver allermest farligt, når impulsive brushoveder som Trump sidder med koderne til atomkufferten. Men sådan behøver det ikke nødvendigvis at være, hvis man skal tro A House of Dynamite. Den skildrer klinisk maskineriet og strukturen bag katastrofen i en verden, hvor alt kan gå galt, selv om alle handler, som de bør. Netop fordi ingen for alvor længere tror, at det værste kan ske. A House of Dynamite har kørt i et begrænset antal biografer i et par uger, men rammer Netflix på fredag 24. oktober.",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:18.767544+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293309/ny-film-klar-paa-fredag-naar-verden-er-20-minutter-fra-undergang",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4c7553aa971a679dc083cb6f755a1b22",
    "processed_at": "2025-10-22T11:16:30.290589",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a film and its themes related to nuclear threats and military decision-making, with no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.computerworld.dk/art/293195/derfor-holder-en-typisk-dansk-ceo-kun-i-syv-aar",
    "title": "Derfor holder en typisk dansk CEO kun i syv år",
    "text": "- Indblik i hvorfor hyppige direktørskift koster dyrt – og hvordan fejlrekrutteringer sker - Eksempler på it-firmaer hvor stabile ledere giver markant bedre resultater Få ubegrænset adgang til Computerworld Premium Opret et gratis intro-abonnement eller køb fuld adgang Allerede abonnent? Log ind her Gratis adgang i 14 dage Premium Intro Opret et gratis prøveabonnement og få adgang til alt Premium-indhold i 14 dage. Uden binding eller kreditkort. Kreditkort ikke nødvendigt Opret abonnement Det er gratis at oprette et Intro-abonnement, og du får adgang til Premium-artikler lige bagefter. Læs mere om Intro her. Vi sender et link til dig, som du skal anvende til at bekræfte oprettelsen. Indtast din og tryk opret. Tak for oprettelsen Vi har sendt dig en mail Du skal trykke på linket i mailen, for at færdiggøre oprettelsen. Premium i 1 måned 375 kr./mdr Ubegrænset adgang til alt Premium-indhold i 1 måned. Kan opsiges med kort varsel. Premium i 12 måneder 2.850 kr./år Billigste adgang til tusindvis af Premium-artikler. Ubegrænset adgang i 12 måneder. Hvis du vil vide mere om, hvad Computerworld Premium, så kan du læse om det her. Seneste nyt Vi samler hvert år mere end 6.000 deltagere på mere end 70 events for it-professionelle. Andre events | København Executive Conversations: Når geopolitisk usikkerhed udfordrer Danmarks digitale suverænitet Geopolitisk usikkerhed og værdikonflikter mellem USA og Europa rammer nu direkte den danske it-dagsorden. Få indsigt i konsekvenserne – og hvordan du minimerer risikoen i en ny teknologisk virkelighed. Sikkerhed | København Cyber Security Festival 2025 Mød Danmarks skrappeste it-sikkerhedseksperter og bliv klar til at planlægge og eksekvere en operationel og effektiv cybersikkerhedsstrategi, når vi åbner dørene for +1.200 it-professionelle. Du kan glæde dig til oplæg fra mere end 50 talere og... It-løsninger | Online ERP Insights 2025 Få den nyeste viden om værktøjer, der kan optimere hele din virksomhed med udgangspunkt i AI og fleksibilitet. Matas A/S Matas Group is looking for an IT Operations Specialist – Microsoft Platform Københavnsområdet Forsvarsministeriets Materiel- og Indkøbsstyrelse Midtjylland Navnenyt fra it-Danmark Netip A/S Netip A/S Norriq Danmark A/S Norriq Danmark A/S",
    "domain": "computerworld.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:18.974656+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "computerworld.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.computerworld.dk/art/293195/derfor-holder-en-typisk-dansk-ceo-kun-i-syv-aar",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "784458fb149bd3804667768a442feaee",
    "processed_at": "2025-10-22T11:16:30.290620",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses CEO tenure and the impact of leadership changes in companies, particularly in the IT sector, without a focus on artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/czjpe0193geo",
    "title": "Six dead in Russian drone and missile strikes on Ukrainian cities",
    "text": "Six dead in Russian airstrikes, hours after Trump shelves bid for Putin talks Intense Russian drone and missile strikes on cities in Ukraine have left at least six people dead, including two children, President Volodymyr Zelensky has said. Another 21 people were wounded, in another night of attacks that he said proved Moscow had not come under enough pressure for its continued war. Hours earlier, US President Donald Trump said his plans for an imminent summit in Budapest with Russia's Vladimir Putin had been shelved as he did not want a \"wasted meeting\". The Kremlin has rejected calls for a ceasefire along the current front lines made both Trump and European leaders. Meanwhile, Ukraine's military said it had attacked a Russian chemical plant in the Bryansk border region late on Tuesday with UK-supplied Storm Shadow missiles. Calling the strike \"a successful hit\" that penetrated the Russian air defence system, military officials said the Bryansk plant \"produces gunpowder, explosives and rocket fuel components used in ammunition and missiles employed by the enemy to shell the territory of Ukraine\". Zelensky, who was due to visit Swedish defence contractor Saab on Wednesday, returned from talks with Trump last Friday, having failed to persuade the US president to provide long-range Tomahawk missiles. \"As soon as the issue of long-range missiles became a little further away for us, for Ukraine, then almost automatically Russia became less interested in diplomacy,\" Zelensky said. The Ukrainian capital came under a wave of attacks overnight, the first such strikes since 28 September. A couple in their 60s were killed when a drone hit their high-rise building in the city, and four people were killed in the wider Kyiv region. Among the victims were a woman, a six-month-old baby and a girl aged 12. The capital was under a ballistic missile warning for most of the night, and echoed to the sound of explosions. By morning rescue teams fought fires in residential buildings. Across Ukraine, Russian attacks once again targeted energy infrastructure and emergency power outages were imposed in several areas. One MP in Kyiv, Inna Sovsun, told the BBC that the air raids had lasted throughout the night and were definitely an attack on the power supply: \"for the majority like myself it means we don't have electricity and we don't have water.\"",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:25.230893+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/czjpe0193geo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "688b71dd756425c637d62466c15eb512",
    "processed_at": "2025-10-22T11:16:30.290640",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses military actions and political events related to the conflict between Russia and Ukraine, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cy9pdld4y81o",
    "title": "JLR hack  is costliest cyber attack in united kingdom history , experts say",
    "text": "JLR hack is costliest cyber attack in UK history, say analysts The cyber attack on Jaguar Land Rover (JLR) will cost an estimated £1.9bn and be the most economically damaging cyber event in UK history, according to researchers. Experts at the Cyber Monitoring Centre (CMC) have analysed the continuing fallout from the hack, which halted the car giant's production on 1 September for five weeks and caused widespread delays across JLR's supply chain. According to the CMC, 5,000 businesses have been affected in total and a full recovery will not be reached until January 2026. JLR declined to comment on the research but said it is bringing portions of manufacturing back online in a phased approach. The CMC is an independent, non-profit organisation that analyses and categorises cyber events, which impact the UK financially. It has classified the JLR incident as a Category 3 event, which is significant. Category 5 is the most severe. Ciaran Martin, chair of the CMC's technical committee said: \"With a cost of nearly £2bn, this incident looks to have been by some distance, the single most financially damaging cyber event ever to hit the UK. \"That should make us all pause and think. Every organisation needs to identify the networks that matter to them, and how to protect them better, and then plan for how they'd cope if the network gets disrupted.\" This is the second report published by the CMC, which uses publicly available information, surveys and interviews with industry experts and victims to make its assessments. Although the National Cyber Security Centre also categorises cyber attacks depending on how severe they are, it does not publish its findings. The hack began in late August causing an IT shutdown and a halt in global manufacturing operations, including its major UK plants at Solihull, Halewood, and Wolverhampton. Dealer systems were intermittently unavailable, and suppliers faced cancelled or delayed orders, with uncertainty about future supply. The CMC estimated the damage to be in the range of £1.6bn and £2.1bn but predicted the most likely cost will be £1.9bn. More than half of the cost will be shouldered by JLR itself including loss of earnings and the cost of recovery. The rest is estimated to be incurred by the 5,000 firms in JLR's supply chain, as well as the local economy including hospitality and other services. But CMC researchers admit their estimates are based on assumptions about the hack as JLR has not said publicly what type of cyber attack it's dealing with. A data theft and extortion attack is far easier to recover from, for example, than a ransomware attack which scrambles a victim's computer network. A wiper attack that infects computer networks and destroys data with no hope of reversal is even more serious. Shortly after the hack was revealed on JLR, a group of hackers thought to be young, English-speaking and linked to previous high profile hacks claimed to be behind it. But this has not been confirmed. The CMC also says it has not factored in any potential ransom payment that JLR might have paid to hackers which could be in the tens of millions. Previously the CMC categorised the wave of retail hacks against M&S, the Co-op and Harrods in the spring as a Category 2 event. It estimated those cyber attacks would cost between £270m and £440m, which was lower than the £506m cited by M&S and the Co-op. Sign up for our Tech Decoded newsletter to follow the world's top tech stories and trends. Outside the UK? Sign up here.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:25.274352+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cy9pdld4y81o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3416b232b895f7185ed587290a47e180",
    "processed_at": "2025-10-22T11:16:30.290676",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a cyber attack on Jaguar Land Rover and its economic impact, without focusing on artificial intelligence or related technologies. While it mentions cybersecurity, it does not delve into AI topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cdjryg38elzo",
    "title": "UK inflation rate lower than expectations at 3 . 8 % ",
    "text": "UK inflation rate lower than expected at 3.8% The UK inflation rate has remained stable at 3.8% in September, which was lower than expected, official figures show. Prices for groceries also rose at their slowest rate in more than a year, according to the Office for National Statistics (ONS). ONS chief economist Grant Fitzner noted that the cost of food and non-alcoholic drinks fell, \"for the first time since May last year\". Chancellor Rachel Reeves said she was overall \"not satisfied with the numbers\" on inflation, while shadow chancellor Mel Stride said it was \"pushing up the cost of living\". Britain's inflation rate was also 3.8% in July and August, according to the ONS, which is still much higher than the Bank of England's 2% target. However, the central bank's economists had forecast inflation to rise to 4% in September. Mr Fitzner said: \"The largest upward drivers came from petrol prices and airfares, where the fall in prices eased in comparison to last year.\" He added: \"These were offset by lower prices for a range of recreational and cultural purchases including live events.\" The inflation rate for food and non-alcoholic drinks was 5.1% in the year to August and is now down to 4.5% for the year to September - a small difference that might not always be easy to spot at the supermarket. Mr Fitzner told BBC Radio 4's Today programme he thinks food prices are still \"running quite high at 4.5%\" but added \"the fact that we have seen that steady increase dip a little is encouraging.\" \"It is just one month's numbers so we will have to see what transpires in future months - but nonetheless a small glimmer of hope there,\" he said. Paul Dales, chief UK economist for Capital Economics, said while food price inflation could rise further, \"this will probably be the peak in inflation\". The chancellor said: \"I am not satisfied with these numbers. For too long, our economy has felt stuck, with people feeling like they are putting in more and getting less out.\" Reeves added that she was determined to ensure the government supports people \"struggling with higher bills and the cost of living challenges, deliver economic growth and build an economy that works for, and rewards, working people.\" In a post on X, the shadow chancellor said that inflation running at nearly double the Bank of England's target was \"pushing up the cost of living and punishing those Labour promised to protect\". Stride claimed national insurance increases, government borrowing and not having \"the backbone to reduce spending\" were all contributing to inflation. The overall inflation figure for September matters more than most other months. That's because the government usually uses this as the bench-mark for the benefits uprating in April. It means millions of people depending on benefits are likely to see a 3.8% increase in their payments next year. The state pension will rise by more, because the annual increase for that is determined by the so-called triple lock. This guarantees that the state pension goes up each year in line with either inflation, wage increases or 2.5% - whichever is the highest. September's inflation figure of 3.8% is below average earnings for the relevant period (4.8%) which means the rise in wages will decide the state pension increase. The inflation figures for the past three months were the joint-highest recorded since January 2024, when the rate was 4%, according to the ONS. Inflation in the UK remains well below the 11.1% figure reached in October 2022, which was the highest rate for 40 years.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:25.311801+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cdjryg38elzo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "74713dc2a36da727c72114b48e7f6c06",
    "processed_at": "2025-10-22T11:16:30.290700",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses UK inflation rates and economic factors, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/ckg4d47r1wzo",
    "title": "Labubu : Australian man charged with stealing dolls worth $5 , 000",
    "text": "Australian man charged with stealing Labubus worth $5,000 An Australian man has been charged after police allege he stole dozens of Labubu dolls worth around A$9000 ($5,800, £4,400). Victoria Police raided a property in Melbourne on Tuesday, seizing 43 of the dolls, some of which were limited edition and worth up to A$500 each. Detectives say the collectables were nabbed from a shopping centre during four separate robberies that have taken place since July. The elf-like creature from Chinese maker Pop Mart have plush bodies and vinyl faces, adorned with pointy ears and a mischievous grin showing exactly nine teeth. They have become hugely popular around the globe, sparking long queues outside shops and fuelling massive profits for their maker. In a press release entitled \"These Labubu are not for you you\", Victoria Police said the 40 year-old man has since been charged with four counts of burglary and two counts of theft. He was released on bail and will appear before Melbourne Magistrates court in May next year. Launched in 2019, Labubu dolls have helped Chinese retailer Pop Mart become a major retailer, operating more than 2,000 vending machines and stores around the world. They have taken off globally, especially in the US, thanks to celebrity endorsements by including celebrities like Kim Kardashian and Lisa from K-pop group Blackpink. However, Pop Mart's shares dipped in recent weeks over concerns raised by banking giant JPMorgan that it was overvalued and that the company would be able to sustain the level of global popularity it had seen so far.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:25.819724+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/ckg4d47r1wzo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3ac9309beb09d845dd1344776e423aa3",
    "processed_at": "2025-10-22T11:16:30.290725",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a theft case involving collectible dolls and does not mention artificial intelligence or related topics. It focuses on a criminal incident rather than any AI applications or technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cqjwdgvz95no",
    "title": "Tribute to  good and kind  woman found dead in Southampton",
    "text": "Tribute to woman whose death sparked murder probe A family has paid tribute to a 38-year-old woman whose death at a property in Southampton prompted a murder inquiry. Police were called by ambulance crews on Sunday 5 October after Margarida Ressurreicao was found dead at an address on Redwood Way shortly before 13:40 BST. Her family, who are being supported by specialist officers, described her as \"a very good and kind person\" who will be \"deeply missed\". Hampshire and Isle of Wight Constabulary said a 39-year-old man from the city arrested on suspicion of murder has been released on conditional bail until 5 January while inquiries continue. Paying tribute, Ms Ressurreicao's family thanked \"everyone who has sent their condolences\". The family also urged anyone with with \"any information about Margarida that you think might be useful\" to contact police. You can follow BBC Hampshire & Isle of Wight on Facebook, X (Twitter), or Instagram.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:26.681494+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cqjwdgvz95no",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a79f468551d13a42eed01ef8708f5d95",
    "processed_at": "2025-10-22T11:16:30.290743",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a murder inquiry and pays tribute to a deceased woman, with no mention or relevance to artificial intelligence topics.",
      "keywords": [
        "murder",
        "inquiry",
        "tribute",
        "death",
        "Southampton"
      ]
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cz6n1w80z1zo",
    "title": "Eurostar orders first double - decker trains",
    "text": "Eurostar orders first double-decker trains Eurostar has revealed plans to run double-decker trains through the Channel Tunnel for the first time. The cross-Channel rail operator has confirmed it will order up to 50 trains from manufacturer Alstom, eventually increasing the size of its fleet by nearly a third. The expansion plans would include investing heavily in a crucial London depot, it said. But questions remain over whether the facility has enough space for both Eurostar and potential rival operators to use it. In the €2bn (£1.74bn) deal, confirmed on Wednesday, Eurostar has ordered 30 \"Celestia\" trains, with the option for 20 more. Eurostar expects to start using the first six trains in 2031. Each train would be 200m long. If two were run together, as happens currently, the resulting 400m service would have about 1,080 seats. These would be the first double-decker high-speed trains to run through the Channel Tunnel. The only other double-decker to ever appear on Britain's railways was an experiment that began in 1949. Eurostar's chief executive Gwendoline Cazenave said she was \"particularly proud to bring double-decker trains to the UK for the very first time\", adding they would bring \"exceptional comfort\". Eurostar carried 19.5 million passengers last year. Ms Cazenove said the company aimed to grow this number to 30 million. The firm said a fleet of new trains, some of which will replace older ones, will lead to a 30% increase in trains that service London. The double-decker train deal comes after Eurostar announced an expansion plan in June that includes new routes to Geneva and Frankfurt from London. However, double-deckers becoming the norm across the Britain's rail network seems unlikely. Pete Waterman, music producer and train enthusiast, told the BBC's Today programme because Britain's railways were built so long ago, most the routes would not be able to cater for such large trains due to obstructions such as tunnels and overhead lines. Such costs to adapt the network would be \"absolutely astronomical,\" he said. \"Although Eurostar is to be applauded for announcing this, you can only get into St Pancras because most of British railways you can't put double deckers on because our railways were built 200 years ago, not just after the Second World War,\" he added. Depot question Eurostar also said it would invest €80m developing the Temple Mills depot in London, which is the only depot in the UK able to accomodate the larger trains used in continental Europe. That depot, owned by the government's London St Pancras Highspeed organisation, is currently exclusively used by Eurostar. Eurostar is also the only company currently offering cross-Channel rail services between London and Paris, but others want to set up rival services. Those companies include Spanish start-up Evolyn, Sir Richard Branson's Virgin and a partnership between Gemini Trains and Uber. The Office of Rail and Road is reviewing proposals from these firms to use Temple Mills, as well as Eurostar's plans to increase services. The regulator is expected to make a decision on access to the depot within weeks.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:26.751991+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cz6n1w80z1zo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d181e4f92084946f0d6da2fc47fb507b",
    "processed_at": "2025-10-22T11:16:30.290775",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Eurostar's plans to order double-decker trains and does not mention artificial intelligence or related topics. It focuses on rail transport and infrastructure rather than AI.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy7j9z7e7no",
    "title": "Nigeria farmers on the frontline against Boko Haram :  We fear for our souls  ",
    "text": "'We fear for our souls' - Nigerian farmers need armed guards to protect them from jihadists As women water vegetables and uproot weeds in a rural corner of north-eastern Nigeria, men in uniform stand guard nearby holding huge rifles. They are Agro Rangers - a special security unit set up by the government to defend farmers from militants from jihadist groups Boko Haram and Islamic State West Africa Province (Iswap), who can strike farms in Borno state at any time. \"There is fear - we fear for our souls,\" Aisha Isa, 50, tells the BBC as she tends to her crops. Because it is no longer safe for her family to live in the home they fled 11 years ago, she and many others like her are bussed into Dalwa village from a pick-up point in the state capital, Maiduguri, early in the morning. It is less than an hour's drive away. She now lives in temporary housing, and growing beans and maize remains the only way for her to feed her family, she says. \"We will take the risk and come even if the rangers are not coming.\" Here, the military has marked out a stretch of land, surrounded by clearly defined trenches, where people can plant their crops. If they venture beyond that border, the threat of Boko Haram looms large. \"We have been hearing people are being kidnapped,\" says 42-year-old Mustapha Musa. \"Some are killed. That is why I'm scared and don't want to come without security protection.\" The father of 10 says he left his village, Konduga, 13 years ago and will not resettle there until the government brings about lasting security. In the 15 years since the Islamist insurgency began in north-eastern Nigeria, thousands of people have died and millions have been forced from their homes. The number of people killed in targeted attacks on farmers this year has more than doubled since 2024, according to research by the Armed Conflict Location and Event Data (Acled) monitoring group. Yet the governor of Borno state is speeding up the reintegration of displaced people from camps back onto the land - as part of his stabilisation agenda, and to counter disruptions in food production. Almost four million people face food insecurity across conflict zones in Nigeria's north-east, the UN warns. But some aid agencies say move to relocate farmers to boost agriculture has moved too fast. International Crisis Group, a non-profit organisation focused on resolving deadly conflict, says the policy is putting internally displaced people in danger -highlighting that militant groups extort farmers in areas that it controls to raise funds for its violent extremism. Kidnapped along with nine other farmers and still terrified long after the ordeal, Abba Mustapha Muhammed has seen first-hand what happens when victims do not pay up. \"There was one that got killed because he couldn't pay the ransom. His family could not meet the time given,\" says Mr Muhammed. \"He was killed and thrown away. They asked the family to come and take the dead body.\" Being held captive in dense forest for three days was \"unbearable\", he says. \"The small meals they prepared often left us feeling hungry and gave us diarrhoea. There was no clean drinking water.\" The father-of-three tells the BBC he is too afraid to return to subsistence farming because \"the insurgents are still lurking. Just yesterday, they abducted over 10 people\". Despite stories like these, Mohammed Hassan Agalama, the commander who leads the Agro Rangers scheme in Borno, insists that the guards deter militants from staging violent assaults. \"We have not encountered more terrorists coming to attack the farmers because they know that we are fully on ground at the time of farming season,\" says Cdt Agalama, who operates under the Nigeria Security and Civil Defence Corps (NSCDC). James Bulus, a spokesperson for the NSCDC, argues that the government is making gains in its fight against the insurgents, telling the BBC: \"The harvest alone is there to tell you that normalcy has returned, and farmers are doing their normal businesses in the farm.\" However, he admits that resources are inadequate. Agro Rangers is a small-scale project and not a long-term solution for widespread regional insecurity. \"We cannot be everywhere. We are not spirits. Can 600 armed Agro Rangers cover the whole of farms in Maiduguri? No.\" For this reason, Nigeria's federal government says it plans to expand the Agro Rangers scheme. Acled's senior Africa analyst Ladd Serwat says this year has seen a surge in the number of reported civilian fatalities due to targeted attacks on farmers by armed groups. Furthermore, during the first half of 2025 reported killings by Boko Haram and Iswap reached their highest level in five years. Over in Maiduguri's city centre, a group of farmers gather in the home of Adam Goni, the chair of the Borno branch of the National Association of Sorghum Producers, Processors and Marketers. The men sit on rugs beneath the wide boughs of a tree, while two women sit on mats in the shade of a nearby veranda, as goats and chickens roam the compound. The entire group has had their lives irrevocably changed by violence. Among them is Baba Modu, whose 30-year-old nephew was gunned down on his farm by Boko Haram. \"It pains me so much,\" he says. \"They killed humans like an ant, without remorse. The killings we've experienced have been devastating, but this year is the worst. When I go out to farm, there's a constant threat of being killed. I don't have peace of mind even at home - I often sleep with my eyes open, feeling like we might be attacked.\" Mr Modu sinks into his chair at times, pausing in deep contemplation. He says the constant insecurity weighs heavily on him and the community. \"Even if you are starving and food is scarce, you can't go to the farm. When we try, they chase us away or even kill us. At first, they would demand a ransom when they abducted someone, but now they collect the money and still kill the person they have kidnapped.\" Many farmers, like Mr Modu, say the militants can outnumber and overpower the Nigerian army when they attack. \"Sometimes even the security operatives run away when they see the insurgents,\" he adds. On one side of the compound, Mr Goni tends to a potato patch. He tells the BBC that he has 10 hectares (24 acres) of land ready to be harvested 8km (5 miles) away, but he is terrified to gather his crops. The owner of the neighbouring farm was killed on his land only weeks ago. \"There's no safety. We are just taking risks to go there, because when you go to farm these Boko Haram people are there,\" he says. \"If you are not lucky, they will kill you.\" Mr Goni believes the military could do more to end the conflict. \"We are very angry. We are unhappy with what is happening. If the government is serious, within a month, Boko Haram will end in Nigeria.\" Meanwhile, the NSCDC's Mr Bulus says the military is addressing the wider conflict. \"Peace is gradual. You cannot do it in one day. It has to undergo so many processes.\" But the process has taken too long for these farmers. More than 15 years on, insecurity continues to plague every aspect of people's lives. The BBC asked the Nigerian military about the farming community's claims that it has not done enough to protect them, but it has not yet responded. More BBC stories about Nigeria: Go to BBCAfrica.com for more news from the African continent. Follow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T080000Z",
    "date_download": "2025-10-22T09:15:26.803360+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cwy7j9z7e7no",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "dd1ce6431fa2ce6db15f596d1cdd2899",
    "processed_at": "2025-10-22T11:16:30.290809",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the challenges faced by farmers in Nigeria due to violence from militant groups, focusing on security issues and agricultural practices. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/commentisfree/2025/oct/22/zack-polanski-green-party-britain",
    "title": "The politics of despair have engulfed Britain . But Zack Polanski is offering a way out | Owen Jones",
    "text": "Has the grisly race to the bottom in British politics finally been halted by a Green surge? Since Zack Polanski secured the Green party leadership with an emphatic 85% vote share on an unashamedly leftwing platform, the political consensus has faced its biggest challenge since the defeat of Jeremy Corbyn’s Labour. When Polanksi launched his bid in May, the Greens counted 60,000 members. They’ve now hurtled past 130,000, eclipsing the number of Conservative members. One poll already puts them on 15%, more than double last year’s 6.2% and neck-and-neck with Labour. To call that a political phenomenon is not hyperbole. The Greens’ amateurish social-media operation has been transformed. In the place of clunky graphics and dour tweets come slick, viral videos – Polanski urging us to “make hope normal again” – or sassy celebrations of each new membership milestone. The party’s on-screen presence has evolved, too. Previous TV outings by Green politicians could be described as awfully nice but lacking in cut-through messages. Polanski, however, has embraced the Nigel Farage tactic of confrontation, whether it be championing a wealth tax, backing transgender rights without equivocation or accusing Reform UK of fascism. The radical right has excelled across the west by going on the attack and forcing its opponents into a defensive posture. Whether it be in Germany, France, Austria or the UK, mainstream parties have tried to stem the popularity of rightwing parties by responding to criticism that they have not been “tough enough” on immigration with the announcement of harsher policies and speaking in more dangerous rhetoric. This has only legitimised the ideas of the right and fuelled its ascent. In the UK, Keir Starmer has achieved the worst ratings of any prime minister ever recorded this soon into their term as Reform has shot up the polls. The Greens want to shift the conversation away from blaming migrants for all of Britain’s woes and instead point the finger at economic injustice. “Economic justice is everything,” Polanski tells me, but cites how his experience as a gay Jewish man drives his instinctive “solidarity with minority communities”. He says “economic injustice hits our minority communities even harder, so the best place we can relentlessly focus the conversation is this: a tiny few in this country hold our power, our wealth and our assets.” The task, then, is surely to focus on battles that unite – such as taxing the rich, rebuilding public services, ending privatisation – without yielding an inch on rights and equality. There’s a possible tension, though. The right’s culture wars – moral panics over minority rights – are designed precisely to smother debate about economic justice and force the left into that fatal “explaining and losing” mode. But real progressives can hardly ignore bigotry. Defending the dignity of Muslims, migrants or trans people is a moral imperative for the left. The strategy must surely focus on policies and messages that unite the diverse majority against the elites – rather than getting trapped in the right’s culture war trap. Farage also has an obvious advantage over Polanski. The British press, dominated by rightwing tabloids, has spent decades whipping up hostility towards migrants. Research by the Financial Times in 2022 found that public concern about immigration tracks newspaper coverage more closely than the actual numbers arriving on British shores. Anti-migrant sentiment is portrayed by politicians and media outlets as a legitimate concern, while demands to tax the rich or nationalise utilities are not. The political spectrum itself is skewed: the hard right is accepted as respectable, while the left is treated as an aberration. But Labour’s failings have opened new possibilities. Labour was convinced that Corbynism was a historical glitch rather than a structural response to stagnating living standards, insecurity and collapsing public services. It has also failed to understand how western complicity in Israel’s genocide has repelled a chunk of its traditional electoral coalition. How will Starmer’s Labour respond? Polanski believes it is “ideologically incapable” of countering the Green challenge by shifting to progressive territory. That is why Labour is building up Farage, rather than the Tories, as its main rival – believing it can force disillusioned voters to treat it as the lesser evil. That some form of cooperation with Your party will be required is essential. The party has so far been mired in factional squabbles, but it represents a vital constituency that can’t be ignored. The next election will be an opportunity for Your party and the Greens to speak on behalf of a huge ignored political bloc in British politics: people who support a multicultural Britain and people who want a fairer economy and society. Neither Labour nor Reform will raise issues of economic injustice given their rich donors and ideological rigidity. That’s why the Green surge, however fragile, offers something rare in modern British politics: the faint outline of an escape route from despair. - Owen Jones is a Guardian columnist - Comments will open here later this afternoon",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.118643+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/commentisfree/2025/oct/22/zack-polanski-green-party-britain",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d5f1f0030717c714fc4930b13a57b2de",
    "processed_at": "2025-10-22T11:16:30.290858",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political dynamics in Britain, focusing on the Green party and its leadership, without any mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/business/live/2025/oct/22/uk-inflation-stays-at-38-as-food-price-rises-slow-for-first-time-since-march-business-live",
    "title": "UK inflation stays at 3 . 8 % as food price rises slow for first time since March – business live",
    "text": "The surprisingly steady inflation reading may be offering some solace to the chancellor, Rachel Reeves, in Whitehall and the Bank of England governor Andrew Bailey in Threadneedle Street. Isabella Galliers-Pratt, an investment director at Rathbones, an asset manager, said: This morning’s consumer price index release delivered a modest but meaningful reprieve for policymakers and markets alike, defying expectations of a rise to 4.0% and offering a glimmer of stability ahead of the chancellor’s autumn budget on 26 November. She flagged declines in prices in food, recreation, and culture as particularly welcome, “suggesting inflationary fears linked to corporate cost pressures may be easing”. She said: Markets responded positively this morning, with government bond yields edging lower and the FTSE moving higher, offering the chancellor some breathing room given the UK’s substantial proportion of inflation linked debt. Lower inflation expectations help ease borrowing costs, improving fiscal flexibility. This backdrop also provides the Bank of England with greater scope for policy manoeuvre and may prompt speculation around a more dynamic path for the bank rate. Annual house price inflation slowed in August across the UK, while private rent rises also eased, according to official figures. The average price of a home rose by 3% to £273,000 in the 12 months to August, down from 3.2% in July, the Office for National Statistics said. Average house prices increased to £296,000, with an an annual rate of 2.9%, in England, £211,000 (2%) in Wales, and £194,000 (4.0%) in Scotland, in the 12 months to August. The average private rent rose by 5.5% to £1,354 in the 12 months to September, down from 5.7% in August. Average rents increased to £1,410 (5.5%) in England, £815 (7.1%) in Wales, and £1,004 (3.4%) in Scotland, in the 12 months to September. In Northern Ireland, average rents increased to £865 (7.1%), in the 12 months to July. Signs of peak inflation open door to earlier Bank of England interest rate cuts Has UK inflation peaked? The latest official figures showing price growth in the UK stayed at 3.8% in September seem to suggest so. The statement cannot be made with absolute certainty yet but many economists reacted to the latest consumer prices index (CPI) data with a message that the only direction for inflation over the rest of the year was down. City economists had expected the Office for National Statistics to report an increase from August’s 3.8% to 4%, and they were in good company – the Bank of England also said inflation would top out at that level last month. Food retailers had other ideas. They slowed the recent escalation in the cost of essential items, helping to ease the pressure on household budgets. Lidl GB, the UK arm of the German discount supermarket chain, believes there is still the opportunity to open hundreds more stores in Britain, its boss said this morning. We still see the opportunity for hundreds more stores. He declined to put a ceiling on Lidl GB’s store ambitions. The discounter opened 12 new stores in the year to 28 February, and intends to open 40 in the current year. Next month it will open its 1,000th store. Rival German-owned discounter Aldi has a target of 1,500 UK stores. Barclays posts dip in profits as it ups car finance compensation pot Kalyeena Makortoff Barclays has reported a dip in profits, as it became the latest high street bank to put aside hundreds of millions of pounds to compensate drivers over the car loan commissions scandal. The UK lender announced it was setting aside a further £235m, after the Financial Conduct Authority earlier this month proposed a £11bn redress programme. It takes Barclays’ total compensation pot to £325m, having first put aside £90m in February. Barclays no longer provides car finance but is dealing with the fallout for the remaining loans on its books. Last week, its high street rival Lloyds Banking Group said it was putting aside an extra £800m to deal with potential compensation, bringing its total provision to almost £2bn. Lloyds is the UK’s biggest car lender through its Black Horse division, and is due to report its third quarter results on Thursday. The new provision weighed on Barclays’ earnings, having reported a 7% drop in pre-tax profits to £2.08bn in the three months to the end of September, down from £2.2bn during the same period last year. That was compared to consensus estimates for £2.1bn. However, that did not stop the bank from announcing fresh payouts for investors. Barclays chief executive CS Venkatakrishnan said he was launching another £500m worth of share buybacks, and would be moving to quarterly payouts for shareholders – rather than waiting for half-year and end-of-year earnings to do so. “I continue to be pleased with the ongoing momentum of Barclays’ financial performance over the last seven quarters,” Venkatakrishnan said, adding that he was upgrading the profitability guidance – under a measure known as return on tangible equity – for the full-year. Eurostar to run doubledecker trains through Channel tunnel from 2031 Eurostar is to start running doubledecker trains through the Channel tunnel to meet growing demand for international rail travel from the UK – but not until 2031. The rail operator announced it had signed a €2bn (£1.7bn) deal for at least 30 – and up to 50 – new trains from the manufacturer Alstom. The doubledeckers will start operating from 2031, with each able to carry more than 1,000 passengers. Eurostar said the Celestia trains, the first high-speed doubledeckers to run on the UK mainland, would have about 20% more seats than its biggest existing trains. Some of the extra space would be taken up by stairs, but it would also be used for wheelchairs, bicycles, additional legroom and “surprises”, it said. The SNCF-owned operator plans to maintain the entire fleet at the Temple Mills depot in north-east London, which it hopes to redevelop with a further €80m investment, creating 350 jobs. Reeves says economic damage caused by Brexit forcing her to take action in budget Rachel Reeves has blamed a heavier than anticipated blow from Brexit and austerity for forcing her to take action to balance the books at next month’s budget. In her clearest attempt to draw Brexit into the framing of her imminent tax and spending decisions, the chancellor said leaving the EU was turning out to have caused more damage than official forecasters had previously outlined. The chancellor hinted she was braced for a sharp downgrade in growth forecasts from the Treasury’s independent watchdog, the Office for Budget Responsibility (OBR), alongside what is shaping up to be a crucial budget. She said at an investment event in Birmingham on Tuesday” The OBR, I think, are going to be pretty frank about this – that things like austerity, the cuts to capital spending and Brexit have had a bigger impact on our economy than was even projected back then. That is why we are unashamedly rebuilding our relations with the EU to reduce some of those costs, that in my view were needlessly added to businesses since 2016 and since we formally left a few years ago. The chancellor’s intervention comes amid growing confidence within Keir Starmer’s government to speak out about the damage of Brexit, as the decision to leave the EU almost a decade ago continues to weigh heavily on Britain’s economic performance. Real living wage to rise by almost 7% in boost for low-paid UK workers In other good news… Almost half a million workers are to receive a pay boost after it was announced that the real living wage paid voluntarily by 16,000 UK companies will rise to £13.45 an hour in April. Distinct from the national living wage, which is a statutory minimum, the real living wage is calculated each year based on the cost of essentials, and is paid by more than half of the companies in the FTSE 100. Born from a long-running campaign about the difficulties of making ends meet on poverty pay, employers can agree to pay the more generous rate. The Japanese clothing store Uniqlo, the University of Salford and Truro city council are among the latest to sign up. The real living wage will rise to £13.45 an hour nationwide from April – an increase of 85p an hour, or 6.7%. In London, it will go up 95p, or 6.9%, to £14.80 an hour. Lidl profit triples as it expands, hiring 3,000 new staff Joanna Partridge German discounter Lidl said it gained “record momentum” in Britain over the past year as its low prices attracted more customers to its stores at a time of high food price inflation and tight household budgets. The discount grocer’s pre-tax profit more than tripled in the year to the end of February, climbing to £156.8m from £43.6m a year earlier, while its revenue rose by nearly 8% to £11.7bn. It comes as Lidl is preparing to open its 1,000th British store next month and is continuing its expansion plans, with 13 new locations expected to open before Christmas. Its new store openings saw it hire 3,000 new staff in the year to the end of February. The discounter’s continued expansion plans have seen it come close to overtaking Morrisons to become the UK’s fifth largest grocer, with a current market share of 8.2% (compared to Morrison’s 8.3%) according to the most recent grocery market share data from Worldpanel by Numerator. As a result, Lidl is calling itself the “fastest-growing bricks-and-mortar grocer” and says it has held this position for over two years. The retailer said it had experienced over £400m in direct switching from its rivals, citing Worldpanel figures from February, combined with almost £500m in growth from customer loyalty, which led to an almost £900m increase in turnover. Ryan McDonnell, chief executive of Lidl GB, said: More households are choosing to shop with us more often, because we continue to deliver on our promise of outstanding quality at the lowest possible prices. Lidl said it had also upgraded some of its existing stores over the past six months, allowing it to increase its fresh produce and bakery offering, while it said its app was helping to drive footfall to its shops. The downside surprises were widespread across core goods and services, Wood said. Core goods inflation ticked down to an annual rate of 1.5% from 1.6% in August, despite the erratic games, toys and hobbies category jumping, likely driven by volatile computer games. Services inflation stayed at an annual rate of 4.7%. Wood has crunched the numbers. Clothes price inflation accelerated largely as we expected, matching the strong BRC Shop Price Index for that component, but new car prices fell 0.3% month-to-month, down from 0.1% in August and the weakest since February. Used car prices were unsurprising, rising 0.3% month-to-month. Furniture and other goods also surprised us modestly on the downside. Six of the nine high-level services sub-components we have in our table surprised us to the downside, with volatile car insurance one of the minority with an upside surprise. Accommodation services also surprised us, rising 3.2% month-to-month, up from -2.2% in August and above our call of 2.7%. Still, broadly we expected a strong month for hotel months, which had been signalled by our tracker. A large drop was always likely as airfares unwound the unusually large seasonal rise between August and September. Airfares still boosted inflation 10bp compared to August, just 1bp less than we assumed, because prices fell even faster in September 2024. Private school fees rose 4.4% month-to-month, strong given how much headline inflation has slowed from the peaks that helped support this component, but weaker than we’d expected given the possibility that schools would still be passing through the VAT hike on fees implemented in January. Elsewhere, catering services inflation ticked up to 4.3% from 4.2% in August but undershot our call, rent inflation slowed 0.1pp to 4.3%, again surprising our call, communication inflation dropped 140bp, much weaker than we assumed. Within other services inflation in our table, recreation and cultural services were much weaker than expected, falling 0.3% month-to-month. We’ll get into the details but suspect live music explains that. Again partly erratic, but part of a widespread set of downside news today. Cutting through the noise, rate setters’ measure of underlying services inflation—excluding indexed and volatile components, rents and foreign holidays—fell to 3.9% in September from 4.3% in August, the weakest since February 2022. Monica George Michail, associate economist at National Institute of Economic and Social Research, a respected think tank, expects the Bank of England to pause rates until at least February. Rob Wood, chief UK economist at Pantheon Macroeconomics, said widespread downside surprises across the inflation components raise the chances of an interest rate cut in December. September was likely the peak in this inflation hump, and it came in 20bp weaker than the monetary policy committee [MPC] and we expected. 3.8% inflation is still uncomfortable territory for the MPC, nearly double their target, and we expect the path down to 2% to be protracted. Some caveats mean we need to be cautious with this release. CPI was collected late, on September 16, compared to the September 9 date we and we think the market expected, which will have weighed on air fares and hotel prices. Underlying services inflation remains close to 4% and surveys suggest it will stay there at least until the spring. Erratic movements in some components, and a surprise in rents that the MPC look through, explain some of the downside. But those caveats fail to over-ride the dovish news completely. So the five doves on the committee will likely take heart. A rate cut by December looks likely now. We still think the MPC will skip November—the growth data and stabilising jobs suggest they can afford to wait still—and the 26 November budget also seems forth waiting for, as well as another round of inflation data. We’ll chew over the data in detail today, but our initial reaction is that we will likely bring forward our rate cut call from February to December. We’re not throwing in the towel on our structural hawkish views, as we say we think the path down for inflation will be protracted. But the doves on the MPC will want to lower rates if they can. Financial markets are betting that the next interest rate cut will come sooner than previously thought. Another reduction is now fully priced in by February, compared with March before the inflation figures, according to interest rate futures. Markets also expect more easing next year than previously, pricing in 64 basis points of Bank of England rate cuts versus 57 bps before the inflation data was released. Some economists are saying this is probably the peak in inflation. What does this mean for interest rates? Paul Dales, chief UK economist at Capital Economics, said: CPI inflation was lower than feared in September, as it stayed at 3.8% rather than rising to 4.0% or above. We doubt this will prompt the Bank of England to cut interest rates from 4% in November. But it increases the chances of the next cut happening by February in line with our forecast and it supports our view that interest rates will be reduced to 3% next year. What’s more, this will probably be the peak in inflation. Our forecast is for CPI inflation to fall to 3.5% or below in October, not least due to the declines in utility and fuel prices that we already know about. Food price inflation may yet rise further, perhaps back above 5.0% by December, but there are… good reasons to expect it to fall back next year. And if we’re right in thinking that weak employment will significantly weigh on wage growth next year, then CPI inflation may surprise most people by falling to 2.0% by the end of next year. Turning to the budget, Dales said: It’s possible the chancellor will add to that trend in the budget on 26 November, either by reducing inflation directly (cutting VAT on utilities from 5% to 0% would trim CPI inflation by 0.2ppts) or indirectly as higher taxes chip away at economic activity. Petrol prices and airfares fell last month, but not as much as a year earlier. The average price of petrol fell by 0.2p a litre between August and September to an average of 134p a litre in September, but last year prices fell by 5.5p a litre. Diesel prices were down by 0.4p a litre to 141.8p a litre. Air fares fell by 28.8% between August and September, the third-largest September decrease since the collection of airfares changed from quarterly to monthly in 2001. However, air fares fell by 34.8% a year earlier, which was the largest September drop since 2001. This meant annual transport inflation rose to 3.8% from 2.4%. This was offset by lower prices for leisure activities, in particular live music concerts, where monthly prices fell by 8.6% compared with a rise of 5.8% a year earlier. Overall, the annual inflation rate in recreation and culture fell to 2.7% from 3.2%. Introduction: UK inflation stays at 3.8% as food price rises slow for first time since March Good morning, and welcome to our rolling coverage of business, the financial markets and the world economy. UK inflation was unchanged last month, defying expectations of a rise to 4%, with food price rises finally slowing. The annual rate of inflation, as measured by the consumer prices index (CPI), was 3.8%, the same as August’s reading, according to Office for National Statistics data. Inflation is still almost double the Bank of England’s 2% target, and has been above it for 12 months in a row. The core rate of inflation, which strips out volatile food and energy costs, dipped to 3.5% from 3.6% in August. This is good news for the chancellor, Rachel Reeves. She said last week she would announce “a range of policies” in her 26 November budget to “bear down on some of the costs that people face”. Importantly, food prices dipped by 0.2% in September from August amid discounting at supermarkets, taking the annual growth rate to 4.5%, from 5.1% in August. It was the first time since May last year that food prices have fallen on the month; and the first time since March this year that the annual rate has slowed. Gold rose by 0.5% at $4,145 an ounce this morning after its biggest one-day fall in five years. The precious metal tumbled more than 5% on Tuesday, as a record-breaking rally in recent weeks reversed at the end of the Diwali gold buying season. Gold fell as low as $4,003.39 an ounce. Alex Hill, managing director at Electus Financial in Auckland, told Reuters: What goes up has to go down. You’ve had a market that’s gone parabolically higher, at some points it’s going to get some relief. Citi analysts wrote in a research note: Gold had run ahead of the ‘debasement’ story. We had flagged that prices were stretched to levels previously associated with pullbacks and had reduced our long position accordingly. The Agenda 9.30am BST: UK house prices Noon BST: US MBA Mortgage applications 1.25pm BST: ECB president Christine Lagarde speech 3.30pm BST: US EIA Crude oil stocks change 7pm BST: Annual City banquet at Mansion House and speeches",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.320053+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/business/live/2025/oct/22/uk-inflation-stays-at-38-as-food-price-rises-slow-for-first-time-since-march-business-live",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a6f2e9a4670b169f88185c9662de6b7f",
    "processed_at": "2025-10-22T11:16:30.291392",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses UK inflation, economic policies, and market responses, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/australia-news/2025/oct/22/nsw-police-officer-charged-with-grievous-bodily-harm-after-allegedly-assaulting-former-greens-candidate-hannah-thomas-ntwnfb",
    "title": "NSW police officer who allegedly assaulted former Greens candidate Hannah Thomas charged with grievous bodily harm",
    "text": "A New South Wales police officer will now face a second charge over the alleged assault of Hannah Thomas, who sustained a serious eye injury after she was arrested at a protest in June. NSW police said the 33-year-old senior constable, who last month was charged with assault occasioning actual bodily harm, was on Wednesday also charged with recklessly causing grievous bodily harm. The new charge carries a maximum penalty of 14 years in prison, and the maximum for the assault charge is five years’ imprisonment. Thomas was arrested and charged alongside four others at a pro-Palestine protest in Sydney on 27 June that was attended by about 60 people at SEC Plating. Thomas, a former Greens candidate in the prime minister’s seat of Grayndler, was taken to hospital and underwent two rounds of surgery to her right eye. She will undergo a third at the end of this month. Last month, prosecutors dropped all three charges against Thomas, who was later awarded more than $22,000 in legal costs. Charges were also dropped against three other protesters who were also awarded costs. Sign up: AU Breaking News email NSW police’s statement on Wednesday announcing the additional charge said: “As police attempted to move on some of the protesters a 35-year-old woman sustained facial injuries and was hospitalised for treatment.” Police are conducting a critical incident investigation – triggered after a person is injured or dies during a police operation – into Thomas’s arrest. The investigation is being overseen by the independent police watchdog, the Law Enforcement Conduct Commission. The officer, whose employment remains under review, is due to appear before Bankstown local court on Tuesday 18 November 2025. Separately, Thomas’ legal team is suing the state of NSW over the incident. O’Brien Criminal & Civil Solicitors announced earlier this month that their client would be claiming damages for malicious prosecution, assault and battery by police officers and misfeasance in public office. “We are seeking redress not only for Ms Thomas’s individual suffering, including the ongoing injury to her right eye, but also to uphold the broader principle that police powers must never be abused,” Thomas’ solicitor, Peter O’Brien, said at the time. The June protest took place at SEC Plating, which the protesters said was manufacturing parts used in the F-35 jet program. SEC Plating has denied this. One of the charges, which police announced it would drop prior to dropping all charges, relied on a rarely used emergency power introduced in the wake of the 2005 Cronulla riots. NSW police announced in July they were withdrawing that charge after a review into whether the charges against her were appropriate, and that she would instead face an additional charge of refusing or failing to comply with a direction – alongside her charge of resisting police. The office of the director of public prosecution, not police, dropped all charges against Thomas last month.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.354814+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/australia-news/2025/oct/22/nsw-police-officer-charged-with-grievous-bodily-harm-after-allegedly-assaulting-former-greens-candidate-hannah-thomas-ntwnfb",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "89f76f0d1b1e939d6d152ff69791c728",
    "processed_at": "2025-10-22T11:16:30.291426",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a legal case involving a police officer and an alleged assault, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/environment/2025/oct/22/country-diary-mountain-plants-take-root-in-a-derelict-chapel",
    "title": "Country diary : Mountain plants take root in a derelict chapel | Plants",
    "text": "The names of Liverpool luminaries are what bring many people to Allerton cemetery, it being the resting place of Cilla Black, Ken Dodd and Julia Lennon (mother of John). I, however, am here for the plants. On a still autumn day I make my way to the mortuary chapels, standing out in the grey with their red desert sandstone, hewn from the nearby Woolton quarry. There are three, consecrated for Church of England, nonconformist and Roman Catholic faiths. Around them, the Grade II-listed cemetery has the air of a public park with its broad central avenue, geometric design and extensive planting of evergreen species. Disused since 1975, the chapels hear no sorrowful footfall now. The windows are boarded up, the stained glass no longer dispenses prisms of light. The only visitors are the corvids, wood pigeons and gulls roosting inside and out. The external walls provide sanctuary for a surprising wealth of plants, though, for those willing to look closely. Beneath the ubiquitous buddleia bursting from the steeples and alcoves, there are refugees from mountain sites. These plants have taken root in the mortar of the buildings, the weathering composite mimicking the scree of their preferred homes. Adept at gaining their food in unusual ways, they can live without soil, absorbing nutrients from the mortar, rainfall and even bird droppings. On one wall of the central chapel, evergreen Asplenium ferns dominate: wall rue (Asplenium ruta-muraria), tiny, with club-shaped, blueish-green fronds; maidenhair spleenwort (Asplenium trichomanes), with its shiny black stems and lime-green leaflets bringing a delicate flair, usually preferring cliffs and rocky slopes; and the strap-like fronds of hart’s-tongue fern (Asplenium scolopendrium), which favours places where more water gathers. Here is a vertical rockery thriving on Edwardian walls. And there’s more: hairy bittercress (Cardamine hirsute), tiny yew saplings, and a lone polypody fern (Polypodium vulgare). In a dark, damp corner of the Catholic chapel, I find a splash of Soleirolia soleirolii, known variously as mind-your-own- business, angel’s tears and baby’s tears, tragically apposite here. Change and decay may be all around, but at the chapels, stones of deep time are embossed with the light and life that I sought.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.402769+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/environment/2025/oct/22/country-diary-mountain-plants-take-root-in-a-derelict-chapel",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a10af87865e7b19df5dbda6c7a680885",
    "processed_at": "2025-10-22T11:16:30.291454",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article focuses on the observation of plants in a cemetery and does not discuss any topics related to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/film/2025/oct/22/love-and-war-review-lynsey-addarios-photojournalist-documentary",
    "title": "Love+War review – Lynsey Addario courageous photojournalism shines out in occasionally odd study | Documentary films",
    "text": "The tumultuous life and career of Pulitzer prize-winning photojournalist Lynsey Addario is the subject of this National Geographic film, produced and directed by Elizabeth Chai Vasarhelyi and Jimmy Chin (who made the climbing documentary Free Solo and the biopic Nyad with Annette Bening as the endurance swimmer Diana Nyad). Addario’s work is certainly amazing and courageous. She has captured compelling images in Ukraine, where her picture of civilian fatalities helped mobilise western opinion against Putin; in Libya, where she was terrifyingly held captive for days along with three other colleagues from the New York Times; and across the developing world where her images of maternal death have been a spur to charitable work around the globe. Addario is a smart, candid interviewee – we also get shots of broadcast-journalism A-listers including Christiane Amanpour and Katie Couric – who is alive to the dangers of adrenalin addiction and a world in which journalists are increasingly considered fair game in war zones. She is alive also, I think, to the dangers of producing images that are too artistically beautiful. Hers is a job for tough people only; one US army officer calls her “as hard as woodpecker lips” and I believe him. But I was a little unsure of the way that this film strays almost into Hello! magazine territory by giving us quite so much of her gorgeous and colossally expensive and tasteful house in London, and her sensitive husband and adorable children. There is no reason why this talented, successful photographer should not also be rich; she deserves it. But some of these sequences look like a behind-the-scenes photoshoot of the sort generally policed by celebrity PRs. Well, the work is the most important thing and Addario’s speaks for itself.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.431468+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/film/2025/oct/22/love-and-war-review-lynsey-addarios-photojournalist-documentary",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e3d386d1d02636dc31602dd7b9a416ca",
    "processed_at": "2025-10-22T11:16:30.291479",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article focuses on the life and work of photojournalist Lynsey Addario and does not discuss artificial intelligence or related topics. It primarily covers her experiences and the impact of her photography in various conflict zones.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/world/2025/oct/22/first-edition-maccabi-tel-aviv",
    "title": "Wednesday briefing : Making sense of the Maccabi Tel Aviv saga , where law and disorder fumbled with fandom",
    "text": "Good morning. In the end, the decision that capped the controversy over the ban on Maccabi Tel Aviv fans attending their away match against Aston Villa was taken not in Birmingham, or even Westminster – but Tel Aviv. On Monday night, a statement on the team’s website said the club would be declining any allocation even if the ban was reversed. Because of “hate-filled falsehoods”, it added, “a toxic atmosphere has been created, which makes the safety of our fans wishing to attend very much in doubt”. That means that the government’s efforts to make their attendance possible are now academic. But it also heads off a potential nightmare scenario for those in the UK who have decried the ban: Maccabi fans being allowed to attend, and serious disorder breaking out as a result. With a few exceptions, there was a broad consensus in British politics that the local authority’s decision was wrong. But much of the discussion has ignored the rational case for that decision – which was taken in response to some of the worst football-related violence of recent years. Today’s newsletter attempts to unpick a tortuous political saga where fandom and antisemitism once again became a political football. Here are the headlines. Five big stories - UK news | Family courts will no longer work on the presumption that having contact with both parents is in the best interests of a child, in a landmark change that domestic abuse campaigners have said “will save so many children’s lives”. - Ukraine | Plans to hold a summit between Donald Trump and Vladimir Putin in Budapest have been put on hold as Ukraine and its European allies rallied in pushing for a ceasefire without territorial concessions from Kyiv. Last night, Russian drones and missiles killed two people in Kyiv and damaged key energy facilities. - Covid inquiry | Boris Johnson has rejected claims that his government failed to prepare for school closures at the outbreak of the pandemic, telling the Covid-19 inquiry that it would be “amazing” if the Department for Education (DfE) had not realised that plans were needed. - Environment | Coal use hit a record high around the world last year despite efforts to switch to clean energy, imperilling the world’s attempts to rein in global heating, according to the annual State of Climate Action report published on Wednesday. - Business | Almost half a million workers are to receive a pay boost after it was announced that the real living wage paid voluntarily by 16,000 UK companies will rise to £13.45 an hour in April. In depth: The mixed messages and repercussions of a controversy where all is not as it seems The Maccabi statement did not identify what finally led the club to decline any offer of tickets that might be forthcoming. But one plausible claim reported yesterday underlines what a toxic mess the situation has become: according to Jewish News, the final straw was Tommy Robinson’s promise to attend the match. A source said: “With Robinson’s supporters potentially posing as Maccabi fans on the streets of Birmingham, we concluded that the risk had become unacceptable.” In other words, even Maccabi recognised that an extremist intervention could put innocent fans at risk. Views will vary on whether that is the fault of those who ordered a ban in the first place, or those who sought to reverse a decision taken by those closest to the risk. We can, at least, try to make sense of how we got here. Why was the ban put in place? The decision was taken by Birmingham’s safety advisory group, which is responsible for issuing safety certificates for football matches, with the support of West Midlands police and the UK football policing unit. After the UK-wide body provided West Mids police with access to details of a previous outbreak of trouble in Amsterdam involving Maccabi fans (pictured above), the local force classified the fixture as high risk. Primarily on the basis of that evidence, the safety advisory group – which includes police representatives, event organisers, local authority officials and emergency planners – decided to ban Maccabi fans from attending. Vikram Dodd has a detailed report on the basis of the decision, which makes clear that it was largely the result of concerns about Maccabi fans – but also failed to consider that it might be interpreted as a surrender to antisemitism. Every English Westminster party other than the Greens opposed the decision, and the government, without directly overruling the safety advisory group, said it was working to make resources available to reverse it. Keir Starmer called the decision wrong and said “the role of the police is to ensure all football fans can enjoy the game”. That drew criticism from some with experience of similar issues, with Professor Lucy Easthope, an expert in emergency planning, warning of the appearance of interference, and saying that the prime minister had shown “terrible instincts”. Nazir Afzal, former chief executive of the Association of Police and Crime Commissioners, said: “When it comes to football related violence, the police – not politicians, not armchair pundits – know what’s safe and what isn’t.” Whose safety was at issue? One claim made repeatedly in the days since the decision was announced is the idea that Jewish Maccabi fans have been banned for their own safety. In the Spectator, Brendan O’Neill characterised the decision as “punishment of Maccabi fans to ‘save them’ from Brits who hate the Jewish homeland”. Conservative leader Kemi Badenoch said that it “sends a horrendous and shameful message: there are parts of Britain where Jews simply cannot go”. In parliament, the Labour MP Graham Stringer said: “It would be a disgrace and a shame if this country could not guarantee the security of a group of Jewish fans, coming from Israel, walking down our streets.” But those arguments seriously oversimplify the apparent basis of the ban. The trouble in Amsterdam, which has a large Muslim population, was initially characterised as an unprovoked antisemitic attack on Israeli fans. But the full picture that emerged suggested that the trouble had involved Maccabi fans attacking Muslims in the city, chanting things like “Why is there no school in Gaza? There are no children left there,” and instigating some of the earliest confrontations. There were also plainly antisemitic elements on the other side, including a call for a “Jew hunt” and what the mayor described as “antisemitic hit-and-run assaults” that drew no distinction between hooligans and ordinary fans. (We covered this at length in the newsletter last November.) Taken as a whole, the picture presented by this and other past incidents suggests that ordinary Jewish fans of Maccabi could be at risk should trouble arise in Birmingham, an obviously intolerable outcome – but that Maccabi’s hooligan element have a history of instigating disorder, and that nearby residents and fans, including members of Birmingham’s large Muslim community, would plausibly be at risk from them. What else do we know about Maccabi’s ‘Fanatic’ element? In that First Edition from last year, James Montague – an expert on football hooliganism – provided a useful explanation of the history of the “Fanatics”, the subset of Maccabi’s organised “Ultra” support who are violent. Traditionally, he said, “you have a very highly developed, very political culture” among Israeli club fanbases. Maccabi once fell in the middle of that spectrum, but that has shifted in recent years. Montague went on: You have to understand that as the politics of Israel changes, so do the politics of the Ultras. They are organised young men, many of whom have been in the IDF [Israel Defense Forces] because of conscription, and what they say and chant tracks where the country is.’ As a result, he said, there is a much stronger ultra-nationalist element within the Maccabi fanbase today. ‘That isn’t something about the club, per se. It’s something about how Israel is changing.’ In recent years, evidence has mounted of that shift. In Athens last year, Maccabi fans beat a man carrying a Palestinian flag ahead of their match against Olympiacos. They fought local residents in Cyprus in 2023 before a match against AEK Larnaca. A match against Turkish side Beşiktaş was relocated to Hungary, where it was played behind closed doors, because of fears of disorder. And there is an extensive history of racist chanting against Arabs. The chaos in Amsterdam was the most extreme example of that tendency. The Tel Aviv derby between Hapoel and Maccabi was called off on Sunday because of rioting and what Israeli police described as “risks to human life”. Ironically, there is good evidence that rather than being violence instigated by either fanbase, that disorder was the product of a growing tendency among Israeli police to target fans. This excellent Middle East Eye report has more on that. Were there other factors in the outcry over the ban? In a statement to the House of Commons, the culture secretary, Lisa Nandy, sought to put the government’s opposition to the decision in a broader context. The government’s stance, she said, was “set against a backdrop of rising antisemitism in this country and across the world, and of an attack on a synagogue in Manchester in which two innocent men were killed”. Supporters of that argument say that if the issue is whether the local police force has sufficient resources, they should be provided by central government, which Nandy said would be made available. Some have also argued that this is an attempt to introduce by the back door a ban on Israeli teams playing internationally: a petition promoted by the independent local MP Ayoub Khan before the decision was made said that “hosting such teams sends a message of normalisation and indifference to mass atrocities”. Councillors Waseem Zaffar and Mumtaz Hussain, who sit on the safety advisory group, have made the same argument. Fifa has come under pressure to institute such a ban given that some Israeli teams appear to be in breach of its rules against professional sides playing on occupied territory. Meanwhile, the Guardian’s Jonathan Liew noted the dizzying contortions that have led to “choosing to stand with the far-right foreign football hooligan against the local police force” – but also raised the “increasingly sinister securitisation of football fans at matches”. But as his piece suggests, it is possible to recognise that pattern and view the Maccabi decision as being based on a specific threat assessment, rather than evidence of a local authority cowed by antisemitism. Is there a precedent for this decision? Another claim repeated a lot in recent days – including from Nandy herself – is that this is an unprecedented step. But while such decisions are fairly unusual, it isn’t really accurate to say this is a unique case. Across the continent, there are numerous recent cases of away fans being banned from European fixtures. Feyenoord fans were banned from a game against Roma in Rome last year; Galatasaray fans were banned from Leverkusen in February; Benfica fans were banned from Marseille in April; Eintracht Frankfurt fans have been banned from attending next month’s match against Napoli. There are other examples besides. In England, Uefa banned Eintracht Frankfurt fans from Arsenal in 2019, and Red Star Belgrade fans from Tottenham in the same year. And in 2023, after violent clashes before Legia Warsaw’s match with Aston Villa, West Midlands police denied entry to all away supporters. What is true is that the Legia Warsaw case is the only recent example of a UK local authority banning away fans because of the risk of violence – and was a decision taken live, rather than pre-emptively. But it doesn’t follow that the Maccabi decision is evidence of a different analysis. Partly, it’s because such serious threats are relatively rare; and partly, it’s because where Uefa has made a decision, there is no reason for the local authority to act. What else we’ve been reading - This moving and intimate photo essay about the “hidden victims” of the opioid crisis – those who lived after overdosing, such as JB Jarrett, above – will stay with me for a long time. Aamna - This interactive offers a compelling, and utterly bleak, insight into the influence of the manosphere. One striking detail: misogynistic messages are the most dangerous result, but the thing that draws boys and young men in are the descriptions of financial success. Archie - Sanae Takaichi has made history by becoming Japan’s first female prime minister. What plans does she have for a country whose population is ageing and shrinking faster than predicted? The answer apparently lies with Margaret Thatcher. Aamna - Would you like a “Tamagotchi with a soul”? Alarming as this sounds, it’s also the basis of the Friend, a wearable AI device that’s meant to be a companion in lonely moments. Madeleine Agger spent a week with one, and it’s a relief to learn it often seemed like “the most boring person at a party”. Archie - Is Instagram a safe place for teens? The app has introduced new safety features, but culture journalist Tayo Bero is, rightly, unconvinced. Aamna Sport Football | Two goals for Viktor Gyökeres added a gloss to Arsenal’s victory over Atlético Madrid, helping the Gunners to a 4-0 win. In the night’s other Champions League fixtures, Manchester City beat Villarreal 2-0 and Newcastle beat Benfica 3-0. Rugby | England’s Emily Scarratt has announced her retirement from rugby after a 17-year international career. The two-time World Cup winner said in a statement the “time feels right to step away”. Basketball | Looking forward to the return of the NBA, which tipped off last night? Check out this handy Guardian guide to the players, teams and narratives to watch as the season unfolds. The front pages The Guardian’s page one splash is “Family law shift hailed as victory for children facing domestic abuse”. The Times has “Chancellor plans £2bn tax raid on middle class” and the i paper runs with “Benefits set to rise by 4% as problems pile up for Reeves”. “Grooming gangs inquiry in chaos” – that’s the Mail while the Telegraph covers (the lack of) Ukraine developments: “Putin defies Trump as peace talks collapse”. “Boris: Our lockdowns failed kids” – that’s former PM Johnson at the Covid inquiry, in the Metro. The Mirror promotes its Pride of Britain awards under the headline “Britain isn’t broken, you are all amazing”. Keir Starmer is shown with recipients. “Help ensure Sasha’s evil killer stays inside prison” – that’s the Daily Express wanting the deadline scrapped for appeals against lenient sentences. “Bailey hears ‘alarm bells’ over private credit after big US corporate failures” – read that one in the Financial Times. Today in Focus AI slop: Is the internet about to get even worse? Tech journalist Chris Stokel-Walker analyses the rise and rise of AI-generated video, and what it will mean for the internet and beyond. Cartoon of the day | Ella Baron The Upside A bit of good news to remind you that the world’s not all bad Toad patrol groups are popping up across the UK to protect the beloved stalwart of the British countryside. The population has almost halved since 1985, but thanks to 274 dedicated patrol groups, their fortunes may slowly start to turn around. This decline is in part due to traffic: toads travel a fair distance from where they have been hibernating (often woodland ) towards a large pond to mate. This often means travelling across country roads, but many don’t make it. It is estimated several hundred thousand toads are killed on UK roads every year. Enter toad patrol groups, who carry toads across roads in buckets, as well as counting the number (dead and alive) they find. These groups also lobby for other protection measures, such as road closures and underground wildlife tunnels. Sign up here for a weekly roundup of The Upside, sent to you every Sunday Bored at work? And finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:29.657018+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/world/2025/oct/22/first-edition-maccabi-tel-aviv",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4731ff763c8d03196cb28ba6612e318d",
    "processed_at": "2025-10-22T11:16:30.291595",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a controversy surrounding Maccabi Tel Aviv fans and issues related to football, safety, and antisemitism, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/environment/2025/oct/22/greens-say-labors-nature-laws-revamp-worse-than-status-quo-with-climate-impact-of-fossil-fuel-projects-overlooked",
    "title": "Greens say Labor nature laws revamp  worse than status quo  with climate impact of fossil fuel projects overlooked | Environment",
    "text": "Labor has confirmed the climate impact of fossil fuel projects still won’t be considered before they are approved under a revamp of federal nature laws, with the Greens labelling the government’s plan “worse than the status quo”. The Greens, opposition and select environment and business groups have been briefed on parts of the long-awaited rewrite of the Environment Protection and Biodiversity Conservation (EPBC) Act ahead of its introduction to parliament in the upcoming sitting fortnight. Environment minister Murray Watt’s hopes of passing the laws this year hinge on reaching a quick deal with either the Coalition or the Greens, neither of which are yet on board. After months of consultation, the private briefings on Wednesday confirmed how Labor intends to deal with some of the most contentious elements, including climate impact. As Watt had forecast, the laws will create a new requirement for proponents of high-polluting projects to disclose their expected greenhouse gas emissions, along with a plan to mitigate them, as part of the application process. The new rule – which would apply to projects with predicted emissions above 100,000 tonnes of CO2 equivalent each year – was a recommendation from Graeme Samuel’s review of the EPBC Act. Sign up: AU Breaking News email “By ensuring projects disclose their emissions, for the first time the public will know exactly what to expect from new projects and how they are accounting for our key climate policies, like the safeguard mechanism,” Watt said. The proposed new reporting rules fall short of the sort of mechanism the Greens and environmental groups have long called for, which would require decision-makers to consider climate impacts when assessing applications. “The minister or the EPA needs the powers to assess those emissions and, in the right circumstances, reject a project if the emissions are going to have an impact on our threatened species, for example, or on the Great Barrier Reef,” Glenn Walker, the head of nature at Greenpeace Australia Pacific, said. The legislation will also create a new definition for what constitutes an “unacceptable impact” on the environment, which, if, met would result in a project being immediately refused. Industry sources briefed on the definition said it was too broad, creating an “inexhaustible level of uncertainty”. Stakeholders were not shown the entire bill and contentious elements are yet to be finalised, including the scope of the proposed environment protection agency (EPA). The EPA’s powers have been the main sticking point for the Coalition, which want the watchdog’s role restricted to compliance and enforcement of nature laws and the minister to retain decision-making powers on projects. While the shadow environment minister, Angie Bell, was confident Labor had agreed to that model, Guardian Australia has confirmed with Watt’s office that no decision has been made. Bell, who has been positive about her negotiations with Watt so far, said the opposition would await the full draft legislation before agreeing a position because “we know the devil is in the detail”. The Greens – Watt’s other possible partner in the Senate – issued a statement condemning Labor’s plan after a briefing on Wednesday morning. “This bill has been drafted with the interests of mining industry front and centre. It weakens environmental protection. It will take us backwards and is worse than the status quo,” the Greens environment spokesperson, Sarah Hanson-Young, said. The legislation will include a provision that requires developers to achieve a “net gain” for the environment, which could be through the use of offsets. At a virtual meeting with grassroots Labor members on Tuesday night, Watt said developers would also be able to contribute to a “restoration fund” that the government would use to purchase offsets. The Biodiversity Council’s chief executive, James Trezise, said the proposed fund had “serious design flaws that could leave nature worse off”, in part because the government planned to relax “like-for-like” rules that required developers to protect the same sort of environment it had damaged. Watt used the virtual meeting to encourage Labor supporters to challenge Greens and environmentalists who claimed the laws were “no good for the environment”. “So when you’re seeing Greens or environment groups peddling this line that we’re going backwards on the environment under Labor, and under these laws, it’s completely untrue, and we need to set the record straight.” In a statement to Guardian Australia on Tuesday, Watt said: “No one will get everything they want.” “Everyone agrees that these laws are failing the environment and business – that’s why we are determined to get this legislation through the parliament,” he said. “I have always said that stakeholders would need to be willing to compromise in order to get these vital laws passed.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T083000Z",
    "date_download": "2025-10-22T09:15:29.720410+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/environment/2025/oct/22/greens-say-labors-nature-laws-revamp-worse-than-status-quo-with-climate-impact-of-fossil-fuel-projects-overlooked",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2729d78b9aa15487a1ca286d0c570c1c",
    "processed_at": "2025-10-22T11:16:30.291642",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses environmental legislation and the impact of fossil fuel projects on climate change, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.nbcnews.com/business/taxes",
    "title": "Taxes : Advice & News on Filing Taxes , Tax Cuts , and Refunds",
    "text": "The Congressional Budget Office estimates that the 10% of poorest Americans will lose roughly $1,200 a year, while the richest 10% will see their income increase by $13,600. The agency's agreement in a court filing formally reverses a decades-old provision of the tax code, but the motion would need to be approved by a judge. The emails say nearly 9 in 10 Social Security beneficiaries won't pay income taxes on their benefits in the future. But the Trump tax law did not directly address Social Security. The bill cleared a key hurdle early this morning after the president and House Speaker Mike Johnson persuaded a group of Republican holdouts to change their votes. Congress faces a self-imposed July Fourth deadline to pass the domestic policy package backed by Trump, but new polls indicate a majority of voters oppose the legislation. The lawmakers said they're \"deeply concerned\" by some of the Trump agenda bill's provisions and called for changes to mitigate \"significant disruption\" to certain projects.",
    "domain": "nbcnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:36.463361+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nbcnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.nbcnews.com/business/taxes",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2f0874a3115be4f861efb860a3c6d94a",
    "processed_at": "2025-10-22T11:16:30.291659",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses tax-related issues, legislation, and economic impacts, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/Technology/wireStory/prince-harry-meghan-join-call-ban-development-ai-126745111",
    "title": "Prince Harry , Meghan join call for ban on development of AI  superintelligence  ",
    "text": "Prince Harry, Meghan join call for ban on development of AI 'superintelligence' Prince Harry and Meghan have joined a diverse group, including Steve Bannon and Glenn Beck, to call for a ban on AI \"superintelligence\" that threatens humanity Prince Harry and his wife Meghan have joined prominent computer scientists, economists, artists, evangelical Christian leaders and American conservative commentators Steve Bannon and Glenn Beck to call for a ban on AI “superintelligence” that threatens humanity. The letter, released Wednesday by a politically and geographically diverse group of public figures, is squarely aimed at tech giants like Google, OpenAI and Meta Platforms that are racing each other to build a form of artificial intelligence designed to surpass humans at many tasks. The 30-word statement says: “We call for a prohibition on the development of superintelligence, not lifted before there is broad scientific consensus that it will be done safely and controllably, and strong public buy-in.” In a preamble, the letter notes that AI tools may bring health and prosperity, but alongside those tools, \"many leading AI companies have the stated goal of building superintelligence in the coming decade that can significantly outperform all humans on essentially all cognitive tasks. This has raised concerns, ranging from human economic obsolescence and disempowerment, losses of freedom, civil liberties, dignity, and control, to national security risks and even potential human extinction.” Prince Harry added in a personal note that \"the future of AI should serve humanity, not replace it. I believe the true test of progress will be not how fast we move, but how wisely we steer. There is no second chance.” Signing alongside the Duke of Sussex was his wife Meghan, the Duchess of Sussex. “This is not a ban or even a moratorium in the usual sense,\" wrote another signatory, Stuart Russell, an AI pioneer and computer science professor at the University of California, Berkeley. \"It’s simply a proposal to require adequate safety measures for a technology that, according to its developers, has a significant chance to cause human extinction. Is that too much to ask?” Also signing were AI pioneers Yoshua Bengio and Geoffrey Hinton, co-winners of the Turing Award, computer science's top prize. Hinton also won a Nobel Prize in physics last year. Both have been vocal in bringing attention to the dangers of a technology they helped create. But the list also has some surprises, including Bannon and Beck, in an attempt by the letter's organizers at the nonprofit Future of Life Institute to appeal to President Donald Trump's Make America Great Again movement even as Trump's White House staff has sought to reduce limits to AI development in the U.S. Also on the list are Apple co-founder Steve Wozniak; British billionaire Richard Branson; the former Chairman of the U.S. Joint Chiefs of Staff Mike Mullen, who served under Republican and Democratic administrations; and Democratic foreign policy expert Susan Rice, who was national security adviser to President Barack Obama. Former Irish President Mary Robinson and several British and European parliamentarians signed, as did actors Stephen Fry and Joseph Gordon-Levitt, and musician will.i.am, who has otherwise embraced AI in music creation. “Yeah, we want specific AI tools that can help cure diseases, strengthen national security, etc.,\" wrote Gordon-Levitt, whose wife Tasha McCauley served on OpenAI's board of directors before the upheaval that led to CEO Sam Altman's temporary ouster in 2023. “But does AI also need to imitate humans, groom our kids, turn us all into slop junkies and make zillions of dollars serving ads? Most people don’t want that.” The letter is likely to provoke ongoing debates between the AI research community about the likelihood of superhuman AI, the technical paths to reach it and how dangerous it could be. “In the past, it’s mostly been the nerds versus the nerds,” said Max Tegmark, president of the Future of Life Institute and a professor at the Massachusetts Institute of Technology. “I feel what we’re really seeing here is how the criticism has gone very mainstream.” Confounding the broader debates is that the same companies that are striving toward what some call superintelligence and others call artificial general intelligence, or AGI, are also sometimes inflating the capabilities of their products, which can make them more marketable and have contributed to concerns about an AI bubble. OpenAI was recently met with ridicule from mathematicians and AI scientists when its researcher claimed ChatGPT had figured out unsolved math problems — when what it really did was find and summarize what was already online. “There’s a ton of stuff that’s overhyped and you need to be careful as an investor, but that doesn’t change the fact that — zooming out — AI has gone much faster in the last four years than most people predicted,” Tegmark said. Tegmark's group was also behind a March 2023 letter — still in the dawn of a commercial AI boom — that called on tech giants to pause the development of more powerful AI models temporarily. None of the major AI companies heeded that call. And the 2023 letter's most prominent signatory, Elon Musk, was at the same time quietly founding his own AI startup to compete with those he wanted to take a 6-month pause. Asked if he reached out to Musk again this time, Tegmark said he wrote to the CEOs of all major AI developers in the U.S. but didn't expect them to sign. “I really empathize for them, frankly, because they’re so stuck in this race to the bottom that they just feel an irresistible pressure to keep going and not get overtaken by the other guy,” Tegmark said. “I think that’s why it’s so important to stigmatize the race to superintelligence, to the point where the U.S. government just steps in.”",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:38.812708+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/Technology/wireStory/prince-harry-meghan-join-call-ban-development-ai-126745111",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "59d475d7b7d6df5b1163bbe1179928ce",
    "processed_at": "2025-10-22T11:16:30.291709",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Ethics and Regulations",
      "explanation": "OpenAI: The article discusses a call for a ban on the development of AI superintelligence, highlighting concerns about its potential risks to humanity. It features prominent figures in the AI field and addresses ethical considerations surrounding AI development.",
      "keywords": [
        "AI",
        "superintelligence",
        "ban",
        "safety measures",
        "human extinction",
        "AI companies",
        "ethical concerns"
      ]
    }
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/fuel-truck-explodes-nigeria-kills-31-people-police-126735134",
    "title": "Fuel truck explodes in Nigeria and kills at least 31 people , police say",
    "text": "Fuel truck explodes in Nigeria and kills at least 31 people, police say Police in Nigeria say a tanker truck laden with gasoline has exploded in a north-central part of the country, killing at least 31 people ABUJA, Nigeria -- ABUJA, Nigeria (AP) — A tanker truck laden with gasoline exploded Tuesday in north-central Nigeria, killing at least 31 people, police said. The explosion occurred in the Bida area of Niger State after the truck fell and as local residents rushed to the scene to scoop up spilling fuel, police spokesman Wasiu Abiodun said in a statement. He said 17 people also were injured in the blast and were taken to nearby hospitals. In recent months, Niger State has seen a rise in accidents involving heavy-duty trucks, which analysts have blamed on bad roads and the absence of a rail network. The state serves as a major transit hub for commodities moving between northern and southern Nigeria. An investigation was underway to identify the driver, the owner of the tanker and cause of the accident, the police spokesperson said. Niger State Gov. Umaru Bago said it was disheartening to see that people try to collect gasoline from overturned tankers despite the danger. “This is yet another painful, difficult, and tragic one for the people and the state government,” Bago said. In January, at least 98 people were killed in Niger State when people tried to transfer gasoline from a crashed oil tanker into another truck using a generator. Scavenging gasoline has become common in Nigeria as fuel prices have soared following the removal of subsidies under President Bola Tinubu.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T084500Z",
    "date_download": "2025-10-22T09:15:39.031015+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/International/wireStory/fuel-truck-explodes-nigeria-kills-31-people-police-126735134",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "377be762cf8cb036e511321b9d6fa97b",
    "processed_at": "2025-10-22T11:16:30.291732",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a tragic incident involving a fuel truck explosion in Nigeria, focusing on the accident and its consequences. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/sacramento-city-council-approves-2-new-entertainment-zones-for-public-alcohol-consumption/",
    "title": "Sacramento City Council approves 2 new entertainment zones for public alcohol consumption",
    "text": "Sacramento City Council approves 2 new entertainment zones for public alcohol consumption There are more places to sip in Sacramento after the city council designated new zones where booze can be consumed in public spaces. It's part of an effort to make some Sacramento neighborhoods a little more lively. So what is an entertainment zone? \"Businesses that have an active liquor license can go ahead and sell liquor to go as part of a special event,\" said Tina Lee-Vogt, the city's nighttime economy manager. The first three zones were approved in June — across from the downtown arena, in the Lavender Heights district, and at the convention center. Two new zones are now being added in the Ice Blocks area along R Street and the Handle District near 18th and L streets. Many businesses hope it will bring in more customers. \"Midtown is so walkable, and I think having a drink and being able to walk around will just elevate the area,\" said Cassie Kelsey, general manager of 58 Degrees & Holding Co. \"This area is already a nice little hub for restaurants, and I think just bringing more entertainment and festivals to the area will help boost the restaurants in the area,\" said Malik Howard with Ailoli Bodega Español. Lee-Vogt said measures are in place to make sure outdoor drinking doesn't get out of control. \"We'll have requirements for security guards,\" she said. \"In terms of event zones, there are special cups and wristbands so we can see who's walking around with open containers.\" It's a new toast to outdoor entertainment at a time when the city is trying to bring more people back downtown. \"It does open up a lot of opportunities for more and different, unique kinds of events to take place,\" Lee-Vogt said. Future entertainment zones could be added in other commercial districts, like along Stockton Boulevard and Mack Road.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:41.185871+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/sacramento-city-council-approves-2-new-entertainment-zones-for-public-alcohol-consumption/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5fbde282bf88198bc151bec40c2f92e0",
    "processed_at": "2025-10-22T11:16:30.291757",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the approval of new entertainment zones for public alcohol consumption by the Sacramento City Council, focusing on local business and community engagement. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/pedestrian-killed-big-rig-hit-and-run-i5-yolo-county/",
    "title": "Pedestrian killed by big rig in hit - and - run on I - 5 in Yolo County , CHP says",
    "text": "Pedestrian killed by big rig in hit-and-run on I-5 in Yolo County, CHP says A man died Tuesday night after being struck by a big rig while running along southbound Interstate 5 northwest of Woodland in California's Yolo County, officials said. The California Highway Patrol's Woodland division said it happened around 8 p.m. near the Interstate 505 interchange, between Dunnigan and Zamora. Crews were already responding to a nearby medical call and were able to arrive quickly, but the man was pronounced dead at the scene. Witnesses told officers that an all-white big rig initially slowed down after the crash but then continued driving south on I-5 toward Sacramento. The CHP says the truck likely has damage to its front left corner. The CHP Woodland is asking anyone who may have seen the crash or has information about the truck or its driver to contact their office. Traffic in the area was not affected.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:41.368620+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/pedestrian-killed-big-rig-hit-and-run-i5-yolo-county/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9ccee0557d3ece57a6a245289d7b36fa",
    "processed_at": "2025-10-22T11:16:30.291774",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a traffic incident involving a pedestrian and a big rig, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/newsom-govt-shutdown-will-delays-million-of-californians-calfresh-payments/",
    "title": "Government shutdown will delay millions of Californian CalFresh payments , Newsom says",
    "text": "Government shutdown will delay millions of Californians' CalFresh payments, Newsom says On the 21st day of the federal government shutdown, Gov. Gavin Newsom is blaming the Trump administration and Republican lawmakers for what his office announced will soon be disruptions to millions of Californians' CalFresh food benefits, known federally as SNAP. \"Trump's failure to open the federal government is now endangering people's lives and making basic needs like food more expensive — just as the holidays arrive,\" Newsom said in a statement. Newsom said that more than five million Californians who utilize CalFresh's food assistance could see no money loaded onto their benefit cards in November if the government does not reopen by Thursday. Local agencies and food banks are bracing for a potential increase in need due to the delays in food assistance. \"We are preparing for thousands of additional households coming into our services,\" said Genevieve Pyeatt, director of programs for the Yolo Food Bank. Pyeatt told CBS Sacramento that the Yolo Food Band and the Yolo County Health and Human Services office have teamed up to be proactive, planning right now to host emergency food distributions at CalFresh offices in Davis, Woodland and West Sacramento starting the first week of November to help families if the government does not open back up. \"Our mission is to provide food to those that are food insecure and to our neighbors. So we take it very seriously,\" Pyeatt said. Pyeatt said the food bank has kept a close eye on the ongoing government shutdown and is preparing for an increase in need for their assistance. They are working to be ready to answer the call of community members, but it comes at a tough time for the agency. \"We experienced a huge loss in federal cuts already as a food bank, and so we had to adapt to that,\" Pyeatt said. \"Unfortunately, with less food resources, less funds, but still the need increasing, we're always kind of battling with this balance.\" Yolo is one of the most food-insecure counties in California. Pyeatt said the local need is up about 20% over the past three years, and they serve around 30,000 households each month. \"Thanks to Donald Trump and his MAGA lapdogs in Congress, the government shutdown is going to deprive millions of Californians in need of their November food benefits,\" Newsom wrote on X. \"It is long past time for the GOP to grow a spine, stand up to Trump, and stop endangering people's lives.\" President Trump pushed back on the implication that Republicans are to be blamed for the government shutdown on Tuesday at the White House. \"From the beginning, our message has been very simple. We will not be extorted on this crazy plot of theirs,\" Mr. Trump said. Republican lawmakers like Senate Majority Leader John Thune (R) also point the finger at the other party. \"We are going to keep voting to open the government and eventually, the Democrats, hopefully sooner or later, will come around,\" said Sen. Thune. Meanwhile, some California seniors living on a fixed income, like Shari Horne, feel caught off guard with their CalFresh payments in jeopardy. Horne receives a few hundred dollars a month on her CalFresh card. She cares for her husband with disabilities. \"We're very concerned. There's a lot of people here that depend on that,\" Horne said. \"It's very challenging. I hadn't thought about what we would do because I didn't know this was going to happen.\" The Yolo Food Bank is working to add those emergency food distribution events to their calendar, with dates and times still to be determined. The hope is that in the days to come, they will not be needed if the government reopens. Find food resources near you on their website. Donations and volunteers are greatly appreciated to help support community members in need.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:41.510074+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/newsom-govt-shutdown-will-delays-million-of-californians-calfresh-payments/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "fc103c61bc86a52ac5d6781635632849",
    "processed_at": "2025-10-22T11:16:30.291809",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the impact of a government shutdown on food assistance programs in California, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/deputy-u-s-marshal-injured-south-los-angeles-shooting/",
    "title": "Deputy U . S . Marshal , TikTok influencer shot during LA immigration operation",
    "text": "Deputy U.S. Marshal, TikTok influencer shot during LA immigration operation A TikTok influencer who has been documenting immigration enforcement activity has been charged with assaulting a federal officer during an operation in South Los Angeles on Thursday morning, according to the U.S. Attorney's Office. Carlitos Ricardo Parias, 44, who goes by Richard LA on social media, allegedly rammed his car into federal agents after they \"boxed him in and ordered him to submit to arrest,\" according to Acting U.S. Attorney Bill Essayli. \"Parias, who had previously avoided capture by immigration authorities, refused to comply with agents' orders and escalated what could have been a simple arrest into a life-threatening situation,\" Essayli wrote in a post to X. \"Ultimately, an agent opened fire, wounding Parias and a deputy U.S. marshal, who was hit with a ricochet bullet.\" Both Parias and the deputy U.S. Marshal are expected to recover, according to Essayli. Close friends of Parias said he was injured while being placed in custody on June 13, but was ultimately released. They added that he had a vest identifying him as press during the shooting. As doctors treated Parias' wound, Attorney Carlos Jurado described his client as a \"pacifist.\" \"It's difficult to trust every word that comes from DHS,\" Jurado said. \"What we know about Richard is that he's a pacifist guy. He's very calm. A lot of the police officers here know him. They know he's very respectful. In fact, the city of Los Angeles has awarded him for the work that he does in the community.\" In August, Councilmember Curren Price's office awarded Parias, who has 132,500 followers on TikTok, with a Certificate of Recognition for his \"unwavering commitment to keeping the South Los Angeles community informed, empowered and protected.\" \"Richard is a pillar of our community, a fearless citizen journalist whose authentic storytelling has consistently uplifted the unheard voices of South Central Los Angeles,\" Price wrote in an Instagram post following the shooting. \"His unfiltered portrayal of real life has fostered a loyal following, both on TikTok and throughout our City. Richard LA exemplifies what it means to serve your community with courage and heart.\" Essayli wrote on X that Parias will make his initial court appearance on Wednesday. He faces up to eight years in federal prison if convicted as charged. \"He is presumed innocent until proven guilty,\" Essayli wrote. Vehicles are deadly weapons. Anyone who uses them against federal agents risks arrest, imprisonment, and life-threatening injuries. We will continue to use every tool in our legal arsenal to protect our agents and enforce immigration laws passed by Congress.\"",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:41.651305+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/deputy-u-s-marshal-injured-south-los-angeles-shooting/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "357af406d04a4e1cbff66d5d2426127b",
    "processed_at": "2025-10-22T11:16:30.291831",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a shooting incident involving a TikTok influencer and federal agents during an immigration operation, with no mention or relevance to artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/clements-stampede-returns-after-a-15-year-hiatus/",
    "title": "Clements Stampede returns after a 15 - year hiatus",
    "text": "Clements Stampede returns after a 15-year hiatus Dirt turned into dust for the first time in 15 years, as the Clements Stampede returned better than ever. \"There's bareback riding, saddle bronc riding, bow riding, tie down roping, steer wrestling, team roping, barrel racing,\" Clements Stampede stock contractor Chuck Morris said. \"Then we have an event we're doing here called ranch hand bronc riding. It's kind of where rodeo started.\" The rodeo began shortly after the U.S. entered World War II in 1942. Since then, it has turned into a major event drawing in cowboys and cowgirls from across California and the country. \"It took a lot of blood, sweat and tears on this one,\" Clements Buckaroos President Bryan Gideon shared. \"We had a lot of great people in the community and businesses that sponsored and helped us gain the traction that we needed financially to bring this here. I believe that community, our sponsorships and just our hard-working volunteers are where it came from.\" The San Joaquin County community of Clements has its own world champion who competed over the weekend. He's considered a hometown hero, and his name is Clayton Biglow. \"I grew up rodeo in this arena,\" said Biglow, the 2019 bareback riding world champion. \"I live right down the road. I got a lot of history in this arena. I've always wanted to get on at the rodeo and it's been a long time since we've had one. It's pretty special for me to be able to compete in the rodeo and have it so close to home.\" When the Clements Stampede was cancelled in 2011, its memory carried on. When talks to bring it back started within the community, they jumped right back into the area, led by two women. \"It's less common to have two women lead a rodeo like this,\" Clements Stampede co-chair Tyla Daries said. \"I feel like there's been a few people that have been like, 'Oh, OK, this is different,' but everybody's been supportive. We need good business skills and good community connections, and we happen to have that here.\" With the sounds of hooves pounding the dirt and constant cheers from the crowd, the Clements Stampede is here to stay. \"Clements is pretty special to me, born and raised here, and both my grandparents helped build this so to me, it's really special to bring it back,\" Clements Stampede co-chair Rayanne Currin shared. \"My dad was the rodeo chair forever. My mom ran the queen contest forever. So, it's really important to me and my family.\" \"I think this town's missing the old Clements rodeo, and then, you know, bringing the stampede back to Clements is exciting, and I'm just tickled to death to be a part of it,\" Morris continued. On top of all the events, they had food vendors and plenty of merchandise, with many vendors locally based.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:41.811639+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/clements-stampede-returns-after-a-15-year-hiatus/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6270c2aba61037c78228c47bc37a4331",
    "processed_at": "2025-10-22T11:16:30.291853",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the Clements Stampede, a rodeo event, and does not mention artificial intelligence or any related topics. It focuses on community involvement and the history of the event.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/cody-bass-named-new-mayor-of-south-lake-tahoe-amid-city-hall-turmoil/",
    "title": "Cody Bass named new mayor of South Lake Tahoe amid city hall turmoil",
    "text": "Cody Bass named new mayor of South Lake Tahoe amid city hall turmoil The City of South Lake Tahoe has a new mayor after weeks of political turmoil and public calls for stability at City Hall. In a packed and emotional meeting Tuesday evening, the City Council unanimously voted to appoint Mayor Pro Tem Cody Bass as the city's next mayor. The chamber was standing-room-only, with so many residents in attendance that officials opened an overflow room to accommodate the crowd. Many in attendance said they came out because they want to see South Lake Tahoe move forward after a rocky few weeks. \"The residents all have voices and they all should be heard one way or another,\" said South Lake Tahoe business owner Rebekah Havard. \"And we should be able to support the city as best as possible in the coming days.\" The city's leadership crisis began earlier this month when then-Mayor Tamara Wallace admitted to embezzling money from a local church. An attorney for the church says Wallace is believed to have stolen more than $300,000. She later resigned, leaving the city scrambling to fill the vacancy. Bass, who will serve as mayor through the remainder of the current term ending later this year, addressed the council and the community following his appointment. \"We have a great city and we're doing great things,\" Bass said. \"We have a lot of important business for the city that we need to be focused on.\" Bass himself faces a misdemeanor charge, something he acknowledged directly during the meeting. \"I'm absolutely innocent,\" Bass said. \"And I ask my council and my community not to judge me on that until I'm able to go through the due process.\" His comments struck a chord with many in attendance, including one longtime resident who said Bass has consistently put the community first. \"I've been attending city council meetings for almost a decade now,\" said Melissa Soderston, a South Lake Tahoe resident. \"I've never seen his actions be anything but focused on what was best for the community.\" Others in the crowd echoed a message of patience and accountability. \"Everybody is innocent until proven guilty,\" Havard said. \"There are times you shouldn't put yourself in certain situations, especially when you're in a city council position.\" Some residents say the shake-up could even inspire more people to get involved in local government. \"Maybe I'll run at this point,\" Soderston added. For many in South Lake Tahoe, Bass' appointment marks what they hope will be a fresh start for the city.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:42.316748+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/cody-bass-named-new-mayor-of-south-lake-tahoe-amid-city-hall-turmoil/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "f7c5740146ae2d1469601b6f2fdf774b",
    "processed_at": "2025-10-22T11:16:30.291874",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the appointment of a new mayor in South Lake Tahoe and the political turmoil surrounding the city's leadership. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/california-economic-summit-caps-off-day-one-stockton/",
    "title": "2025 California Economic Summit caps off first of 3 days in Stockton",
    "text": "2025 California Economic Summit caps off first of 3 days in Stockton Visitors from all over the state filed into Stockton on Tuesday to talk about the local economy during the California Economic Summit. A celebration highlighted local artists, including the Latin Magic Band and Rhymosaurs, at Stockton's Banner Island Ballpark in the evening to cap off the first day of the summit, filled with discussion about economic growth in San Joaquin County and the surrounding regions. The last panel of the day was on how hip-hop brings business. The summit is hosted annually by the nonprofit organization California Forward, whose website states they \"support economic growth using a regions-up approach, stewarding state resources, and building resilience in the face of a changing climate.\" \"This (is) a really big deal for Stockton,\" said Bob Gutierrez, San Joaquin Partnership president and CEO. \"This has been two years in the works, and so we've really had a lot of collaborative partners come together from the region through North Valley Thrive, through our respective counties, and through our city partners to really make this happen. So, this is an exciting event to be able to tell our story.\" One of the ways Gutierrez and community members told their story was by giving tours to visitors of the Port of Stockton, the Stockton Airport, the Discovery Challenge Academy, the Volt Institute, and manufacturers with Beam Circular. \"I'm very passionate about community and bridging business into that community,\" Gutierrez said. \"As California Forward, as a board member there, we really look about impacting communities and… bridging new opportunities with existing partners, folks that understand how to lift up and build that, whether it be a new business, a venture opportunity or even building organizations that are going to support their local constituents.\" As part of the airport tour, Stockton Mayor Christina Fugazi learned that StandardAero, a company that does repairs for military helicopters, is having trouble finding employees. They are looking to hire, and Fugazi said that with her background in education, she wants to build their workforce. \"They're one of four in the world that do,\" Fugazi said. \"So, it's military, helicopter, and energy, and we have it right here in Stockton.\" Fugazi said she's \"super excited\" that California Forward chose Stockton to be the host of the summit, \"because there are things that people look at this city that aren't positive and this is huge for our city and our region.\" Gutierrez has lived in Stockton for four decades after his parents brought his family here and started a business. He's raised his kids in Stockton. \"I love the culture of this community,\" Gutierrez said. \"I love its resilience, and I love the fact that I get to do business here, so it's really a win-win for everything in life.\" The summit will continue throughout this week, including hosting candidates in the 2026 California governor's race for a forum on Thursday.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:42.510433+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/california-economic-summit-caps-off-day-one-stockton/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ce41616a5174cecf90de7c3a0d1ec81d",
    "processed_at": "2025-10-22T11:16:30.291959",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the California Economic Summit and local economic growth without any mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/media/selective-outrage-trump-democrats-mainly-denounce-other-sides-scandals",
    "title": "Violent threats and racist chats reveal toxic political culture nationwide",
    "text": "The group chat was racist as hell. Black folks were called \"monkeys\" and \"the watermelon people.\" The group chat was also utterly anti-Semitic. \"I love Hitler.\" Kill them in gas chambers. \"I’m ready to watch people burn now.\" JD VANCE TELLS DEMS OUTRAGED OVER YOUNG REPUBLICANS' LEAKED GROUP CHAT TO 'GROW UP' Oh, and there were jokes about rape (\"epic\"). And a slur against gay people, involving actions by cows. That reporting by Politico – based on 2,900 pages of leaked chats by the Young Republicans organization – has caused a national uproar. But JD Vance dismissed it as a \"college group chat\" and says \"kids do stupid things, especially young boys.\" In fact, these were young adults under the age of 40 (according to the rules), working as political strategists and government staffers. Vermont state Sen. Sam Douglass apologized and resigned, saying he had to protect his family in the face of death threats. His wife, Brianna, posted that \"you’re giving nationals to [sic] much credit and expecting the Jew to be honest.\" William Hendrix, working for the Kansas attorney general’s office, has been fired. Bobby Walker, chair of the New York State Young Republicans, lost his planned spot on a campaign. Peter Giunta has been ousted by a New York assemblyman. The whole thing is sickening, disgusting and stomach-turning. FROM AOC TO ZOHRAN MAMDANI, THE DEMOCRATS ARE PEDDLING FAR-LEFT POLITICS Don’t take my word for it. The Young Republican National Federation says it’s \"appalled by the vile and inexcusable language revealed … such behavior is disgraceful, unbecoming of any Republican, and stands in direct opposition to the values our movement represents.\" New York GOP leaders have now voted unanimously to disband the state’s Young Republicans chapter. But with some brave and prominent exceptions, most Republicans don’t want to talk about the chat fiasco. They have been pivoting to an awful scandal involving, naturally, a Democratic candidate. Jay Jones, running for attorney general in Virginia, was revealed by National Review to have had a violent exchange about a colleague in 2022, when both were in the House of Delegates. Jones was fantasizing about going after Todd Gilbert, then the House speaker. Gilbert gets \"two bullets to the head,\" then Jones said he wanted the speaker’s children to \"die in their mother’s arms.\" JD Vance said Jones \"has been fantasizing about murdering his political opponents, \"I'm sure the people hyperventilating about sombrero memes will join me in calling for this very deranged person to drop out of the race. Republican Gov. Glenn Youngkin has done just that.\" President Trump weighed in, saying \"the Radical Left Lunatic Jay Jones\" had made \"SICK and DEMENTED jokes, if they were jokes at all,\" about \"the murdering of a Republican Legislator, his wife and their children.\" The president called Jones an \"animal\" and that \"anybody would be put in prison for what he said.\" Now all this is horrible and nauseating – and it gets worse. JAY JONES MURDER TEXTS LATEST CASE OF DEMOCRATS CIRCLING THE SCANDAL WAGONS Abigail Spanberger, the Democrat running for Virginia governor, said she was \"disgusted\" by Jones’s remarks and issued a statement: \"I made clear to Jay that he must fully take responsibility for his words. What I have also made clear is that as a candidate – and as the next Governor of our Commonwealth, I will always condemn violent language in our politics.\" What she definitely did not do was pull her support for the man behind the \"violent language.\" She still backs Jay \"two bullets\" Jones. So do most Democrats, with some prominent exceptions. So each side is engaging in classic whataboutism – insisting that we train our gaze on the other side’s misconduct. And you know full well if the situations were reversed, Democrats would be denouncing the \"two bullets\" candidate and Republicans would be slamming the racist and anti-Semitic group chat. In an ideal world, both would be equally condemned regardless of party. David French, the conservative, anti-Trump columnist for the New York Times, says there’s a \"twisted moral calculation\" that he blames in part on Trumpism but admits the trend began well before DJT got into politics. \"The result is a push-pull dynamic that pushes people of good character out of the party and pulls in new leaders and new people who share the leader’s ethos. Every year, this cultural trend reinforces itself. Decency becomes rarer, and decent people feel more isolated… \"Meanwhile, the trolls multiply until the radicals become the mainstream and the previous mainstream becomes the fringe.\" Even compassionate conservative George W. Bush would be deemed too liberal for the Trump GOP. So would Ronald Reagan, who was pro-immigration, and Richard Nixon, who created the EPA. SUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES And then there’s the question of real violence, in the wake of the horrifying assassination of Charlie Kirk, not to mention the two attempts to muder Trump last year. \"Rising vitriol and escalating illiberalism raise the perceived stakes of elections to such an extent that virtually every partisan American is all too willing to overlook almost any lesser evil to avoid the greater evil of an electoral loss,\" says French. It’s the ultimate means-justify-the-ends argument. It’s really about seizing and holding power. Nothing else matters. And that’s revolting. CLICK HERE TO GET THE FOX NEWS APP It’s chilling to read that the fringe is now the mainstream, that nothing is more important than defending your side, your team, your ideology, details be damned. But that’s the world in which we now live.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T073000Z",
    "date_download": "2025-10-22T09:15:46.836762+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/media/selective-outrage-trump-democrats-mainly-denounce-other-sides-scandals",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "24a2ec610d7decde00d632cc33781524",
    "processed_at": "2025-10-22T11:16:30.292099",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses toxic political culture, violent threats, and racist behavior within a political group, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/entertainment-arts/tv/story/2025-10-22/love-is-blind-season-9-finale-marriage-outcomes-relationship-status",
    "title": "  Love is Blind  Season 9 finale ends with dramatic first for the show",
    "text": "‘Love is Blind’ Season 9 finale ends with a dramatic first. Here’s what happened - Share via This article contains spoilers for the Season 9 finale of “Love Is Blind.” Netflix’s hit dating series “Love is Blind” is actually an experiment, its creator, Chris Coelen, says. The show tests whether couples can build a lasting relationship based on a core emotional bond that is not tethered to physical attraction or appearances. In Season 9, for the first time in the show’s history, the experiment failed to create lasting bonds. No couples from this season said “I do” at the altar in the finale, which began streaming Wednesday. Six couples left the pods engaged, but the decoupling began almost immediately, with Kacie McIntosh breaking things off with Patrick Suzuki. They were followed by Annie Lancaster and Nick Amato, and finally Madison Maidenberg and Joe Ferrucci, whose breakups were documented in Episodes 10 and 11. The remaining couples going into the final episode, where the weddings would take place, were Ali Lima and Anton Yarosh; Kalybriah Haskin and Edmond Harvey; and Megan Walerius and Jordan Keltner. Megan and Jordan didn’t make it to the altar — Megan broke things off just before the wedding because she felt their lifestyles would not mesh well long term. That partly had to do with their jobs. Jordan works long hours in transportation and logistics, while Megan is a wealthy entrepreneur with a flexible working schedule. Jordan is also a single father to a young son, who has Type 1 diabetes. Over the course of the season, the pair often discussed the demands of parenting. Anton said “I do,” but Ali said “I can’t be your wife” at the altar. She said she felt like the man she had fallen in love with in the pods was not the person she’d been experiencing in real life before she ran off in tears. Anton said in an interview later that he had “done nothing but care for her,” and that the rejection “f— sucks.” Kalybriah also said no at the altar after her fiancé said yes. Kalybriah said Edmond “deserve[s] someone that is 100% at the altar” and that she wasn’t there. Edmond had a tempered reaction to the rejection, and Kalybriah thanked him for being graceful before the two walked off hand in hand. Kalybriah left the door open for a possible reconciliation down the road. Patrick Suzuki, a participant on Netflix’s hit reality dating series, spoke about his connection with Anna Yuan and Kacie McIntosh, and his breakup with the latter. Season 9 was full of messy breakups and controversial comments from the participants. Patrick went into the experiment with insecurities about his Asian American identity, and his short-lived fiancée, Kacie, broke up with him on the heels of their first meeting. Annie and Nick, who split before the wedding preparations were in full swing, received backlash over a conversation they had about raising LGBTQ+ children, and they have both since walked back those comments in recent interviews. And an argument between Kalybriah and Edmond about her decision to wait until the wedding to have sex with him was the subject of intense scrutiny on social media. Before Season 9, each season ended with at least one couple getting married. While some later split, many still remain married and several have started families. Days before Season 9’s finale was released, Cameron Hamilton and Lauren Speed-Hamilton from Season 1 announced Monday that they welcomed their first child together. The Season 9 reunion, which will address unanswered questions about the many breakups, will be available to stream on Netflix on Oct. 29 at 6 p.m. PT/ 9 p.m. ET.",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T081500Z",
    "date_download": "2025-10-22T09:15:48.925341+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/entertainment-arts/tv/story/2025-10-22/love-is-blind-season-9-finale-marriage-outcomes-relationship-status",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6c25ccff0384e5ad31c51d12f2882598",
    "processed_at": "2025-10-22T11:16:30.292135",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the finale of a reality dating show, 'Love is Blind,' and focuses on the relationships and events that occurred during the season. There is no mention or discussion of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]