[
  {
    "url": "https://abcnews.go.com/US/wireStory/us-militarys-unusually-large-force-caribbean-sea-126731617",
    "title": "A look at the US military unusually large force in the Caribbean Sea",
    "text": "A look at the US military's unusually large force in the Caribbean Sea The U.S. military has built up an unusually large force in the Caribbean Sea WASHINGTON -- WASHINGTON (AP) — The U.S. military has built up an unusually large force in the Caribbean Sea and the waters off the coast of Venezuela since this summer, when the Trump administration first began to shift assets to the region as part of its so-called war against narcoterrorism. Here is a look at the ships, planes and troops in the region: The Navy has eight warships in the region — three destroyers, three amphibious assault ships, a cruiser and a smaller littoral combat ship that's designed for coastal waters. The three amphibious assault ships make up an amphibious readiness group and carry an expeditionary unit of Marines. As a result, those ships also have on board a variety of Marine helicopters, Osprey tilt rotor aircraft and Harrier jets that have the capability of either transporting large numbers of Marines or striking targets on land and sea. While officials have not offered specific numbers, destroyers and cruisers typically deploy with a missile loadout that contains Tomahawk cruise missiles — a missile that can strike hundreds of miles from its launch point. A U.S. Navy submarine, the USS Newport News, also is operating in the broader area of South America and is capable of carrying and launching cruise missiles. A squadron of advanced U.S. Marine Corps F-35B Lightning II jets have been sent to an airstrip in Puerto Rico. The planes were first spotted landing on the island territory in mid-September. MQ-9 Reaper Air Force drones, capable of flying long distances and carrying up to eight laser-guided missiles, also have been spotted operating out of Puerto Rico by commercial satellites and military watchers, as well as photojournalists, around the same time. It has been widely reported that the Navy is operating P-8 Poseidon maritime patrol aircraft out of the region as well. Earlier this month, the military released a photo of an U.S. Air Force AC-130J Ghostrider, a heavily armed plane capable of firing its large guns with precision onto ground targets, also sitting on the tarmac in Puerto Rico. There have been a multitude of other military aircraft that have temporarily flown through the region as part of military operations there. For example, the U.S. Air Force flew a group of B-52 Stratofortress bombers through the region last week for what the Pentagon dubbed as a “bomber attack demo” in photos online. All told, there are more than 6,000 sailors and Marines that are now operating in the region based on the ships that have been confirmed by defense officials. The Pentagon has not offered specific numbers on how many drones, aircraft or ground crew are in the region so their impact on that broader figure is unknown.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:18:55.439897+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/us-militarys-unusually-large-force-caribbean-sea-126731617",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "47731b86a4b6723edd5cbdefd9f6081e",
    "processed_at": "2025-10-22T12:19:47.116681",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the U.S. military's buildup of forces in the Caribbean Sea, detailing various military assets and operations. There is no focus on artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/federal-prosecutors-charge-man-accused-threatening-shoot-atlanta-126741453",
    "title": "Federal prosecutors charge man accused of threatening to shoot up Atlanta airport",
    "text": "Federal prosecutors charge man accused of threatening to shoot up Atlanta airport Federal prosecutors have charged a Georgia man arrested this week at Atlanta's airport after his family told police he planned a shooting ATLANTA -- ATLANTA (AP) — Federal prosecutors on Tuesday brought charges against a Georgia man who was arrested a day earlier by police after his family contacted authorities saying he planned a shooting at Atlanta's international airport. Billy Joe Cagle, 49, threatened to “shoot up” the world’s busiest airport on a FaceTime call while driving, abruptly ending the call after saying, “I’m at the airport, and I’m gonna go rat-a-tat-tat,” prosecutors said in a news release. Atlanta police arrested Cagle, of Cartersville, on Monday at Hartsfield Jackson Atlanta International Airport and found an assault rifle and ammunition in his truck outside, Chief Darin Schierbaum said. Federal prosecutors said in a news release Tuesday that they had charged Cagle with attempted violence at an international airport, interstate communications containing threats and being a felon in possession of a firearm. Cagle's family contacted Cartersville police, who immediately called Atlanta police, authorities said. Officers at the airport were able to find Cagle at the airport and arrest him within 15 minutes, Schierbaum said. The airport is about 50 miles (80 kilometers) southeast of Cartersville, a northwest Georgia city. \"Cagle senselessly threatened to do heinous violence to innocent travelers, at the world’s busiest airport, with a high-powered weapon that he had no legal right to possess,” U.S. Attorney Theodore Hertzberg said in the statement. Online jail records showed that Cagle was being held in the Clayton County Jail on state charges of possession of a firearm by a felon and terroristic threats. Schierbaum said Tuesday that he would be transferred to federal custody. It was not immediately clear whether the man had a lawyer who could comment on his charges and attempts to reach his family were unsuccessful. Sgt. T. Jones, who has about six months left in her three-decade career with the Atlanta Police Department, was on the phone with one of Cagle's family members Monday morning, relaying information to officers to help them identify him. She and other officers spoke about the arrest during a news conference Tuesday. “This is what I've trained to do and I've loved doing this for the past 29 years and it's just an amazing feeling,” she said of helping to avert a potential tragedy. Officer M. Banks, who has been with the Atlanta Police Department for nearly three years and at the airport for about two years, identified and arrested Cagle. “I was scared. It was fearful for a second,” she said of the moment she approached him, adding that her training kicked in, but that she was fully aware of how easily things can go wrong. Nick Roberts, who has known Cagle since high school, texted his friend Sunday night after being concerned by Facebook posts he had made. He said Cagle was struggling with mental health issues. Cagle had posted on Facebook earlier Sunday that he is schizophrenic and was taking medication. Roberts said Cagle called him at about 9 p.m. Sunday night and assured him he was OK. Roberts said Cagle loved his two daughters and worked hard hauling hay and doing fencing work. “I want folks to know that he wasn’t some monster,” Roberts said. “This was a very big surprise for a lot of us that went to high school with him and know him in the community.” During a news conference Monday, police showed surveillance video that they said showed Cagle arriving at the airport and body-camera video of his arrest. A Chevrolet flatbed pickup truck is seen arriving curbside at the airport terminal around 9:30 a.m. and then a man police identified as Cagle is seen entering the airport a few minutes later. He walks over to the TSA security checkpoint and had “high interest in that area,” Schierbaum said. Body-camera footage shows Atlanta police officers, who had a photo of Cagle provided by his family on their phones, approach him and begin asking him questions before taking him into custody. As they take him to the ground and put handcuffs on him, Cagle can be heard yelling. ___ Associated Press reporter Hallie Golden in Seattle contributed to this report.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:18:55.667935+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/federal-prosecutors-charge-man-accused-threatening-shoot-atlanta-126741453",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "82e34844e948a87496b6765d173b3be9",
    "processed_at": "2025-10-22T12:19:47.116738",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a man threatening violence at an airport, with no mention or relevance to artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/florida-sets-execution-date-man-raped-murdered-former-126744922",
    "title": "Florida sets execution date for man who raped and murdered his former manager at a convenience store",
    "text": "Florida sets execution date for man who raped and murdered his former manager at a convenience store A man convicted of raping and fatally beating his former manager at a Florida convenience store is scheduled to be put to death in November TALLAHASSEE, Fla. -- TALLAHASSEE, Fla. (AP) — A man convicted of raping and fatally beating his former manager at a Florida convenience store is scheduled to be put to death in November under a death warrant signed Tuesday by Republican Gov. Ron DeSantis, who is setting a record pace for executions. Richard Barry Randolph, 63, is scheduled to die by lethal injection Nov. 20 at Florida State Prison. Randolph would be the 17th person set for execution in Florida in 2025, with DeSantis overseeing more executions in a single year than any other Florida governor since the death penalty was reinstated in 1976. The previous record was set in 2014 with eight executions. DeSantis signed the death warrant a week before the Oct. 28 scheduled execution of Norman Mearle Grim Jr. Another convicted killer, Bryan Fredrick Jennings, is set to die Nov. 13. Randolph was convicted of murder, armed robbery, sexual battery and grand theft and sentenced to death in 1989. According to court records, Randolph attempted to break into the safe at the Handy-Way convenience store in Patatka, where he had previously worked, in August 1988. Randolph was spotted by the manager, Minnie Ruth McCollum, and the two began to struggle. Randolph then beat, strangled, stabbed and raped McCollum before leaving the store and taking the woman's car. Three women witnessed Randolph leaving the store and called the sheriff's office after seeing through the window that the store was in disarray. A deputy responded and found McCollum still alive. She was taken to a hospital in a coma and died six days later of severe brain injuries, according to doctors. Randolph was arrested shortly after the attack at a Jacksonville grocery store while trying to borrow money and cash in lottery tickets stolen from the convenience store, according to deputies. Investigators said Randolph admitted to the attack and directed them to bloody clothing that he had discarded. Attorneys for Randolph are expected to file appeals to the Florida Supreme Court and the U.S. Supreme Court. So far 39 people have been executed in the U.S. in 2025. Florida leads the way with a flurry of death warrants signed by DeSantis. The state's most recent execution was the Oct. 14 lethal injection of Samuel Lee Smithers, convicted of killing two women whose bodies were left in a rural pond.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:18:55.882452+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/US/wireStory/florida-sets-execution-date-man-raped-murdered-former-126744922",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "847d3718a28a9e73c09fad07fec446b0",
    "processed_at": "2025-10-22T12:19:47.116890",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a man convicted of murder and other crimes, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/politics/trump-smells-blood-new-jersey-gop-works-flip-governors-office-left-leaning-state",
    "title": "Trump steps in for Ciattarelli as New Jersey governor race polls tighten",
    "text": "With just two weeks until Election Day and the latest polls suggesting the Republican nominee Jack Ciattarelli narrowing the gap with Democratic rival Rep. Mikee Sherrill in New Jersey's crucial race for governor, President Donald Trump is stepping in to push his GOP ally over the finish line. Trump, taking to social media, touted that Ciattarelli \"is doing very well in the Polls\" and urged his supporters in the Garden State to \"VOTE FOR JACK CIATTARELLI — HE WILL NEVER LET YOU DOWN!\" Trump has good reason to be optimistic that Ciattarelli, who's making his third straight run for Garden State governor and who nearly upset Democratic Gov. Phil Murphy four years ago, could pull off victory in blue-leaning New Jersey. In a state where registered Democrats still outnumber Republicans despite a GOP surge in registration this decade, three public opinion polls released last week — from Fox News, Quinnipiac University and Fairleigh Dickinson University — indicated Ciattarelli narrowing the gap with Democratic gubernatorial nominee Rep. Mikie Sherrill in the race to succeed the term-limited Murphy. BATTLE FOR GOVERNOR IN THIS CLOSELY WATCHED RACE MAY BE HEADED FOR A PHOTO FINISH \"The energy across the state is electric. The reception in minority communities has been great, and on being endorsed by prominent Democrats, that tells you all you need to know in terms of the people of New Jersey wanting change. And that's what this election is all about. Change,\" Jack Ciattarelli said this past weekend in an interview on \"Fox News Sunday.\" New Jersey and Virginia are the only two states to hold gubernatorial showdowns in the year after a presidential election, and the contests traditionally grab outsized attention and are viewed as political barometers ahead of the following year's midterm elections. HEAD HERE FOR THE LATEST FOX NEWS REPORTING ON THE 2025 ELECTIONS And this year, they're being viewed, in part, as ballot-box referendums on Trump's unprecedented and explosive second-term agenda. While Democrats have long dominated federal and state legislative elections in blue-leaning New Jersey, Republicans are very competitive in gubernatorial contests, winning five out of the past 10 elections. And Trump made major gains in New Jersey in last year's presidential election, losing the state by only six percentage points, a vast improvement over his 16-point deficit four years earlier. FIVE KEY RACES TO WATCH WITH TWO WEEKS UNTIL ELECTION DAY While it's still not clear if Trump will physically hit the campaign trail in New Jersey sometime during the next two weeks, Fox News confirmed that the president will hold a tele-rally with Ciattarelli ahead of Election Day. Last week, Ciattarelli was joined at a jam-packed diner stop in Saddle Brook, New Jersey, by Vivek Ramaswamy, the MAGA rock star who is running for governor next year in his home state of Ohio. And this week another well-known Republican politician in MAGA world is headed to New Jersey. Rep. Byron Donalds of Florida, a top House ally of the president who has Trump's backing as he runs next year for Florida governor, will team up with Ciattarelli on Wednesday. The stops by the high-profile surrogates and Trump's tele-rally may help Ciattarelli energize MAGA supporters, many of whom are low propensity voters who often skip casting ballots in non-presidential election years. CLICK HERE TO CHECK OUT THE LATEST FOX NEWS POLLING Sherrill, a Naval Academy graduate who flew helicopters during her military service and who was first elected to Congress in 2018, is getting plenty of company on the campaign trail. This past weekend she was joined by two of the biggest names in the party — Govs. Gretchen Whitmer of Michigan and Wes Moore of Maryland — who are considered potential 2028 White House contenders. And Sherrill's campaign announced on Tuesday the most popular Democrat in the country — former President Barack Obama — will headline a rally with her in Newark, N.J. on Nov. 1, the final weekend before Election Day. THE POLITICAL BOMB TRUMP EXPLODED IN THE NEW JERSEY SHOWDOWN FOR GOVERNOR But Ciattarelli's campaign claimed that Obama's upcoming appearance on the New Jersey campaign trail is a sign of weakness for the Democrats. \"National and New Jersey Democrats are in full-blown panic. At this point, we expect them to import anyone they think can excite Democrats because Mikie Sherrill excites no one,\" Ciattarelli campaign chief strategist Chris Russell argued in a statement to Fox News Digital. Democratic National Committee (DNC) Chair Ken Martin, commenting on why Republicans feel bullish about the New Jersey showdown, raised concerns. \"New Jersey is the best place, probably, for Donald Trump to actually stop the Democratic momentum — or at least minimize the Democratic momentum that we’ve seen throughout this year,\" Martin said in a recent Politico interview. But the DNC announced on Tuesday that it's upping the ante, infusing more money into the New Jersey Democratic Coordinated Campaign, on top of the $3 million it's already dished out in the Garden State. \"This November will set the tone for years to come, and it’s our moment to show Donald Trump and the Republicans that their time in power is coming to an end,\" Martin emphasized. CLICK HERE TO GET THE FOX NEWS APP New Jersey traditionally elects a governor from the party out of power in the White House, which this year would favor the Democrats. But Garden State voters haven't elected a governor from the same party in three straight elections in over a half century, which would favor the Republicans. One of those political trends will be derailed in two weeks.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:19:01.676148+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/politics/trump-smells-blood-new-jersey-gop-works-flip-governors-office-left-leaning-state",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6a77402263cf47f89ec5210d733fb356",
    "processed_at": "2025-10-22T12:19:47.117139",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a political race in New Jersey, focusing on candidates, polling, and campaign strategies, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/investing/markets/inside-the-market/market-news/article-premarket-gold-sags-after-flash-crash-stocks-bulls-take-a-breather/",
    "title": "Premarket : Gold sags after flash crash , stocks bulls take a breather",
    "text": "Gold and silver prices remained jittery on Wednesday after the sharpest pullback in over five years, while global equity and bond markets were taking a breather from recent rallies. Gold, which remains on course for its strongest year since the 1979 oil crisis, dipped below US$4,100 an ounce in London trading, continuing the bout of profit taking that sunk it more than 5 per cent on Tuesday. There has been no obvious catalyst for the plunge other than general altitude sickness after a blockbuster run amid uncertainty about a reshaping of the world order. “Gold was massively stretched, massively overbought. There’s been a lot of FOMO (fear of missing out) going into that market,” said Tony Sycamore, a market analyst at IG, adding that tech stocks and some other markets were in a similar position. “For some of these other frothy markets, we’re seeing little flash crashes now ... We’re just seeing little tremors in markets, and potentially there’s something more significant to come.” Europe’s STOXX 600 index drifted down 0.3 per cent after it got close to a new record high on Tuesday, and most large Asian bourses edged lower overnight. Geopolitics remained front and center with a planned summit between U.S. President Donald Trump and Russian President Vladimir Putin now in doubt and ambiguity too over a potential meeting between Trump and China’s President Xi Jinping. The selloff in gold injected some volatility into the broader markets overnight, but it did little to knock other safe-haven assets like bonds. European government debt yields were largely steady after 10-year U.S. Treasury yields - often the biggest driver of global borrowing costs - had recorded a 1-year closing low. Investors scooped up UK ‘gilts’ too after data showed Britain’s consumer price inflation and a key underlying measure of price growth unexpectedly held steady in September. That pushed interest rate futures to price a roughly 75 per cent chance the Bank of England will now cut UK rates to 3.75 per cent from 4 per cent at its December meeting, up from about 46 per cent before the data. Meanwhile, French bonds held around 3.35 per cent as traders wait to see if Moody’s follows S&P in cutting France’s credit rating on Friday, and for a European Central Bank meeting next week. Asia’s focus had been news from Japan that new Prime Minister Sanae Takaichi is preparing an economic stimulus package likely to exceed last year’s 13.9 trillion yen (US$92.19-billion) to help households tackle inflation. The Nikkei saw a late rally but MSCI’s broadest index of Asia-Pacific shares outside Japan ended down 0.4 per cent. Nasdaq and S&P 500 futures were also beginning to slip again in Europe after a mixed Wall Street session on Tuesday. Shares of Netflix sank nearly 6 per cent after the bell as the streaming giant missed Wall Street’s third-quarter earnings targets, while General Motors’ stock surged 15 per cent after the company raised its profit outlook. Tesla numbers are due later. In currencies, the yen pared some gains to leave it at 151.64 per dollar after the stimulus report. The package marks Takaichi’s first major economic initiative since the advocate of big fiscal spending took office on Tuesday, reflecting her commitment to what she calls “responsible proactive fiscal policy.” The Bank of Japan also meets next week, where market expectations are for the central bank - like the ECB in Europe - to stand pat on rates. “The likelihood of a rate hike in October has remained low for some time,” said analysts at Morgan Stanley MUFG Securities in a note. The U.S. Federal Reserve also announces its rate decision next week, and investors have almost fully priced in a 25-basis-point rate cut. The dearth of U.S. economic data due to the ongoing government shutdown means that policymakers could be left flying blind at the meeting, a less-than-ideal situation as they remain divided over which risks deserve the most attention. Trump on Tuesday rebuffed a request by top Democratic lawmakers to meet until the three-week-old U.S. government shutdown ends. The shutdown has in turn left currencies largely rangebound over the past few sessions due to the lack of fresh catalysts from data releases, though the dollar edged up slightly on Wednesday. Reuters",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:19:07.178926+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/investing/markets/inside-the-market/market-news/article-premarket-gold-sags-after-flash-crash-stocks-bulls-take-a-breather/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "508fc28ba7dfed8d7b87796ef7de282b",
    "processed_at": "2025-10-22T12:19:47.117311",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses financial markets, gold prices, and economic indicators without any mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/investing/globe-advisor/advisor-news/article-why-clients-hate-spending-their-savings-and-other-advisor-questions/",
    "title": "Why clients hate spending their savings – and other advisor questions for Morgan Housel",
    "text": "Morgan Housel’s bestselling books, which explain the psychological aspects of financial decision-making, resonate with many advisors. His latest, The Art of Spending Money, addresses the spending psyche specifically. In a recent interview with Globe Advisor, he answered questions from advisors about the saver’s identity, advice from bots, and why people have such a hard time knowing what they want. Why did you want to write a book about spending? If you had asked me five years ago about my investing philosophy, I could have talked for two hours about it. But one day, I realized if I were asked about my spending philosophy, I had no answer. That was just a curious observation of the imbalance of how much attention we spend on making money versus knowing what to do with it. Also, when you observe other people – rich people, poor people, everyone in between – you see some people do a very good job at spending their money. They get a lot of happiness, a lot of contentment from it, and other people don’t. So, I thought you could apply the same framework as The Psychology of Money – not about what you know, but about how you behave – to spending. Some clients who have saved more than enough for retirement have a real issue with opening the wallet and spending the money they’ve saved. How should advisors encourage clients to spend? There are two reasons why this happens. One is pretty rational, the other is less so. The rational reason is that if you and your spouse retire at age 65, statistically, there’s a very good chance that at least one of you will live into your 90s. So, you’re looking at a quarter of a century of no paycheques and needing to fund your lifestyle. Your lifestyle might get very expensive with health care down the road. If you’re funding a 10-year retirement, it’s very different than if you’re potentially funding a 30-year retirement. The less rational reason is more common. It’s that their identity as a saver has hijacked their entire personality. When they think about money, they say, ‘I am a saver. I save money every month.’ Their net worth goes up every year, and the idea of ceasing that and flipping a switch is completely the opposite of who they think they are. It’s completely the opposite to their identity and the personality they’ve built up. At that point, money controls them – and it’s almost as bad as not having money to begin with. I don’t think advisors are necessarily doing anything wrong, but they need to acknowledge that a big part of their job is helping clients with their relationship with money, which is very different from helping clients accumulate money. It takes much more effort to manage your relationship with money. Is this controlling your identity, or are you using it as a tool to live a better life? You are a proponent of trying something new in retirement. Why? One of the biggest issues with retirement is that once people stop working, they have identity issues. They used to be a teacher, a firefighter, a doctor or a nurse, and now they’re retired and they’re not [what they used to be] anymore. People have a really hard time knowing what they want. They’re very good at knowing what they need and what they don’t want. And so, little experiments of spending a bit more money on food, travel, clothes, wine – whatever it might be – is the only way to really understand what you might want. Backfilling your life with new hobbies is very important, and the idea of doing little experiments to figure out what those things might be is part of that. People often say money is a story we tell ourselves, but stories can trap us just as easily as they can free us. What story of money do most people cling to for too long? One story that does a lot of damage is the idea that your net worth or salary equals your self-worth. We view salary and net worth as a scorecard of how well we’ve done in life – the higher, the better; the lower, the worse – and that we should judge people in their entirety based on that. It’s a very common thing. The reason why it’s so easy to do is that money is so quantifiable. So, if I said, ‘Who is more moral, you or I?’ there’s no way to measure that. There’s no morality score I can compare myself to. It doesn’t take much insight or wisdom to take a step back and say, ‘No, your integrity, your values, your honesty, your humour, your wisdom, is more important,’ but because it’s not quantifiable, it’s easy to take a second rank to money. A lot of your success comes from the way you take a difficult and unpleasant topic for many people – money – and explain concepts in a relatable and entertaining way. Do you worry that voices such as yours might be less important as more people turn to AI for advice over humans? I don’t worry because I think it would be fantastic if everyone had a bot on their phone that could give them good advice. But for myself, as a reader, I have no desire to read an AI book. To me, a lot of the magic of reading a book, whether it’s fiction or nonfiction, is reading something and realizing that a fellow human wrote it. I remember reading the review of a book by Cormac McCarthy, and the review said, ‘I can’t imagine how another human came up with that sentence.’ That’s the beauty of writing. And if you know that a bot is doing it, you lose a lot of that magic. AI is great if you just need information, such as, ‘Where’s the cheapest hotel for tomorrow night?’ But if you want to hear a story from a fellow human, there’s never going to be a substitute for a human writing it. This interview has been edited and condensed.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:19:07.763413+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/investing/globe-advisor/advisor-news/article-why-clients-hate-spending-their-savings-and-other-advisor-questions/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ca53a3e21e64841bb4ec1c4a4a57256b",
    "processed_at": "2025-10-22T12:19:47.117371",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.8,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article discusses the role of AI in providing advice and contrasts it with human-written content, indicating a focus on AI's impact in the financial advisory space.",
      "keywords": [
        "AI",
        "advice",
        "bots",
        "human"
      ]
    }
  },
  {
    "url": "https://www.itsnicethat.com/articles/rob-farmer-animation-discover-221025",
    "title": "Data blooms and gardens glitch in Rob Farmer generative animations",
    "text": "Data blooms and gardens glitch in Rob Farmer’s generative animations Cut from the fabric of the natural world, the designer’s kinetic digital compositions unfold in natural, evolving and familiar patterns. We first discovered Rob Farmer’s work when we came across his Data Blooms series – a beautiful set of generative animations made with kinetic typography in Cavalry. You’d be pretty surprised to hear the designer and illustrator only started experimenting with motion a few years ago when he discovered the animation software in between projects working at a creative agency in New York. Although a lot of his biggest design inspirations are creative coders, such us Talia Cotton and Ksawery Komputery, “sadly I don’t know how to code”, he tells us, “but Cavalry felt very intuitive and let me design generatively. What I like about generative design is that it’s simply number values that drive or define other values.” In this algorithmic approach to motion, Rob’s generative design work often depicts patterns found in the natural world, using type or simple graphic forms like stitches as a dynamic material for movement, but not in conventional ways. Even if made digitally, his portfolio feels like it fits into the fabric of our analogue life and unfolds from natural, evolving and familiar patterns. “I think the natural world will always be much nicer than a digital one,” he shares, “but I like trying to recreate these patterns with a computer.” Rob’s inventive approaches to motion have shaped creative commissions for Google, a campaign for Coinbase as well as illustration commissions for journals like The Economist, but the majority of the designer’s work is for the sole purpose of play. “Whether it’s drawing or using software, I love making without purpose and I create a lot in my spare time. I think it’s really important to make space to create work outside of ‘real’ work”, he says. Having moved back home to Melbourne this year, after his creative stint in NYC, Rob’s new role at a brand design studio has given his personal creative work a new meaning – “I’m always kinda imagining that I could use these silly little things I put on Instagram in a thoughtful and fun brand system. Hopefully one day I will!”, he ends. Hero Header Rob Farmer: Monarchs (Copyright © Rob Farmer, 2025) Share Article Further Info About the Author — Ellis Tree (she/her) is a staff writer at It’s Nice That and a visual researcher on Insights. She joined as a junior writer in April 2024 after graduating from Kingston School of Art with a degree in Graphic Design. Across her research, writing and visual work she has a particular interest in printmaking, self-publishing and expanded approaches to photography.",
    "domain": "itsnicethat.com",
    "domain_category": "graphic design and visual communication",
    "language": "English",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:19:26.209324+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "itsnicethat.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.itsnicethat.com/articles/rob-farmer-animation-discover-221025",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "ad1330ecb955440e7d8306f27bb304fe",
    "processed_at": "2025-10-22T12:19:47.117721",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses generative animations and the artistic work of Rob Farmer, focusing on design and motion rather than artificial intelligence. While it mentions algorithmic approaches, it does not delve into AI as a central theme.",
      "keywords": [
        "generative animations",
        "kinetic typography",
        "algorithmic approach",
        "design",
        "motion"
      ]
    }
  }
]