[
  {
    "url": "https://www.cnn.com/2025/10/20/style/louvre-heist-which-jewels-stolen-intl-hnk",
    "title": "French crown jewels : What we know about missing Louvre treasures stolen in  national disaster  for France",
    "text": "Precious artifacts snatched from Paris’s Louvre Museum Sunday include an emerald necklace set among more than 1,000 diamonds gifted by Napolean to his second wife and other treasures of “inestimable” value. The thieves targeted the Louvre’s Apollo Gallery on the upper floor, which houses the French Crown Jewels, breaking into two high-security display cases and stealing nine items, according to a press release from France’s culture ministry. One item, an ornate gold crown worn by Empress Eugénie, during her reign in the 1800s, was recovered near the scene, the ministry said. Art recovery expert Arthur Brand said the thieves stole important pieces of history in what was a “national disaster” for France. “These are the crown jewels from Napoleon, his wife and his successors. So these are the natural pride of France,” Brand told CNN. “It’s a great loss.” Because the pieces are so recognizable, he said the thieves will likely dismantle them, sell the jewels and melt down the gold and silver. Here’s what was stolen: A sapphire diadem, necklace and single earring worn by several queens This diamond and sapphire jewelry set worn by Hortense de Beauharnais, Queen of Holland; Marie-Amélie, Queen of the French; and Isabelle d’Orléans, Duchess of Guise is among the items snatched by four thieves during the 7-minute heist. The diadem — a jeweled headpiece worn by royalty — features 24 Ceylon sapphires and 1,083 diamonds that can be detached and worn as brooches, according to the Louvre. The origins of the set are unknown, though some suggest it once belonged to Queen Marie Antoinette. While the jewelry bears no hallmarks of the most famous French jewelers of the era, it is indicative of the craftmanship of Parisian artisans of the early 19th century, the museum said. The set stayed with the Orléans family until 1985, when it was acquired by the Louvre. An emerald necklace and earrings gifted by Napolean to Marie-Louise A wedding gift from Napolean to his second wife, Marie-Louise of Austria, in March 1810, this ornate set was crafted by the jeweler François-Régnault Nitot includes 32 intricately cut emeralds and 1,138 diamonds. After Napolean’s empire collapsed, Marie-Louise bequeathed the original set, which also included a tiara, to a relative, and it was passed through generations of her descendants. In 1953, the set was sold to jeweler Van Cleef & Arpels, after which the emeralds of the tiara were sold and later replaced with turquoise stones by an American collector. The altered tiara is now a part of the Smithsonian collection. The necklace and earrings, however, were preserved in their original form and sold to the Louvre in 2004 for a reported 3.7 million euros ($4.3 million). The reliquary brooch Empress Eugénie, wife of Napolean III, was the original owner of this diamond-encrusted brooch, which was crafted by Paul-Alfred Bapst in 1855 specially for her, according to the Louvre’s website. A Spanish countess, Eugénie was Empress of the French from 1853-1870 and considered one of the most fashionable women of the time. A reliquary brooch is a brooch that holds a sacred relic, a symbol of Eugénie’s Catholic faith. Comprised of 94 diamonds, the brooch includes the 17th and 18th Mazarin diamonds, which were given to King Louis XIV by former chief minister Cardinal Mazarin in 1661, according to the museum. These large stones mirror each other at the center of the brooch. Beautiful engravings of foliage and leaves decorate the back of the golden brooch, which was acquired by the Louvre in 1887. A diamond bow brooch and diadem of Empress Eugénie The silver, gold and diamond bow brooch originally formed the buckle of a diamond belt of 4,000 stones which was exhibited at the Universal Exhibition of 1855, before it was worn by Empress Eugénie, according to the Louvre’s website. Eugénie is said to have worn the belt, crafted by François Kramer, during a visit by Queen Victoria to the Palace of Versailles in August 1855, and again in June 1856 for the baptism of the Prince Imperial. Eugénie later decided to transform the belt into a brooch and had one of her own jewelers fashion it into a more elaborate standalone piece, adding cascading diamond tassels. In 1887, the brooch was purchased by jeweler Emile Schlesinger for New York socialite Caroline Astor at auction for 42,200 French francs, according to auction house Christie’s. The brooch remained in the Astor family for more than a century until the Louvre bought it in 2008, returning the brooch to France. The museum paid 6.72 million euros (more than $10 million at the time) for the brooch, according to the Fondation Napoléan. The pearl diadem was made for Eugénie by jeweler Alexandre-Gabriel Lemonnier in 1853 and contains 212 pearls and 1,998 diamonds, according to the Louvre. Stolen but recovered: Eugénie’s crown Thieves attempted to steal Empress Eugénie’s crown, but it was found outside the Louvre, according to France’s culture ministry, The ornate gold piece, which features 1,354 diamonds and 56 emeralds, was damaged in the heist, according to French TV station TF1 and newspaper Le Parisien.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T093000Z",
    "date_download": "2025-10-20T10:02:37.917526+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/10/20/style/louvre-heist-which-jewels-stolen-intl-hnk",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "918adc5d5c6cdbcab1ee484ceca0dbf7",
    "processed_at": "2025-10-20T12:03:42.083276",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the theft of valuable artifacts from the Louvre Museum and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  }
]