[
  {
    "url": "https://www.version2.dk/holdning/bomaes-vaerdiskabende-ai-business-case",
    "title": "BOMAEs værdiskabende AI - business case",
    "text": "BOMAEs værdiskabende AI-business case Jeg har tidligere skrevet om, hvordan AI kan være den gode business case – og givet konkrete eksempler på det. Der er mange brancher, der kæmper med at få armene ordentligt omkring AI og skabe reel værdi. For nylig talte jeg med en tidligere kunde om netop det. Den finansielle sektor, sagde han, har haft svært ved at få AI til at levere forretningsresultater. I et tidligere indlæg på Version2 – “Endnu en artikel om AI, denne gang med fokus på business casen” – pointerede jeg, at en AI-business case kan være mange ting (bare se på Gartners AI Opportunity Radar). Missionen må være at fremhæve de gode eksempler – de løsninger, der faktisk virker. Denne blog er netop et af de eksempler. Her handler det om en løsning, hvor forretningen får de fede gevinster. En case fra en rådgiver virksomhed, som kan siges at være tæt på den finansielle sektor (deres køberrådgivning) – men som kunne bruges i mange andre brancher. Hvad er “tale-til-resumé”-løsningen – og hvad fik BOMAE ud af den? Forestil dig, at du som rådgiver skal notere alt, hvad der bliver sagt i en kundesamtale: finansiel situation, løn, alder, pension og alt det andet, som normalt indgår i dialogen. Mens du taler, skal du samtidig holde styr på data, rækkefølge og kontekst. Det er en kompleks opgave, som tager tid – og som ofte ender med, at du skal bruge flere timer på at skrive et resumé bagefter. Men som min kollega Eleonora Kulberkyte, AI-ingeniør og hjernen bag løsningen, siger: “En god AI-løsning skal føles naturlig. Den skal hjælpe brugeren uden at være i vejen – og den bliver bedre, hver gang vi evaluerer og gentager.” Den AI-løsning, vi i RedShoes Consulting har udviklet i samarbejde med BOMAE, gør netop dette. Når rådgiveren optager samtalen, bliver der automatisk genereret et udkast til et resumé inden for 20–30 minutter – også for et møde på en time. Resuméet indeholder alle relevante emner og tal, skrevet i et professionelt, letlæseligt sprog og i øjenhøjde med kunden. Resultatet? Rådgiverne kan fokusere på kunden – ikke på notatskrivning. AI’en leverer et udkast i høj kvalitet, som sjældent kræver mere end små justeringer. Business casen – hvor er gevinsten? Som vores salgsdirektør Thomas Ahlburg siger: “Vi starter altid med forretningen – ikke teknologien. Når man forstår rådgivernes hverdag, kan AI skabe reel værdi og frigive tid til det vigtigste: kunden.” Sammen med BOMAE opstillede vi en business case med to hovedområder: 1. Flere kunder igennem tragten Når rådgiverne ikke skal bruge tid på at skrive resuméer, frigives der tid til flere kundemøder. Jeg kan naturligvis ikke dele de præcise tal, men det er værd at nævne, at tilbagebetalingstiden var under tre måneder – baseret på en konservativ beregning. 2. Resumeet til kunden skaber overblik, tryghed og tydeliggør \"Next Step\" for kunden Gevinsten ligger i et resumé til kunden, der skaber overblik, tryghed og tydeliggør ”Next Step ”i processen for kunden. Det sikrer at vi har nedskrevet hvad der er blevet talt om og dermed mindsker uoverensstemmelser der kan komme, senere i processen, da vi kan referere tilbage til mødet og resumeet. Som Marko Pavlenić fagansvarlig fra BOMAE udtrykte det: “Den business case, som RedShoes Consulting var med til at opstille, var faktisk alt for konservativ. Vi har realiseret minimum det dobbelte end forventet.” Bagsiden – hvad skal man være opmærksom på? AI-løsninger kræver omtanke. Mine kolleger Eleonora og Thomas fremhæver tre vigtige fokusområder: 1. Compliance Alle AI-løsninger skal designes med compliance for øje – ikke mindst i lyset af AI Act og Data Act. Hvis løsningen falder i en højrisko-kategori, følger der krav til governance, dokumentation og kontrol. 2. Bekræftelse AI må ikke stå alene. AI-genererede leverancer skal altid godkendes af et menneske. I BOMAEs tilfælde bliver hvert resumé gennemgået og bekræftet af rådgiveren, inden det sendes til kunden. 3. Sikkerhed AI-løsninger, der håndterer personfølsomme data, er naturligvis et attraktivt mål for cyberangreb. Sikkerhed skal derfor være tænkt ind fra starten – ikke som et eftertænkt lag. Hvad er næste skridt? Med BOMAEs eksempel kan vi sige det helt klart: AI kan skabe værdi i daglig drift – både for en rådgivningsvirksomhed som BOMAE tæt på den finansielle sektor, men også i en reguleret branche som den finansielle sektor. ”Business casen var positiv – og realiseringen overgik alle forventninger.” Siger Rikke Bøye Pedersen, COO fra BOMAE. Hvis du vil vide mere, har Thomas og Eleonora skrevet et whitepaper med 6 principper for en værdifuld AI-løsning: https://redshoes.consulting/whitepaper-6-principper-for-vaerdifuld-ai-losninger/ ...men det er dyrt at lave god journalistik. Derfor beder vi dig overveje at tegne abonnement på Version2. Digitaliseringen buldrer derudaf, og it-folkene tegner fremtidens Danmark. Derfor er det vigtigere end nogensinde med et kvalificeret bud på, hvordan it bedst kan være med til at udvikle det danske samfund og erhvervsliv. Og der har aldrig været mere akut brug for en kritisk vagthund, der råber op, når der tages forkerte it-beslutninger. Den rolle har Version2 indtaget siden 2006 - og det bliver vi ved med.",
    "domain": "version2.dk",
    "domain_category": "digital media and content creation",
    "language": "Danish",
    "date_publish": "20251028T130000Z",
    "date_download": "2025-10-28T13:21:10.942504+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "version2.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.version2.dk/holdning/bomaes-vaerdiskabende-ai-business-case",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8698f7714a2caade213fc93385e0f036",
    "processed_at": "2025-10-28T14:25:05.934953",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article discusses a specific AI solution developed for a business context, highlighting its benefits and applications in the financial sector. It focuses on how AI can create value in business operations, making it primarily about AI.",
      "keywords": [
        "AI",
        "business case",
        "value",
        "financial sector",
        "solution",
        "resumé",
        "consulting"
      ]
    }
  },
  {
    "url": "https://www.theguardian.com/us-news/2025/oct/28/springfield-ohio-economy-haitians-trump-immigration",
    "title": "Haitians helped boost Springfield economy – now theyre fleeing in fear of Trump | Ohio",
    "text": "Every morning, Alicia Mercado makes the 50-minute drive from her home in Columbus to Springfield, where she runs the Adasa Latin Market store. She opened the business next to a Haitian restaurant in 2023, having spotted a gap in the market for Caribbean and Latin foods – the neighborhood’s Haitian population was booming at the time. But over the past year, she says her business, which includes an international money transfer kiosk, has taken a major hit. “About 80 to 90% of our customers were Haitians; now that’s down to about 60% over the past six months,” she says. “No more people are moving to Springfield.” Mercado’s experiences are being echoed around the town of 58,000 people that garnered international attention last year when Donald Trump falsely claimed during a presidential debate that immigrants were eating people’s pets. Until the end of last year, Springfield was something of a surprise economic juggernaut. A report from the Federal Reserve Bank of Cleveland found that it ranked second among all Ohio cities for job growth since the pandemic. New housing projects, worth hundreds of millions of dollars, among the biggest investments the city has ever made. That growth was partly fueled by the availability of manufacturing and blue-collar jobs that were eagerly filled by the more than 15,000 Haitian immigrants who had moved to the city over the past eight years, fueling businesses such as Mercado’s. Local companies got cheap, reliable labor, while Haitian workers received stable income, health insurance and a safe place to live. Many bought homes and invested their hard-earned income into improving the city’s housing stock that, in turn, padded the city’s tax coffers. For the most part, it was a win for all involved. But since then, the city’s economic fortunes have spiraled. Springfield businesses, big and small, are struggling in the aftermath of thousands of Haitians fleeing the town after the Trump administration’s termination of the humanitarian parole program for citizens of several countries, including Haiti, in June. On top of that, the government has ended temporary protected status, affecting the immigration status of more than half a million Haitians, which comes into effect on or before 5 February 2026. The Department of Homeland Security says conditions in Haiti have improved to allow US-based Haitians to return. However, violence prompted Haiti’s government in August to issue a state of emergency in parts of the country. The US Department of State currently has a level four “do not travel” advisory for Haiti. The consequences of these moves are being keenly felt in places such as Springfield. Since January, when the Trump administration took office, the percentage of manufacturing jobs in Springfield has been falling by double digits as the civilian labor force also declines, something thought to partly be fueled by Haitians leaving the city due to fear of the administration’s anti-immigrant rhetoric. At Topre America, an automotive parts manufacturing company north-east of downtown Springfield, dozens of jobs that Haitians had once filled – forklift drivers, supervisors and stackers – have remained unfilled on the company’s employment webpage for months. Unemployment has ticked up slightly in the city – but still at a rate twice the state’s increase – in the 12 months since Trump’s racist comments. In a city where income tax makes up the majority of municipal funding, the loss of thousands of Haitian workers means fewer dollars for public services for all residents. “Our tax revenue, which is the backbone of our general fund, has flattened. After years of strong growth post-pandemic, the rebound is behind us,” Springfield’s city finance director, Katie Eviston, reported at a city commission public meeting in June. Previous estimates had tracked that 2025 would see a 3.5% increase in income tax funds for the city. By June, that anticipated growth, however, had been wiped out in what Eviston said was a “level of decline [that] hasn’t occurred since the early days of the Covid shutdown”. Moreover, the city faces a worrying $4.25m financial hole due to the cancellation of a host of Biden-era programs and grants by the Trump administration. Springfield and its businesses aren’t alone in dealing with the fallout of the Trump administration’s immigration policies. Experts say it has consequences for businesses and companies right across the country. In June, the Association of Equipment Manufacturers (AEM) said that ending visas for international workers would leave 85,000 jobs unfilled. “Stripping [immigrants’] ability to work and threatening them with removal is not just a human cost; it is an economic one,” an AEM executive wrote in the Washington Examiner. Small communities in Indiana, Pennsylvania and elsewhere in Ohio that enjoyed an economic rebound in the aftermath of the pandemic are also experiencing depressed purchasing power due to White House-fueled job cuts. “Trump’s immigration policy slowed inflows. Suddenly, more firms have seen their immigrant worker supplies decline, forcing them to pay more to attract native workers, thereby placing upward pressure on inflation,” says Mark Muro, a senior fellow at the Brookings Metro thinktank. “This, combined with Trump’s tariffs, has created serious upward price pressure along with the rise in labor costs – not a great combination for many US producers in the heartland.” Without the ability to work, many Haitians are leaving the US. According to the Immigration and Refugee Board of Canada, more than 26,000 Haitians sought asylum there in the first six months of 2025, many who are thought to have fled the US. By contrast, just 21,756 claims were made for all of 2024. Many Haitians in Springfield, however, are stuck in place, without jobs and with bills mounting up. “A lot of people have work problems – we have lost half our customers,” says Youdins Solon, who helps out at his family’s Keket Bongou Caribbean restaurant in south-east Springfield. Solon moved to Springfield last March, having lived in Florida for 18 months prior. But by the summer, he lost his job at a local Amazon distribution center when his immigration status was revoked. He says he is one of hundreds who’ve been laid off. “I’m lucky because I have my family here, but for a lot of people, they moved [out of Springfield] because they were afraid of the situation.” But for those who have staked their businesses on a thriving immigrant community in Springfield, it’s not easy to pack up and leave. “We order Haitian food from companies in Florida and Chicago every two weeks,” says Mercado, “but now, that’s greatly reduced.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251028T130000Z",
    "date_download": "2025-10-28T13:21:32.765546+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/us-news/2025/oct/28/springfield-ohio-economy-haitians-trump-immigration",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "a1d4915b21555e5c18f168f30a758d15",
    "processed_at": "2025-10-28T14:25:05.935579",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the economic impact of immigration policies on the Haitian community in Springfield, Ohio, and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  }
]