[
  {
    "url": "https://www.bbc.com/news/articles/c8ey7w52j8ko",
    "title": "Ancient burial site by EWR at Haslingfield gets protected status",
    "text": "Ancient burial site by EWR gets protected status The integrity of a 4,000-year-old burial ground will be protected as part of the development of the East West Rail line. The site on Money Hill, between Haslingfield and Barrington in Cambridgeshire, is home to 11 ancient burial mounds which form part of a multi-period landscape. East West Rail aims to create a railway connecting Oxford to Cambridge via Milton Keynes and Bedford - with the preferred route of the line into Cambridge passing Money Hill. Tristan Lincoln-Green, Head of Environment at EWR Co, said: \"Our proposals have evolved through collaboration to ensure this nationally significant site is protected, demonstrating how development and heritage can successfully co-exist.\" The site - a so-called round barrow cemetery - was awarded protection from the Department for Culture, Media and Sport on advice from Historic England. Barrows are mounds of earth or stone of various shapes and sizes that are characteristic of the prehistoric periods from about 3800 to 1400 BC. The mounds at the site vary from 20 to 55 metres in diameter, suggesting different approaches to burial rites and indicating that the site was used over several centuries. Archaeological surveys have led to the discovery of six additional barrows at Money Hill, bringing the total amount on the site to 11. The protected area also includes some spaces between the individual barrows where there were flat burials. Geophysical surveys have revealed potential pits within some of the ring ditches - with three of the barrows visible as earthwork mounts despite centuries of agricultural activity. Due to the arrangement of the land, the railway firm evolved its original plans to place the railway in a cutting to a mined tunnel, which will also protect the integrity of the ancient site. Tony Calladine, East of England regional director at Historic England, said: \"The ancient burial grounds of Money Hill in Cambridgeshire demonstrate the importance of our historic landscapes and the stories they tell of our ancestors. \"The archaeological surveys carried out for East West Rail have given an amazing insight into Bronze Age life and led to the protection of this important site, connecting us with communities from the past as the infrastructure project connects people today.\" Follow Cambridgeshire news on BBC Sounds, Facebook, Instagram and X.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T090000Z",
    "date_download": "2025-10-22T09:20:33.280710+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/c8ey7w52j8ko",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "cb1063ebd7f9fbe10a6ebf75094fad09",
    "processed_at": "2025-10-22T11:21:35.652910",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses an ancient burial site and its protection status in relation to a railway development. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.nbcnews.com/weather/storms/tropical-storm-melissa-brings-flood-risk-haiti-dominican-republic-jama-rcna239063",
    "title": "Tropical Storm Melissa brings flood risk to Haiti , Dominican Republic and Jamaica",
    "text": "MIAMI — Tropical Storm Melissa dumped heavy rain on Hispaniola as forecasters warned Wednesday of a significant flood risk in parts of the Caribbean region in the coming days. The rains snarled traffic in the Dominican Republic’s capital, Santo Domingo, and games in the country’s professional baseball league were canceled. People in Haiti grew concerned over the possibility of heavy flooding, which has devastated the country during past storms given widespread erosion. Melissa had maximum sustained winds of 50 mph early Wednesday and was centered about 325 miles south-southwest of Port-au-Prince, Haiti, the U.S. National Hurricane Center in Miami said. It was moving west at 12 mph. A hurricane watch was in effect for southern Haiti, while Jamaica was under a tropical storm watch. Five to 10 inches of rain was possible in southern Haiti and the southern Dominican Republic through Friday, with greater amounts in some areas. Several inches also were expected in Jamaica, with smaller amounts forecast for northern areas of Hispaniola, Aruba and Puerto Rico. More heavy rain was possible past Friday, and there was a significant risk of flash flooding and landslides for the affected areas. Melissa was forecast to gain strength gradually, but the U.S. forecasters warned that its track and forward movement were uncertain and people in the region should remain alert.",
    "domain": "nbcnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T090000Z",
    "date_download": "2025-10-22T09:20:42.767156+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nbcnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.nbcnews.com/weather/storms/tropical-storm-melissa-brings-flood-risk-haiti-dominican-republic-jama-rcna239063",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "51e4ad3bbace23b56d571f3f1cb935a1",
    "processed_at": "2025-10-22T11:21:35.654244",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Tropical Storm Melissa and its impact on the Caribbean, focusing on weather conditions and flood risks. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://abcnews.go.com/Politics/wireStory/trump-nominates-new-army-vice-chief-current-general-126735872",
    "title": "Trump nominates new Army vice chief with current general just two years into the role",
    "text": "Trump nominates new Army vice chief with current general just two years into the role President Donald Trump has nominated Lt. Gen. Christopher LaNeve to serve as the Army’s second-highest-ranking officer, according to congressional records WASHINGTON -- WASHINGTON (AP) — President Donald Trump has nominated Lt. Gen. Christopher LaNeve to serve as the Army’s second-highest-ranking officer, according to congressional records. Gen. James Mingus is currently vice chief of staff and has not publicly said he plans to step aside. He has been in the job less than two years, and it is typically a tenure that lasts at least three years. The move, which was posted in congressional records Monday, is the latest in a series of surprise and unexplained firings, reassignments and promotions that have been transforming the senior ranks of the military under Trump and Defense Secretary Pete Hegseth. Officials in the Army and Hegseth's office would not offer any details on Mingus' apparent ouster and the effort to promote LaNeve, who is now Hegseth's top military aide. Maj. Peter Sulzona, a spokesman for Mingus, told The Associated Press by email that he would not comment on pending nominations but that Mingus “will continue to execute the duties & responsibilities of his position, focusing on warfighting and the wellbeing of our Soldiers.” Before taking up the vice chief post last year, Mingus was at the Joint Chiefs of Staff, starting in 2020 under then-Chairman Gen. Mark Milley. Milley, though appointed by Trump in his first term, would later anger the president and become a target for significant criticism in his second term. The nomination and replacement come less than a week after Adm. Alvin Holsey, the Navy admiral who is overseeing military operations against alleged drug boats off Venezuela, announced a surprise, early retirement in December. About a month ago, Gen. Thomas Bussiere, head of the Air Force's Global Strike Command, also suddenly announced his retirement, citing “personal and family reasons.” That came a little over a month after the head of the Air Force, Gen. David Alvin, also announced a surprise early retirement. Those retirements come after a spate of unexplained firings in August that included Lt. Gen. Jeffrey Kruse, then the head of the U.S. Defense Intelligence Agency; Vice Adm. Nancy Lacore, chief of the Navy Reserve; and Rear Adm. Milton Sands, a Navy SEAL officer who oversaw Naval Special Warfare Command. Kruse's agency produced an initial intelligence assessment of U.S. damage to Iranian nuclear sites that leaked to the press and contradicted claims from the Trump administration. In April, Hegseth also abruptly fired Air Force Gen. Tim Haugh, who was leading the National Security Agency and an admiral who held a top NATO post. Early in the administration's time in power, Trump also fired Air Force Gen. CQ Brown Jr. as the chairman of the Joint Chiefs of Staff, as well as the Navy’s top officer, the Air Force’s second-highest-ranking officer, and the top lawyers for three military service branches.",
    "domain": "abcnews.go.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T090000Z",
    "date_download": "2025-10-22T09:20:45.443997+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "abcnews.go.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://abcnews.go.com/Politics/wireStory/trump-nominates-new-army-vice-chief-current-general-126735872",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "fd925450cdb5bd92fa5e1abd8298d2e1",
    "processed_at": "2025-10-22T11:21:35.654415",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses military nominations and personnel changes within the U.S. Army and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/opinion/letters/article-public-safety-should-not-condemn-growing-numbers-to-incarceration/",
    "title": "Letters to the editor , Oct . 22 :  Improving public safety should not mean condemning growing numbers to grim , hopeless incarceration  ",
    "text": "War and peace Re “We the North” (Letters, Oct. 21): The ambassador of Russia to Canada writes that “high up North, not military competition, but peace and predictability must be a guiding national interest. Russia adheres to that principle.” The English diplomat Sir Henry Wotton once said: “An ambassador is an honest gentleman sent to lie abroad for the good of his country.” Ron Freedman Toronto It’s a shame that Russia does not abide by these principles elsewhere. Does the ambassador not see the irony in his statement? Dave Carson Hamilton Power drain Re “Alberta doubling down on AI data centres with new mandate for utilities minister” (Report on Business, Oct. 17): Artificial intelligence data centres use enormous amounts of electricity and fresh water. Someone should tell Big Tech that the majority of Alberta’s electricity is generated by fossil fuels. If they’re looking for clean electricity, they’ll have to build their own (not a bad idea) or look to provinces such as Quebec, Manitoba or Newfoundland and Labrador with almost emissions-free electricity. I find it ironic that Alberta produces the most greenhouse gas emissions by province and has essentially placed a moratorium on renewable energy, but now wants to attract energy-intensive AI data centres. Who would pay for the needed buildout of electricity generation? When Albertans want to turn up their air conditioners because summers are getting hotter, which group would get preference: AI data centres or Albertans? Reliability and affordability would become problematic. For the rest of Canada? Alberta emissions would go up. Albertans should call their MLAs before it’s too late. Ray Nakano Toronto Friends and enemies Re “Ottawa not concerned about U.S. stakes in critical minerals firms, minister says” (Report on Business, Oct. 17): I am exceedingly perplexed and troubled by the foundational basis on which Canada is approving “the U.S. government taking equity stakes in Canadian critical-mineral companies,” a move that Natural Resources Minister Tim Hodgson is “brushing off” on the basis that “the positions are small and the United States is an ally.” Yet at the same time, “Canada is currently in a trade war with the U.S. that is inflicting massive damage on the aluminum, steel, auto and lumber sectors. Mr. Trump has also repeatedly mused about making Canada the 51st state.” My question to the minister: What exactly is his definition of an “ally?” I know of no dictionary where an arrogant, unethical, aggressive, extortionate bully taking unfair and potentially destructive advantage of another party’s weakness to enrich itself was ever defined as an “ally.” I suggest the minister rethinks the situation. W. E. Hildreth Prince Edward County, Ont. Risk-averse Re “We must make Canada worth investing in again” (Report on Business, Oct. 20): The word “again” puzzles me. I wonder when, without the financial aid of U.S. business, that was exactly. There is an investment parable about two farmers, one American and one Canadian. On one side of a highway, we see a U.S. farmer employing an army of combines to work the fields in a well-funded co-operative. On the other side, we see a Canadian farmer selling pies on a card table with a sign offering two for the price of one. He has millions of dollars of equity in his farm, yet he sells pies to make ends meet. He says, “But I am happy.” “Do not bet the farm.” That is the reason many Canadian investors buy name-brand stocks, such as grocers, retailers and banks, that offer smaller yields. They can only hope the U.S. stock market lifts all boats, including those floating in Canada. Neil McLaughlin Burlington, Ont. Write off Re “Canada’s postsecondary system must pivot to meet economic challenges ahead, RBC report says” (Report on Business, Oct. 17): As a university teacher looking back on a 35-year career, I have never seen literacy levels as low as they are today. But I am skeptical of the Royal Bank of Canada’s endorsement of training in artificial intelligence as even a partial solution to the problems faced by educators with regard to national “productivity.” In particular, the article quotes the director of skills policy for RBC Thought Leadership to the effect that political science students should be able to use ChatGPT to write and edit e-mails. In fairness, she also recommends that they “know the risks of AI and how to use it responsibly.” Could we not aim higher? Students in all disciplines should be expected to write and edit their own e-mails. Only with basic competency in literacy would they be able to assess the considerable risks that AI presents – the greatest of which lies in destroying that competence. Hilary Turner Mission, B.C. Better way Re “Ottawa to proceed with promised bail reform legislation next week” (Oct. 17): “Tough on crime” measures that increase incarceration numbers and costs would further tilt the balance from rehabilitation to control, leaving fewer resources for psychological, vocational and educational support. Well-intentioned retreat from psychiatric institutionalization has driven many to less suitable institutions. The Mental Health Commission of Canada in 2021 estimated more than 70 per cent of inmates suffered mental health or addiction issues. Perhaps the unpromising reputation of prisons contributes to lighter sentencing and lenient bail. However, the Correctional Service of Canada’s 2023-2024 report found “substantial improvement in the percentage of federal offenders not returning to federal custody within five years of sentence expiration: from 83.3 per cent in 2014-2015 to 89.9 per cent in 2023-2024.” Would reducing imprisonment for non-violent crimes ensure violent offenders receive appropriate help? Improving public safety should not mean condemning growing numbers to grim, hopeless incarceration that leaves them more troubled and dangerous than at admission. Chester Fedoruk Toronto Look how they shine Re “A Saskatchewan star party draws amateur astronomers together in wonder” (Oct. 20): Many years ago when we lived in Calgary, my five-year-old daughter was a flower girl at a wedding in Camrose, Alta. Calgary was (and is) one of the most highly lit cities in Canada, so stars were difficult to see. As we were leaving the wedding reception in Camrose, it was quite dark and the sky had a marvellous display of stars. My daughter was in awe and somewhat annoyed. She scolded us, saying, “How come you never told me about this?” We had failed her! I am pleased to say I now live in a more dimly lit city, and on a clear night I can see the Big Dipper over the Salish Sea. Rosemarie Sherban Nanaimo, B.C. Letters to the Editor should be exclusive to The Globe and Mail. Include your name, address and daytime phone number. Keep letters to 150 words or fewer. Letters may be edited for length and clarity. To submit a letter by e-mail, click here: letters@globeandmail.com",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T090000Z",
    "date_download": "2025-10-22T09:20:57.191681+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/opinion/letters/article-public-safety-should-not-condemn-growing-numbers-to-incarceration/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "11535a8bff6293c85406f6e38e8977a5",
    "processed_at": "2025-10-22T11:21:35.655107",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.85,
      "topic": "AI Technology and Infrastructure",
      "explanation": "OpenAI: The article discusses the implications of AI data centers in Alberta, focusing on their energy consumption and environmental impact, which relates to AI technology and infrastructure.",
      "keywords": [
        "AI",
        "data centres",
        "electricity",
        "Big Tech",
        "emissions"
      ]
    }
  }
]