[
  {
    "url": "https://ekstrabladet.dk/nyheder/politik/danskpolitik/engell-om-mink-hastemoede-det-ender-bare-i-snak-snak-snak/10984765",
    "title": "Engell om mink - hastemøde : Det ender bare i snak , snak , snak",
    "text": "Der har været stort fokus på Mette Frederiksen og hendes slettede sms'er, hvilket nu har ført til, at hun senere onsdag skal i en hasteforespørgsel angående de slettede sms'er. Forespørgslen kommer i kølvandet på Berlingske og B.T. afsløring, hvor de har set hemmeligstemplet notat, der viser, at der andre metoder til at genskabe de slettede sms'er. Den politiske kommentator Hans Engell giver sit syn på hasteforespørgslen, inden den officielt begynder klokken 13.00 onsdag. Det er lidt ligegyldigt Det bliver påpeget af Engell, at selvom det for mange partier i dag bliver vigtigt at spørge ind til de slettede sms'er efter Berlingskes afsløring, så bliver det en lidt ligegyldig omgang. - Det ender ikke i noget, da en dommerundersøgelse vil blive stoppet af regeringen. Den erfarne politiske kommentator påpeger, at selvom der nok vil blive lagt en forespørgsel på en juridisk undersøgelse, så bliver den ikke til noget, da regeringen har et flertal, der gør, at de vil afvise den. - Det er ikke andet end at snakke og snakke og snakke og skælde ud og et politisk opgør mod Venstre, der har skiftet kurs også videre. Byttede sig til ministerbiler Hans Engell påpeger, at en af taberne i det her er Troels Lund Poulsen og Venstre. Det begrunder han med, at de under valget i 2022. Der stod Jakob Ellemann-Jensen og Søren Pape Poulsen og fortalte, at de ville starte en undersøgelse og rigsretssag mod Mette Frederiksen. - Ved at Venstre gik ind i regeringen valgte de også at droppe rigsretten til fordel for nogle ministerbiler. Engell pointerer, at de blå partier i oppositionen nok skulle have valgt en anden strategi, hvis de ville have kørt den sag til ende. - Hvis de skulle have kørt sagen til ende, så burde de forlange valg indenfor et år, hvor de måske ville have flertallet for det. Fortsætter ingen kommentarer? I den seneste tid har den danske statsminister været garant for to ord 'ingen kommentar', når det handlede om netop denne sag. - Det virker lidt arrogant, at hun bliver ved med det, men hun kan ikke sige voldsomt mere, siger Hans Engell. Fordi det største problem ved alt dette ifølge Engell er, at Berlingskes afsløring drejer sig om en anonym kilde. - Berlingske har talt med en anonym medarbejder, der har oplyst, at de muligvis godt kunne have kommet længere med hensyn til at komme ind i de der sms'er. Og det fik de besked på, at de ikke skulle. Problemet er bare, at ingen aner, hvem den efterretningsmand er, og hvad det er for nogen chefer, der sagde, at han ikke skulle gå videre, og hvad grunden er til, at de sagde det til ham. Afslutningsvis fortæller Hans Engell, at der nok ikke rigtig kommer noget ud af det i dag, da der flere borgere ifølge ham selv ikke interesserer sig for mink længere. - I går var jeg moderator for en debat i Rebild Kommune i Nordjylland, der var ikke nogen, der stillede spørgsmål til mink.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T100000Z",
    "date_download": "2025-10-22T10:21:08.110943+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/politik/danskpolitik/engell-om-mink-hastemoede-det-ender-bare-i-snak-snak-snak/10984765",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "7ca943423a27a1c02cbedb7571eeb02a",
    "processed_at": "2025-10-22T12:22:24.596699",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses political issues related to Danish Prime Minister Mette Frederiksen and her deleted text messages, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]