[
  {
    "url": "https://pressgazette.co.uk/publishing-services-content/how-affiliate-content-opens-paths-to-new-revenue-opportunities/",
    "title": "How affiliate content opens paths to new revenue opportunities",
    "text": "Publishers already know they can’t rely on traditional ways of earning revenue. Subscription models are dwindling. Slices of ad spend are thinner than ever. Creative solutions—like affiliate content — are strategic ways to maintain multiple streams of revenue without diluting your publication’s brand. And they can work—nay, must work—in tandem with a content licence in order to maximise their monetisation potential. Before we tie them together, let’s revisit what affiliate content is in the first place. When a brand wants to reach new audiences with their product or service, having a reputable publication mention them is a powerful PR win. But it doesn’t always happen organically. Instead, affiliate content is a solution whereby a publication partners with a brand to create content with a link to the brand’s product or service. In return, the publishers receive commissions for any sales initiated by that link. Commerce content exists in many forms, covering all types of editorial guides or reviews that lead to purchasing decisions. Affiliate content is a specific kind of commerce content that allows creators and publishers to leverage their audiences as affiliates for the partner brands. The win here is twofold: publishers earn extra money and brands reach new audiences more efficiently. For any publication considering affiliate content, the advantages go beyond just generating revenue. This content, whether it’s on your social media or website, reduces the dependence on ad sales and subscriptions that traditionally have supported many media brands. Creating affiliate content, however, doesn’t preclude developing a content licence at the same time. The content can work overtime for publishers. Brands will clamour to repurpose content to show audiences, “Look who’s talking about us!” While this repurposing provides synergetic visibility to publishers who, in turn, land in front of a brand’s audience, it doesn’t need to be free. Consider affiliate content as marketing assets that brands want to use. It’s valuable to them! Monetising it through a content licence also ensures some control over how a publication’s logo and content gets used. Incorporating a content licensing approach may involve adding a badge or bespoke logo to affiliate content, further diversifying revenue streams. Content licensing through affiliate content creates two new paths to revenue generation. Publishers earn money from any sales via the link and from a content licence hammered out with the brand to use specific content for marketing purposes. Beyond money, it also boosts the publisher’s reputation among audiences. By creating affiliate content for exciting or noteworthy brands, publications stay relevant and keyed into current trends. The most exciting part about affiliate content is that it can take any form your editorial team wishes, meaning it integrates naturally and as authentically as possible into your publication. It opens up possibilities to write editorial content and think pieces that can meaningfully mention affiliate brands in the process. Maybe a travel publication will publish an editorial about the benefits of driving versus public transportation in a destination, linking to a car hire service. Or perhaps a culinary website will interview a chef about the challenges of vegan cooking and link to a partner vegan food product. The possibilities are endless, but the goal is always the same: monetise content as much as possible to maintain visibility in this competitive media marketplace. Achieving these goals means partnering with the right people, and Wright’s Media represents some of the industry’s leading commerce content brands. As the premier global content licensing agency with 25 years of industry experience guiding publishing clients, Wright’s Media develops cutting-edge licensing programs, applies a proactive sales approach, and elevates brand visibility by monetising commerce content. Contact Wright’s Media to get your free licensing review from one of the most trusted authorities in the industry. Email pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog",
    "domain": "pressgazette.co.uk",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T094500Z",
    "date_download": "2025-10-22T10:04:44.380722+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "pressgazette.co.uk",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://pressgazette.co.uk/publishing-services-content/how-affiliate-content-opens-paths-to-new-revenue-opportunities/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c674040fd248cfdc2dd33c4904205aed",
    "processed_at": "2025-10-22T12:05:14.334916",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses affiliate content and revenue generation strategies for publishers, with no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://pressgazette.co.uk/paywalls/why-the-guardian-is-no-longer-dependant-on-page-views-to-drive-revenue/",
    "title": "Why The Guardian is no longer dependent on page views to drive revenue",
    "text": "The Guardian is generating some of its best revenue during days of lower traffic to its site. Liz Wynn, chief supporter revenue officer at The Guardian, said the publisher is “becoming less dependent on page views day to day”, and “some of our very best revenue acquisition days can be quite low traffic”. Wynn was speaking at Press Gazette’s Future of Media Trends event in London on Thursday, 16 October, in on a panel about reader revenue. The Guardian recently reported a bumper year for digital reader revenue, up by 22% from £88m in 2023/2024 to £107m in the year to the end of March 2025. It was also up 13% year on year to 1.3 million recurring digital supporters. “The truth is, if you want quality journalism, it needs to be funded,” Wynn said. “We are incredibly grateful to the 2.4% of our over 100 million monthly readers who do put their hand in their pocket and support us every year. It’s vital.” Wynn said revenue is less traffic-driven “because we have so many levers now that we can pull to drive strong acquisition performance”. “Those of you who read The Guardian will see all sorts of different marketing assets that we deploy from time to time.” Email ‘very important channel’ Wynn listed these marketing assets as its multichannel marketing campaigns, such as email, “campaign moments” and developed end-of-article “epics” (contribution asks at the bottom of articles). [Read more: The Guardian tells marketers to stop buying intrusive online ads] The Guardian started asking readers for contributions to support its journalism in 2016, which “used to drive 80% of our reader revenue, and in those days, reader revenue did flow very much with page views”, Wynn said. “What’s happened in recent years is we’ve got more sophisticated around our multichannel marketing campaigns… email is a very important channel for us. We have some banners, which you’ll see pop up, plus the headers and footers and other interstitial messaging.” Less reliance on news agenda, focus on marketing messaging The publisher has also become less reliant on news content and focused more on marketing messaging to generate revenue. “We’re thinking a lot about the calendar as well, to decouple our reliance on the news agenda through campaign moments and always-on marketing messaging,” Wynn said. “So, you’ll see activity around the end of year, particularly driven for the US audience which is accustomed to making donations at that time of year.” Examples of this include the publisher’s “unique” climate coverage, and marking World Press Freedom Day (and also the Guardian’s 204th birthday) in May “this year with a campaign which spoke to our independence and our ownership model”. “Those are moments which allow us to generate intent to support independent of what’s going on in the news,” Wynn said. Reader makes up 64% of Guardian funding ‘Epics’ (the long supporter messages which have to be cancelled in order to read mnany Guardian stories) are still “impactful” in financially supporting the paper but have developed over time. “As we talk about the journey of The Guardian and how we’ve pivoted in the digital sphere, from starting off with the open web and being predominantly advertising funded to being increasingly direct-funded by our readers, we uncovered this notion that, yes, people do want to support us, and they didn’t really necessarily need that much in return,” said Wynn. This led to The Guardian offering readers the option to donate on a one-off or recurring basis. Between its print and digital business, 64% of Guardian funding comes from subscriptions, donations and newsstand. “For a long time, we actually had two buttons on the website: do you want to donate, or do you want to subscribe? Now that was complicated, and so we unified it under the single thought of support,” Wynn explained. “Today if you come to The Guardian, you’ll be asked ‘Do you want to support us? … And then underneath that, when you hit that button, we’ll give you a range of mechanisms through which you can do that, essentially product choices.” The Guardian uses tools to “control the frequency” of when epics and banners appear. “We do recognise a point of diminishing return, and apply caps,” said Wynn. “That said, while we try not to spam everybody all the time, if you really want to get rid of the messaging, please subscribe.” Regular monthly or annual donations are “the most impactful way” The Guardian receives financial support – “and that covers everybody who’s either donating or subscribing to one of our added-value, feature-led subscription products”. The publisher’s subscription products include its cooking app Feast and its premium app (which only allows free subscribers to read a limited number of articles). “We remain free to read on the web, which is an incredible marketing platform for us, and we’re always looking to upsell to our highest value subscription products. Year on year we are seeing continued strong revenue growth and the subscription products are driving the larger part of that.” Subscription conversion through personalised paywalls Adriana Whitley, director of FT Strategies, shared a different approach to boosting reader revenue through personalised paywalls with the Financial Times. “We are experimenting with a different, more personalised paywall,” Whiteley said. “So we’ve tested this a few years ago, understanding how that impacts the propensity to convert…[and] a little bit more what is the type of content that would make the person subscribe, which is, in practice, just inserting a new step within the paywall journey. “What paywall do you show for that specific user? And that has incredible impact.” When the personalised paywall was tested for the first time, the conversion rate increased by 36% – she said. “Now we [have] a much more sophisticated comparison, which is much higher, the preliminary data is showing an increase of 290%.” [Read more: FT says AI-personalised paywall messaging has quadrupled conversion rate] Whiteley added personalisation has been a “success” as people are “more likely to subscribe” if they “see something they remember”, like an article they have already read. Personalised advertising and messaging Whiteley added that publishers need to invest more in marketing, and knowing their users enables them to target that marketing more effectively and understand “the different entry points of the audience and how you can monetise them”. Whiteley added: “Programmatic advertising at scale when you don’t have any information about the viewer, that is probably the bit that is the most damaging. “But on the other hand, higher end of advertising where you know who you’re speaking to is having resurgence.” Whiteley added “premium packages”, including extra benefits such as discounts or access to events, are “coming up now just as a way to extract more value from those readers that we engage with”. AI ‘part of creation process’ for FT Personalised subscription messaging is AI-chosen, but not AI-written, Whiteley said. “One of the things we are using AI for is to recommend headlines and be part of the creation process. Humans are still responsible for the content and so are the final editors – AI doesn’t do reporting though.” She added “trust comes from having responsibility for that content”. AI is also being used to tag archives to “understand your audience”, said Whiteley, adding it can speed up the process of analytics to achieve this too. “You can see much better what is the causation that is bringing different clusters of audience. Because journalists hate tagging stuff, so you write the whole article, whatever is the category, but that’s one thing that AI does really well. “So, before I used to look at those archives, and it takes you three months to be able to analyse the segment, your base and your audience, and you have to do that high level. “But now with AI, you can do that in a couple of weeks, and you can test different types of biases and different types of niche content or people, and you can do quite a lot more analysis to be able to identify those clusters and causes of your attraction.” Email pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog",
    "domain": "pressgazette.co.uk",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T094500Z",
    "date_download": "2025-10-22T10:04:45.191009+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "pressgazette.co.uk",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://pressgazette.co.uk/paywalls/why-the-guardian-is-no-longer-dependant-on-page-views-to-drive-revenue/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "fb5279635fb2cdf0bd23904164530f6b",
    "processed_at": "2025-10-22T12:05:14.335235",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.85,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article discusses how The Guardian is utilizing AI for personalized subscription messaging and analytics, indicating a focus on AI applications in the media industry. While the primary focus is on revenue generation strategies, the mention of AI's role in enhancing these strategies makes it relevant to AI topics.",
      "keywords": [
        "AI",
        "personalised paywalls",
        "recommend headlines",
        "analytics",
        "tag archives"
      ]
    }
  }
]