[
  {
    "url": "https://www.bbc.com/news/articles/cj3zer88yrzo",
    "title": "South Korea : Teacher who fatally stabbed student jailed for life",
    "text": "Teacher who killed eight-year-old jailed for life in South Korea A South Korean court has sentenced a teacher to life in prison for fatally stabbing an eight-year-old girl, in a case that shocked the nation. Myeong Jae-wan, 48, killed Kim Hae-neul, after luring her into a classroom in the central city of Daejeon in February. Prosecutors had sought the death penalty for Myeong, saying that the victim's family had asked for a harsh punishment. But the court said that while \"the risk of reoffending is high, it is difficult to conclude\" that Myeong must be executed. Myeong said that she would reflect on her mistakes for the rest of her life. She said her judgement had weakened at the time of the stabbing as she was receiving mental health treatment. Prosecutors said Myeong showed no remorse while the case was being investigated. However, Myeong submitted dozens of letters to the court expressing remorse. Myeong had previously requested a six-month leave of absence, citing depression, but returned to school in 20 days, after a doctor assessed her as being fit to work, the Daejeon education office said in February. She had displayed violent behaviour in the days before the stabbing, including putting another teacher in a headlock, the education office said. On the morning of the stabbing, two education officials had visited the school to investigate that earlier altercation. Myeong told police that she had bought a weapon on the day of the attack and brought it to school, planning to kill herself along with a random child. She also told the police that she had lured Kim into the media room before attacking her. Kim, the student, student was reported missing after a bus driver informed the school that she had not arrived to be picked up that day. She was found in school later that day with stab wounds, along with Myeong. Myeong also had a wound on her neck, which police said might have been self-inflicted. It was stitched up later in hospital. South Korea's leaders at the time called for safety measures to ensure such incidents never happen again. Myeong has also been ordered to wear an electronic location tracking device for 30 years. \"As an elementary school teacher, the accused was in a position to protect the victim,\" said the court's verdict on Monday. \"But she committed this brutal crime in which a child was not protected where they should be most safe.\"",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:08.916865+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cj3zer88yrzo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "329467dc1a08bceb3a3bb91566cc1eb4",
    "processed_at": "2025-10-20T11:02:10.115078",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a criminal case involving a teacher who fatally stabbed a student, focusing on the legal proceedings and the circumstances surrounding the crime. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/lifeandstyle/2022/sep/17/this-much-i-know-grace-jones-how-these-young-girls-twerk-i-dont-know",
    "title": "Grace Jones :  Even if I stand on my head , I still cant do it . How these young girls twerk , I dont know  | Life and style",
    "text": "I was raised in Spanish Town, Jamaica, by my grandmother and step-grandfather. My grandmother’s brother was a Pentecostal bishop, so we were made examples of at the Jamaican Pentecostal church, where the Bible is interpreted very literally. I wasn’t allowed to wear trousers or straighten my hair, so combing my hair was very painful, and I would be punished if any of my actions were considered idle. At 18 I travelled to Paris, Italy and New York – and took a lot of acid. I found it mind-opening. There were always doctors around, so it never really felt dangerous, even when I took an STP, a super trip pill, and couldn’t come down for at least three days. I decided to pursue acting after performing at my first summer stock musical at Saint Joseph’s college in Philadelphia. The modelling was just a way to pay my rent. I didn’t want to go home to Jamaica. I thought: “If I’m going to act, I might as well try everything.” I took as many jobs as I could – for one week, two weeks, a month – just to learn the process. The first magazine to hire me was GQ in New York, but they wanted me to wear a wig. I remember flicking through it and thinking: “I don’t even recognise myself. This isn’t going to work.” I never wanted to move to Hollywood – I never did – so when I first went there to film Vamp, I surrounded myself with friends: Keith Haring [who body-painted Jones], Andy Warhol, Antonio Lopez. I lived like a vampire: up all night, asleep all day. Roger Moore made me laugh on A View to a Kill. I’d heard he had a reputation that lightened the mood: he’d hide sex toys around the bed and goose you with them. I beat him to it. I went down to the prop room and found a huge black-and-white polka-dot dildo, strapped it on under my robe, and surprised him instead. My biggest regret is not doing Blade Runner. Jean-Paul Goude – my son’s dad – and Ridley Scott were very competitive as artists. Ridley wanted me to play a snake lady, but Jean-Paul was very French and didn’t like to share. My son, Paulo Goude, is my greatest achievement. He’s a songwriter, producer and incredible musician – and my beautiful granddaughter, too. The last time I cried was during Covid. I got detained at an airport. I’m not going to say which country. I like to leave a little mystery. When I worked as a go-go dancer, I called myself Grace Mendoza. I learned how to tweak one side of my ass, then tweak the other and make it jump. Now I can’t do the dances they do in Jamaica. I try so hard to make my whole butt bounce up and down, but even if I stand on my head, I still can’t do it. How these young girls twerk, I don’t know. How would I like to be remembered? Remember me as the whole tequila, worm and everything. I’m not scary if you haven’t done something to make me scary. I’ve realised that when some people lash out, it’s not really me they’re lashing out at. They usually have a problem with themselves. So I stopped hitting people. Let’s just say that I don’t beat anybody up any more. Grace Jones has partnered with Boy Smells to launch the limited-edition Grace candle, available from Space NK",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:11.106513+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/lifeandstyle/2022/sep/17/this-much-i-know-grace-jones-how-these-young-girls-twerk-i-dont-know",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "87c0ee09a00f898e080a3edf79a215fa",
    "processed_at": "2025-10-20T11:02:10.119473",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses Grace Jones's personal experiences, career, and reflections on life, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/20/politics/trump-no-kings-protests-vance-cia-analysis",
    "title": "Trump response to  No King marches only proved the protester point",
    "text": "A president steeped in constitutional lore might have been offended by claims he’s acting as a king. But Donald Trump and his entourage responded with mockery to weekend “No Kings” protests by millions of Americans — embracing the narrative in a way that explains his growing hubris and belief that he has unchecked power. The president and Vice President JD Vance this weekend both posted AI memes to social media depicting Trump in a crown. The one Trump shared was a mocked-up vision of the president flying a fighter jet emblazoned with “KING TRUMP” appearing to dump raw sewage on protesters. In Vance’s troll on Bluesky, a site popular with liberals, prominent Democrats knelt as supplicants in a royal court before Trump, the divine and absolute ruler. It was a clever political trick. MAGA supporters can blast anyone who takes offense to the posts as lacking a sense of humor and being prim. The posts also trivialize protesters’ gravely serious claims that America is witnessing a wannabe autocrat. But they also subtly advance the thesis that Trump is all-powerful and immune from dissent, an attractive proposition to voters who like a strongman. Trump’s post is not only juvenile but also betrays striking contempt for tens of millions of Americans he ostensibly leads and for the concept of democratic free speech. He’s far from the first major political figure to express disdain for voters they don’t agree with. Presidents Barack Obama and Joe Biden, as well as 2016 Democratic nominee Hillary Clinton, all had their moments. And a sense that liberal elites disrespected heartland Americans was fundamental to Trump’s rise to power. Moreover, Democrats seem to have done little self-reflection over whether their aggressive push to implement their progressive values alienated more conservative Americans and contributed to their own defeat in 2024. But the president’s social media baiting would be easier to laugh off if it weren’t for multiplying actions that reinforce his pretensions to absolute power and the obliteration of constitutional curbs meant to ensure kings don’t again rule America. He’s implying there’s no room for those who don’t support him and showing he’s willing to force them into line. Whether such leadership is forcing the country inexorably closer to a political and social fracture or a pride-induced fall by Trump and his gang will become clear in the months to come. The stakes are especially high amid a government shutdown the president appears to have no desire to end. But as Trump’s behavior becomes more imperious and as opposition gathers — from street protests to more universities refusing to bend to his ideological will, and judges temporarily halting his orders for troops to enter US cities — tensions and divisions are rising. The president shows no sign of changing course. He called Saturday’s mass protests a “joke” and described them as “very small, very ineffective.” The people who took part were “whacked out,” Trump said. “When you look at those people, those are not representative of the people of our country,” he told reporters aboard Air Force One on Sunday. Trump’s latest monarchical moves Trump’s recent track record reinforces perceptions that his denial that he sees himself as a king is yet another of his uncountable untruths. His stunning commutation Friday night of the seven-year sentence of former Rep. George Santos, who pleaded guilty to fraud charges, was the president’s latest parody of the legal system that he unapologetically wields as a tool to help his friends and hurt his foes. This followed his demands that ex-FBI chief James Comey and New York Attorney General Letitia James be charged with crimes, which were followed by indictments scant weeks later. Santos on Sunday related to CNN’s Dana Bash how he’d been alerted to his impending release by other prison inmates who heard about it on TV. On “State of the Union,” Santos said, “I’m pretty confident that if President Trump had pardoned Jesus Christ off of the cross, he would have had critics. So that’s just the reality of our country.” But Rep. Nick LaLota, Santos’ former GOP colleague from New York, said of Santos: “He stole millions, defrauded an election, and his crimes (for which he pled guilty) warrant more than a three-month sentence.” Pardoning and commutations are one of the few areas where the Constitution suggest presidents do have unaccountable power. But Trump’s treatment of Santos, which was far from his first highly political show of clemency, was an audacious statement that the US legal system’s reputation for blind justice now risks being tainted by made-to-order prosecutions and his regal whims. (Of course, Republicans will respond that Biden pardoned members of his own family, so all is fair game.) The president’s authoritarian writ is also being extended abroad. ► Defense Secretary Pete Hegseth announced Sunday that the US military conducted a seventh strike against a boat in the Caribbean that the administration claims was manned by narcotics traffickers. “These cartels are the Al Qaeda of the Western Hemisphere, using violence, murder and terrorism to impose their will, threaten our national security and poison our people,” Hegseth said. ► Trump’s promises to get tough with drugs traffickers who have caused great misery inside the US resonated with many voters last year. But the administration’s unilateral designation of traffickers as terrorists and assumption of authority to kill them without due process, while ignoring Congress’ authority over war powers, is arguably illegal and unconstitutional. It places the United States in a category of nations that mock the rule of law and opens the door for others to do the same. “All of these people have been blown up without us knowing their name, without any evidence of a crime,” Republican Sen. Rand Paul said on NBC’s “Meet the Press” on Sunday. “If they want all-out war where we kill anybody and everybody that is in the country of Venezuela or coming out, that has to have a declaration of war,” the Kentucky Republican said. “It’s something that is not pretty, very expensive, and I’m not in favor of declaring war on Venezuela, but Congress should vote. The president shouldn’t do this by himself.” ► Trump last week detailed his decision to authorize covert CIA operations in Venezuela, prompting debate over a possible regime-change strategy against the brutal rule of President Nicolás Maduro. On Sunday, Trump stoked speculation of further US military action in the Western Hemisphere, warning that if Colombian President Gustavo Petro didn’t “close up these killing fields” where drugs are produced, “the United States will close them up for him and it won’t be done nicely.” Curtailing drugs trafficking might be a laudable goal, but Trump’s methods threaten to bolster an imperial presidency and change America’s global reputation. His administration’s refusal to produce evidence of its claims or to try to build support for a potential military campaign is another example of contempt for the democratic process — one that is fueled by the genuflection of most Republicans in Congress. The saga is unfolding as Hegseth’s Defense Department has kicked out journalists who refused to sign the administration’s draconian new press regulations. The civilian leadership of Pentagon looks scared of scrutiny — a position that risks eroding public support for the military. That possibility is only reinforced by the administration’s determination to deploy troops on American soil. Protesters challenge the administration’s dismissal of demonstrations Trump aides tried to diminish and defame the “No Kings” protests that drew millions of people to more than 2,700 events in 50 states and were largely peaceful. White House press secretary Karoline Leavitt claimed the Democratic Party’s constituency was made up of “Hamas terrorists, illegal aliens, and violent criminals.” House Speaker Mike Johnson branded them “hate America” rallies made up of the “pro-Hamas wing” and “the Antifa people.” There is a seam of the Democratic base nurtured by left-wing protest movements that many centrist Americans regard as extreme. But impressions gathered around the country by CNN reporters also indicated that many people with more moderate views also took part in protests that felt like block parties to register concerns about a president many of them see as un-American. Demonstrators dressed as frogs, chickens and Statues of Liberty mocked the unhinged rhetoric of the administration about the protests just as effectively as the president’s vulgar social media posts mocked them. “We have millions of people turning out today,” Colleen Connell, executive director of the Illinois chapter of the American Civil Liberties Union, told CNN’s Fredricka Whitfield on Saturday. “There are clearly more of us than there are of those who want an autocracy or a dictatorship. And so the message is pretty clear that we, the people, you know, own this country and that we are going to respect the rule of law and we are going to stand up and we are going to protect our democracy with peaceful protest and peaceful dissent.” In time, Saturday’s protests may come to be seen not just as a reaction to Trump’s first nine months in power but as a harbinger of greater resistance to come. At the least, they show that while many of Trump’s supporters back tough-guy policies like expanding Immigrations and Custom Enforcement raids and extrajudicial executions of claimed drugs traffickers on the high seas, many other Americans don’t. And while warnings of encroaching authoritarianism may initially have seemed overblown, growing numbers of Americans seem to think that sitting on the sidelines is untenable. This follows a warning by Obama on Marc Maron’s final podcast that it wouldn’t be a huge sacrifice for more Americans to make their views known a year before midterm elections. “We’re not at the stage where you have to be like Nelson Mandela and be in a 10-by-12 jail cell for 27 years and break rocks,” the former president said. Organizers claimed 7 million protesters came out at the weekend. If that’s true, that means nearly 10% of the 75 million people who voted for Kamala Harris last November left their homes to join a protest. Retired government worker Peggy Cole of Flint, Michigan, told CNN’s Veronica Stracqualursi she traveled to Washington for a protest because it was a “scary time.” “It seems to me, (Trump is) taking our government, our democracy, and dismantling it piece by piece, slowly, but surely, if we sit by and don’t do anything about it,” Cole said. Asked for comment about the protests, White House spokesperson Abigail Jackson wrote back: “Who cares?” That’s a response that breathes contempt for the values protesters claim to be protecting. But it also reveals a White House that believes its increasingly monarchical leader has no need to listen to the aspirations of those he regards as below him. In some ways, Trump is proving the protesters’ point.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:13.783371+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/20/politics/trump-no-kings-protests-vance-cia-analysis",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "09590bba995bd59d770973434235b843",
    "processed_at": "2025-10-20T11:02:10.119832",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses political events and the actions of Donald Trump, with only a brief mention of AI memes shared on social media. The focus is on political commentary rather than artificial intelligence.",
      "keywords": [
        "Trump",
        "protests",
        "politics",
        "memes"
      ]
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/20/style/ddlj-bollywood-30-years-anniversary-intl-hnk-dst",
    "title": "  DDLJ : Why a Bollywood classic about forbidden love still captivates Indian movie - goers 30 years on",
    "text": "Inside the Maratha Mandir movie theater, audience members jump to their feet as the first notes of an iconic mandolin riff play, their bodies casting silhouettes against the opening credits of a film screened here nearly every day for 30 years. A joyous, collective roar erupts from the rows as the lead actors share their first fated glance. Near the front, a young couple mirrors that gaze, their wedding photographer capturing a timeless moment against the iconic backdrop. Governments have fallen, and a new millennium has dawned, yet people still come to this Mumbai cinema to immerse themselves in the comfort of a love story known by heart, for less than $1 a ticket. Released in 1995, “Diwale Dulhania Le Jayenge,” commonly referred to as “DDLJ,” tells the story of two young Indians, Raj Malhotra and Simran Singh, raised in London, who fall for each other during a freewheeling trip across Europe, only to face the ultimate test – earning her father’s approval. It became a cultural touchstone and the second-highest-grossing film of its decade. Since then, the cinema’s daily showing has drawn young Indians dreaming of their own epic romance, those seeking a brief escape from the pressures of city life in Mumbai, and curious tourists who want to see the fandom up close. “I watch it almost every day,” said Suneel Shedge, a 50-year-old diamond worker from a nearby neighborhood who speaks with leading man charisma, and is prone to bursting into songs from the movie. As the film hits its three-decade anniversary this month, he has come to pay homage to what he considers Bollywood’s greatest love story. “Sometimes I cry, sometimes there’s pain. There’s happiness, there’s sadness,” he said. “A movie like this will never be made ever again.” It’s the “most beautiful love story,” said 23-year-old Vaishnavi Deshmukh, who has lost count of how many times she has seen the film. “I can’t explain how I feel,” her boyfriend, Tejas Raout, 23, said. “It’s nostalgia.” In many ways, “DDLJ’s” narrative mirrors India’s own pivotal journey in the early 1990s — a nation shaking off its socialist slumber, opening its arms to the world, and finding a confident new voice that was both global in its outlook and Indian at its core. This cultural resonance also had a seismic effect on its cast. The film catapulted Shah Rukh Khan and Kajol, who played lovers in the film, from rising stars into cinema royalty, cementing them as the definitive on-screen couple for years to come. Yet, pinning down the exact formula which created this cultural phenomenon is impossible, said prominent Indian film critic and writer, Anupama Chopra. You can’t attribute its success to “just one single thing,” the author of “Dilwale Dulhania Le Jayenge: A Modern Classic,” which analyzes the film’s commercial triumph, told CNN. “When the cinema gods deem that you create a classic, the stars align. Everybody’s stars align. And you get a film like this, which I think becomes a romantic blueprint for many generations.” Capturing the national zeitgeist In 1995, India was a nation beaming with endless possibility. Four years after the floodgates of economic liberalization had been thrown open, the country was in the midst of a cultural awakening. The state-run Doordarshan, which aired a mix of entertainment and news, was now competing with the vibrant pulse of MTV and Star TV, while the Indian-manufactured Ambassador car vied for space on the road with models made by Japan’s Maruti and South Korea’s Daewoo. On giant billboards towering over cities, Coca-Cola returned to wage war against Pepsi, and the American daytime soap opera “The Bold and the Beautiful” had become a household name. This influx of choice created a thrilling but anxious juxtaposition: Indians were captivated by globalization but also fearful of losing their own identity. Into this cultural moment, stepped filmmaker Aditya Chopra (no relation to film critic Anupama Chopra), the son of the late Yash Chopra — Bollywood’s legendary “King of Romance.” “In the ’90s, the mood was about aspiration. The mood was about looking westward,” he said in the 2023 Netflix docuseries, “The Romantics,” which chronicles his family’s contribution to Indian cinema. In his early twenties, Aditya Chopra had an idea for his directorial debut: a script he wrote that would capture the energy of his own generation. In “DDLJ,” Simran, the devoted daughter of Baldev Singh, a hardworking owner of a corner shop, is initially not attracted to Raj, the low-achieving but fun-loving son of a wealthy immigrant. As they dance and sing their way through Switzerland, however, they eventually fall in love. But Simran’s stern, conservative father, has already arranged her marriage to another man. “Love was always rebellious, against the parents,” Aditya Chopra said of other films at the time. “That always bothered me.” So, instead of eloping in defiance of tradition, the charming Raj embarks on a mission to win Simran’s father’s approval in elaborate, often comedic ways. Simran, on the other hand, struggles between her duty as a daughter and her desire to marry the man she loves. In the film’s climax, Baldev looks at his daughter and grants her his blessing. “Go, Simran, go. Live your life,” he says. What follows is an iconic sequence, captured in slow-motion: Simran’s desperate sprint down a train platform after ditching the planned wedding, her traditional bridal attire and thick, black hair billowing in the wind, Raj’s hand outstretched from the carriage door, his face bloodied after a fight with Simran’s doomed fiancé, and the triumphant embrace as he pulls her up to safety. The first half of the film unfolds in the cosmopolitan landscapes of London and continental Europe, while the second half transports the audience to the agrarian fields of India’s Punjab state. The characters take elements of Western culture to India, including the clothes they wear and their attitude towards love in a society where, in the mid-nineties, many parents claimed the right to choose — and veto — potential spouses. The central conflict captivated the nation back then and continues to resonate with many young Indians today. For viewers like Deshmukh, who was at the Maratha Mandir screening, the takeaway is clear: “Parents matter the most,” she said. The score, composed by the duo Jatin-Lalit, created an enduring legacy, producing an all-hit album whose songs became timeless anthems for romance and celebration. All these years later, people “watch it for the music,” said Lalit Pandit. “I could feel right away this wasn’t just another film,” Manish Malhotra, the designer behind the movie’s costumes, told CNN. “(Aditya Chopra) was a first-time director, yes, but the way he spoke about Raj and Simran was so vivid, emotional, and precise that you almost saw the film come alive in that very moment.” Malhotra, who went on to become one of India’s leading fashion designers, was particularly inspired by the duality at the heart of the film’s message, which he channeled directly into Simran’s wardrobe. He looked at her “not just as a heroine, but as a young woman caught between London and Punjab, her wardrobe needing to echo both her Western upbringing and her Indian soul.” Simran wore short skirts and halter dresses, reflecting what young Indian women were wearing in the West. Meanwhile, “every pastel salwar, every floral skirt, every dupatta drape was about telling her story with authenticity,” he said, referring to some of her traditional Indian outfits. On the film’s impact, Malhotra admits he couldn’t have predicted its eventual scale. “But I did know it was special,” he said. “Because when you connect to a story that deeply, when the characters feel that real, the work flows with sincerity. And that sincerity has a way of staying with people long after the film is over.” Impact on future romance films “DDLJ” was the first mainstream Bollywood film not just to represent Indians living overseas but place their unique cultural conflict at the very core of its narrative. Prior to the film’s release, Indians abroad were rarely heroes in Bollywood movies. They were confined to negative archetypes: the villain who had lost his Indian values, or the seductress whose drinking and smoking habits signaled moral corruption. “One of the reasons that ‘DDLJ’ is so amazing is that there’s a piece of everybody there in it,” said Snighda Sur, founder & CEO of The Juggernaut, a media platform that writes stories about South Asia and the South Asian diaspora. “If you’re very Indian, and if you’re very nationalist… this film is about returning home to India… and getting permission the right way. If you’re a diaspora kid, you’re saying ‘we haven’t forgotten our traditions,’” she told CNN. “You see two people who really want to be together, fighting for something they believe in. For Indians, and specifically from my experience… that’s the story of my life,” said Indian Canadian YouTuber Lilly Singh in the “The Romantics.” “I know, deep down, I really seek my parents’ approval. And that’s why the ending of ‘DDLJ’ meant so much to me.” The wider Indian diaspora’s connection to the movie was immediately tangible and reflected in the box office numbers at the time. Made on a budget of less than half a million dollars, “DDLJ” earned nearly $2 million overseas, according to movie analyst Taran Adarsh. Back home, it became a blockbuster hit and the highest grossing film of 1995. But beyond numbers, it created the blueprint for the modern Indian film that would dominate Bollywood for the next decade; “a watershed moment,” according to the author Anupama Chopra. The cinematic landscape prior to “DDLJ” was defined by two prevalent narratives. There was the “angry young man”— a working-class protagonist, typically a victim of a corrupt system, whose story was driven by a quest for vengeance or social justice. Then there were the family melodramas centered on romances thwarted by stark class divides. Crucially, both worlds were almost exclusively rooted in India. Aspects of “DDLJ’s” s storyline influenced a string of future blockbusters, from “Pardes” (1997), which explored the search for a traditional bride for a Westernized son; the grand family saga “Kabhi Khushi Kabhie Gham” (2001), centered on a wealthy patriarch’s disapproval of his son’s marriage to a commoner and set between London and New Delhi; and “Kal Ho Naa Ho” (2003), which tells the story of love and sacrifice within New York’s vibrant Indian community. “DDLJ” also launched the legendary on-screen pairing of Khan and Kajol, who have starred in seven major films together, setting the gold standard for Bollywood romance for decades to come. “When you keep repeating (their pairing) and it keeps attracting an audience, it cements their position,” Anupama Chopra said. “And off the top of my head, I can’t think of any pairing that had that sort of longevity.” A step back in time Back at the Maratha Mandir, walking into the screening of “DDLJ” feels like stepping into a time capsule. A living museum of a bygone era, the building is an unassuming structure, its age showing in dilapidated sections and torn posters clinging to its gates. Inside, faded red leather seats evoke a classic, old-world ambiance. Popcorn and chips are still sold in simple, vacuum-sealed plastic bags. “People from all around the world come here,” said its manager Manoj Pandey, who has been working at the institution for 15 years. “When the movie came out in 1995, no one thought we’d be here watching it 30 years later… But it was definitely right after the opening that it was going to become a blockbuster and have a long life.” They still sell about 100 tickets a day, he said. The theater’s owner briefly flirted with the idea of stopping the show in 2015. But the announcement was met with outcry from the public. “We received hundreds of letters in protest,” said Pandey. Earlier this month, Khan and Kajol reunited on stage for the Filmfare Awards, one of India’s most notable annual events that honors excellence in Hindi cinema, where they danced to one of movie’s most beloved songs, “Tujhe Dekha Toh,” which translates to “When I See You.” Yet, for all the love and adoration, there are moments from the film that haven’t aged so well, according to some fans. Viewed through a contemporary lens, the film’s gender politics feel dated, said “The Juggernaut’s” Sur, particularly in a scene where Raj gaslights a panicked Simran into believing they slept together after a night of drinking. This is compounded by the reduction of Simran’s agency to the singular goal of marrying her beloved, leaving her own personal ambitions completely unexplored. “What does she do? What are her work ambitions?” Sur said. “I want to know more about what she’s studying, where she wants to work.” For Anupama Chopra, the whole idea of Simran “being parceled between lover and father” is equally frustrating. “But every film is a product of its time,” she said. “And I can tell you at the premiere, none of us thought there was any problem with it because we didn’t know any better. We were swept by the romance.” At the Maratha Mandir, crowds casually trickle in, well into the film’s three-hour runtime. It’s clear that most have seen the movie before, yet when a big moment arrives, phones go up to capture it for social media as cheers erupt with a joy that feels brand new. Sitting in one of the back rows, the diamond worker Shedge takes it all in. “As long as I’m alive and until my last breath,” he said. “I’ll keep watching this film.”",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:14.348885+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/20/style/ddlj-bollywood-30-years-anniversary-intl-hnk-dst",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "625c90029305520741505160fc49a780",
    "processed_at": "2025-10-20T11:02:10.120369",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about the cultural impact and legacy of the Bollywood film 'DDLJ' and does not discuss any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/20/asia/south-korea-shipyards-us-navy-intl-hnk-dst-ml",
    "title": "US Navy shipbuilding is  a mess . South Korean companies think they can help fix it",
    "text": "US President Donald Trump wants to “Make American Shipbuilding Great Again.” And leaders at two South Korean shipyards say that, given the chance, they could do just that. The shipyards – run by HD Hyundai Heavy Industries in Ulsan, and Hanwha Ocean in Geoje – are already making some of the world’s top-rated warships for the South Korean navy. On time. And within budget. Officials at both facilities are emphatic that they are ready to share the technology and knowhow needed to construct guided-missile destroyers, frigates and submarines with a US Navy that faces a shipbuilding crisis as it tries to keep up with an ever-growing Chinese fleet. Top officials have made the size of the problem clear. “All of our programs are a mess,” US Secretary of the Navy John Phelan told a US House hearing in June. “I think our best one is six months late and 57% over budget … That is the best one,” Phelan testified. While Phelan’s comments may come as a shock to some, they’re no big secret. US shipbuilding programs have been chronically behind schedule and over budget for years. All the while, one of Washington’s closest Pacific allies is forging ahead. During a CNN visit to the Hyundai and Hanwha shipyards last month, officials explained how South Korea has become a shipbuilding powerhouse that turns out vessels quickly and efficiently. At the Hanwha yard, officials showed CNN brand-new buildings specially built to service an an order for four frigates from the South Korean navy. The massive building where the hulls will be put together took just 14 months to complete, one official said. The 122-meter-long, 3,100-ton frigates that will be built there will be formidable, with vertical launch cells for air defense missiles and the ability to launch anti-ship missiles as well as anti-submarine torpedoes. Each will take about three years to complete. That’s approximately as long as the delays plaguing the US’s Constellation-class frigate program, according to a Congressional Research Report, a prime example of the problems with US shipbuilding. The delays are blamed on the Navy making too many alterations to an existing design used by the Italian and French navies, upon which the class was to be based. So how can South Korean shipbuilders do it so much more smoothly? Workforce and logistics, Korean shipyard leaders say. Lee Jin, vice president at the HD Hyundai Heavy Industries facility in Ulsan, the world’s largest shipyard, says people – and their years of experience – come first. The average worker in HHI’s workforce of 32,000 has been with the company 16 years, he said. US shipping expert Sal Mercogliano, a professor at Campbell University in North Carolina, said the fact that Korean shipyards toggle between military and commercial work is a strength. That allows them to “keep a core group of shipworkers in the yard,” he said, switching between military and commercial projects as new business dictates. Mercogliano said the US made a big mistake post-World War II – when it was a shipbuilding giant – by outsourcing commercial shipbuilding to cheaper places like South Korea and Japan and concentrating on military vessels. “We really gave up the shipbuilding industry foolishly, many years ago,” President Trump said during his August summit with South Korean President Lee Jae Myung at the Oval Office, where the two leaders reaffirmed the “Make American Shipbuilding Great Again” project that Seoul first presented during tariff negotiations in July. Now, shipbuilding knowledge will be traveling in the opposite direction across the Pacific and “it could be a big game changer,” Mercogliano said. And the companies aren’t stagnating. They’re continually adjusting, refining and improving the manufacturing process, a Hanwha official told CNN. Having commercial shipyards side by side with military ones allows South Korean companies to do that, said former US Navy captain Carl Schuster. US military shipyards get inconsistent orders from the Pentagon, he says, so they don’t invest in new processes that may not be used when Congress cuts funding. “If you are a corporation, are you going to invest $100 million in automating a shipbuilding line, and then, when you finish, there’s no work?” he asks. And then there’s the supply chain. South Korea is a small country, especially compared with the US, and much of its heavy industry is in the south. The shipyard can source about 90% of parts and materials it needs from within 50 kilometers (31 miles) of the Geoje shipyard, located on an island at the peninsula’s southern tip, said Hanwha Ocean General Manager Jeon Yu-su. The efficiency of the Korean shipyards is notable. At the commercial section of the Hyundai yard on a Wednesday afternoon, a massive section of hull moved along a street atop a unique flatbed vehicle, its driver in a cab below the slab of steel. Three bike riders in yellow vests worked with the driver, reporting the slab’s position, pointing out obstacles that can be cleared by hydraulically raising the slab, and warning other traffic to stay out of the way. Trucks and scooters whizzed in and out of assembly buildings for drop-offs and pickups before and after the steel slab passed by. It’s frenetic, but safety first, as demanded by signs on the campus. “There is not a single important task in our company that is worth you getting hurt over,” one sign says. Nearby, huge overhead cranes, rising some 360 feet above the yard and capable of lifting almost 1,300 tons, move on tracks, the opening notes Beethoven’s “Für Elise” warning of their movement. A CNN reporter asked if this can be duplicated in the US, to Make American Shipbuilding Great Again. Hanwha hopes so. Last year it bought Philly Shipyard in Pennsylvania, and earlier this year announced it will pump $5 billion into the facility, looking for commercial and eventually military work. Hyundai, too, hopes for a larger US presence. But US law prevents its Navy from buying foreign-built ships – even from allies like South Korea – or from building its own ships in foreign countries, due to both security concerns and a desire to protect American shipbuilding. There’s also the fallout from an immigration raid on a Korean battery plant in Georgia that has raised fears that US-Korean cooperation could be stunted. Having US Navy ships built in South Korea would require Congress and the Trump administration to change those laws and regulations – and to keep visa relations smooth. A recent deal between the US and Finland that will see four US Coast Guard icebreakers built in Finnish shipyards – before another seven are built on American shores – could be a template for overseas naval shipbuilding, although different regulations apply to the Navy, part of the Defense Department, and Coast Guard, part of the Homeland Security Department. Mercogliano, the Campbell University professor, says Congress could loosen requirements for commercial or naval auxiliary and supply vessels to be US-built. “I think there’s a great potential to start building ships in Korea and then morph it over to the United States,” he says. But Hanwha’s Jeon is aiming higher. Asked if he wants to see US warships being made in the Geoje shipyard, his answer is quick and unequivocal. “Yes!”",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:14.579358+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/20/asia/south-korea-shipyards-us-navy-intl-hnk-dst-ml",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "6c412a8481fbbe18571997c4c09b121f",
    "processed_at": "2025-10-20T11:02:10.120661",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses shipbuilding issues and the potential collaboration between South Korean and US shipyards, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/19/americas/bolivia-election-results-rodrigo-paz-intl-hnk",
    "title": "Bolivia election : Centrist Rodrigo Paz wins presidency , ending nearly 20 years of leftist rule",
    "text": "Centrist Rodrigo Paz won Bolivia’s presidential runoff on Sunday, defeating conservative rival Jorge “Tuto” Quiroga, as the country’s worst economic crisis in a generation helped propel the end of nearly two decades of leftist rule. Paz, a senator from the Christian Democratic Party, won 54.5% of the vote, beating Quiroga’s 45.5%, according to early results from Bolivia’s electoral tribunal. But Paz’s party does not hold a majority in the country’s legislature, which will force him to forge alliances to govern effectively. The new president takes office on November 8. The 58-year-old senator’s win marks a historic shift for the South American country, governed almost continuously since 2006 by Bolivia’s Movement to Socialism, or MAS, which once enjoyed overwhelming support from the country’s Indigenous majority. Paz’s moderate platform — pledging to maintain social programs while promoting private sector-led growth — appeared to resonate with left-leaning voters disillusioned by the ruling MAS, founded by former President Evo Morales, but wary of Quiroga’s proposed austerity measures. Support for MAS cratered in the August first round amid a deepening economic crisis. “This election marks a political turning point,” said Glaeldys Gonzalez Calanche, analyst for the Southern Andes at International Crisis Group. “Bolivia is heading in a new direction,” she said. Both runoff candidates pledged to strengthen diplomatic ties with Washington — strained since 2009 — and seek US-backed financial support to stabilize Bolivia’s fragile economy. In late September, Paz unveiled plans for a $1.5 billion economic cooperation deal with US officials to ensure fuel supplies. US Secretary of State Marco Rubio said this week that both presidential candidates “want stronger, better relations with the United States,” after decades of anti-American leadership. “This election is a transformative opportunity,” he said on October 15. Outside a polling station in La Paz, Lourdes Mendoza said she had grown weary of the MAS era. “My children were born and raised with a single government,” she said. “I hope they can see other possibilities and alternatives.” Voters want economic change Bolivia’s fragile economy dominated the runoff campaign. Once plentiful natural gas exports have plummeted, inflation is at a 40-year high, and fuel is scarce. Both candidates campaigned to roll back elements of the MAS era, state-led model, but differed over how drastically. Paz favored gradual reform, including tax incentives for small businesses and regional fiscal autonomy, while Quiroga proposed sweeping cuts and an IMF bailout. “We’re going for a new stage of Bolivian democracy in the 21st century,” Paz told Reuters two days before the election at his family’s ranch in the southern gas-producing region of Tarija. “We’re going to try to build an economy for the people,” he said, one where “the state is no longer going to be the central axis.” Some voters said they were not convinced that his victory represented a true break from MAS: “I think he’s a puppet of the outgoing government,” said 21-year-old Esther Miranda from La Paz, who works in a nail salon. Running mate’s populist appeal boosts Paz Paz’s campaign was boosted by his running mate Edman Lara, a former police officer known for viral TikTok videos exposing corruption. Lara’s populist appeal helped Paz connect with younger and working-class voters, analysts said. Economists warn the incoming administration faces immediate challenges, including securing fuel supplies and building coalitions in a fragmented legislature. Outgoing hydrocarbons minister Alejandro Gallardo said last week that the state energy company was struggling to obtain foreign currency for fuel imports. Paz told Reuters he was already addressing the issue through deferred payment agreements with fuel suppliers to ensure diesel and gasoline arrive within days of his inauguration. Paz said he would also begin phasing out universal fuel subsidies. Targeted support would go to vulnerable groups, while bigger industries such as agribusiness would pay market rates for fuel. “The market will have to adjust prices, but there are sectors that will have government support until the economy is reactivated,” he said. Bolivia’s main labor union, the Central Obrera Boliviana (COB), has previously warned it would oppose any threats to the social and economic gains achieved so far, in a sign of the juggling act for Paz’s government to avoid street protests. Paz’s PDC won 49 of 130 seats in the lower house and 16 of 36 in the Senate, just ahead of Quiroga’s coalition, which secured 43 seats in the lower house and 12 in the Senate.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:14.803858+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/19/americas/bolivia-election-results-rodrigo-paz-intl-hnk",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "99eeae3daaf2d5758fa01a4a1cf215f4",
    "processed_at": "2025-10-20T11:02:10.120710",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the recent presidential election in Bolivia, focusing on political changes, economic issues, and candidates' platforms. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://knpr.org/npr/2025-10-19/centrist-rodrigo-paz-wins-bolivias-presidential-runoff-topping-right-wing-rival",
    "title": "Centrist Rodrigo Paz wins Bolivia presidential runoff , topping right - wing rival",
    "text": "LA PAZ, Bolivia — Rodrigo Paz, a centrist senator who was never a nationally prominent figure until now, won Bolivia's presidential election on Sunday, preliminary results showed, galvanizing voters outraged by the country's economic crisis and frustrated after 20 years of rule by the Movement Toward Socialism party. \"The trend is irreversible,\" Óscar Hassenteufel, the president of the Supreme Electoral Tribunal, said of Paz's lead over his rival, former right-wing President Jorge \"Tuto\" Quiroga. Paz won 54% of the votes, early results showed, versus Quiroga's 45%. Paz took the podium Sunday night flanked by his wife, María Helena Urquidi, and four adult children. The hotel ballroom in Bolivia's capital of La Paz went wild, with people shouting his name and holding phones aloft. \"Today, Bolivia can be certain that this will be a government that will bring solutions,\" he told supporters. \"Bolivia breathes winds of change and renewal to move forward.\" Shortly after the results came in, Quiroga conceded to Paz. \"I've called Rodrigo Paz and wished him congratulations,\" he said in a somber speech, prompting jeers and cries of fraud from the audience. But Quiroga urged calm, saying that a refusal to recognize the results would \"leave the country hanging.\" \"We'd just exacerbate the problems of people suffering from the crisis,\" he said. \"We need a mature attitude right now.\" Paz and his popular running mate, ex-police Capt. Edman Lara, gained traction among working-class and rural voters disillusioned with the unbridled spending of the long-ruling Movement Toward Socialism, or MAS, party but wary of Quiroga's radical 180-degree turn away from its social protections. Quiroga's embrace of the International Monetary Fund — an organization that has long aroused political resentment in Bolivia — for a shock treatment package of the kind Bolivians came to know and fear in the 1990s also alienated more moderate voters. Paz's victory sets this South American nation of 12 million on a sharply uncertain path as he seeks to enact major change for the first time since the 2005 election of Evo Morales, the founder of MAS and Bolivia's first Indigenous president. Although Paz's Christian Democratic Party has the cushion of a slight majority in Congress, he'll still need to compromise to push through an ambitious overhaul. Paz plans to end Bolivia's fixed exchange rate, phase out generous fuel subsidies and reduce hefty public investment, redrawing much of the MAS economic model that dominated for two decades. But he says he'll maintain MAS-style benefits and take a gradual approach to free-market reforms, in hopes of avoiding a sharp recession or jump in inflation that would enrage the masses — as has happened before in Bolivia. Morales' effort to lift fuel subsidies in 2011 lasted less than a week as protests engulfed the country. Paz inherits an economy in shambles Paz's supporters erupted into raucous cheers and ran into the streets of La Paz, setting off fireworks and honking car horns. Crowds thronged a hotel downtown where Paz spoke, some shouting, \"The people, united, will never be defeated!\" \"We feel victorious,\" Roger Carrillo, a volunteer with Paz's party, said by phone from eastern Bolivia, where he was rallying a celebratory caravan. \"We know there is work ahead of us but we just want to enjoy this moment.\" Behind the celebrations, Bolivia faces an uphill battle. Since 2023, the Andean nation has been crippled by a shortage of U.S. dollars that has locked Bolivians out of their own savings and hampered imports. Year-on-year inflation soared to 23% last month, the highest rate since 1991. Fuel shortages paralyze the country, with motorists often waiting days in line to fill up their tanks. To make it through even his first months, Paz must replenish the country's meager foreign currency reserves and get fuel imports flowing. Vowing to avoid the IMF, Paz has pledged to scrape together the necessary cash by fighting corruption, reducing wasteful spending and restoring enough confidence in the country's currency to lure U.S. dollar savings out from under Bolivians' mattresses and into the banking system. But Paz's stated reluctance to slam on the fiscal brakes — with promises of cash handouts for the poor to cushion the blow of subsidy cuts — has led to criticism. \"It's just so vague, I feel like he's saying these things to please voters when fiscally it doesn't add up,\" said 48-year-old Rodrigo Tribeño, who voted for Quiroga on Sunday. \"We needed a real change.\" An outsider with political experience Although Paz, the son of former President Jaime Paz Zamora, who was in office from 1989 to 1993, has spent more than two decades in politics as a lawmaker and mayor, he appeared in this race as a political unknown. The senator rose unexpectedly from the bottom of the polls to a first-place finish in the August vote. His party swept six of nine regional departments in the country, including the Andean highlands of western Bolivia and the large, coca-producing region of Cochabamba, winning over key swaths of Indigenous Aymara and working-class Bolivians that once comprised Morales' base. Paz's slogan of \"capitalism for all\" appealed to many merchants and entrepreneurs who flourished in Morales' heyday but later chafed against his high taxes and regulation. Quiroga, by contrast, carried the wealthier eastern lowlands of Santa Cruz, known as the country's agricultural engine. \"There's a very clear class difference. For Quiroga, you have people who've been in politics and in the economic elite for a long time — businesspeople, agro-industrialists,\" said Verónica Rocha, a Bolivian political analyst. \"With Paz, it's the opposite.\" An ex-cop shakes up the race The race looked to be a staid affair until Paz surprised everyone by picking Lara as his running mate. The charismatic young ex-policeman had zero political experience but gained fame on TikTok after being fired from the police for denouncing corruption in viral videos. Out of work, he sold second-hand clothes to get by and worked as a lawyer helping Bolivians come forward about corruption — a story that resonated with many former MAS supporters. Lara's fiery, populist promises of universal income for women and higher pensions for retirees frequently forced Paz into damage control, causing tension on the campaign trail. But for those who see Lara as divisive and hot-headed, there are plenty of Bolivians who say those traits connote authenticity in comparison to the other scripted, telegenic candidates. Lara struck an unusually conciliatory tone in his remarks after winning Sunday. \"It's time to unite, it's time to reconcile,\" Lara told supporters after learning of his win, taking a more conciliatory tone than usual. \"Political divisions are over.\" Many Bolivians interviewed Sunday said they voted for Lara as if he were at the top of the ticket. \"Lara is the one acting more like a president than Paz. Many of us think Lara will end up running the country,\" said Wendy Cornejo, 28, a former Morales supporter selling crackers in downtown La Paz. Copyright 2025 NPR",
    "domain": "knpr.org",
    "domain_category": "unknown",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:17.518263+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "knpr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://knpr.org/npr/2025-10-19/centrist-rodrigo-paz-wins-bolivias-presidential-runoff-topping-right-wing-rival",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "55b1218a83a9635c9ecbd3bba1f9fef5",
    "processed_at": "2025-10-20T11:02:10.120777",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the political landscape and election results in Bolivia, focusing on the presidential runoff and the implications of the new government. There are no mentions or discussions related to artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://knpr.org/npr/2025-10-19/trump-announces-tariffs-and-an-end-to-u-s-aid-to-colombia-amid-clash-over-drug-trade",
    "title": "Trump announces tariffs and an end to U . S . aid to Colombia amid clash over drug trade",
    "text": "PALM BEACH, Fla. — The United States will slash assistance to Colombia and enact tariffs on its exports because the country's leader, Gustavo Petro, \"does nothing to stop\" drug production, President Donald Trump said Sunday, escalating the friction between Washington and one of its closest allies in Latin America. In a social media post, Trump referred to Petro as \"an illegal drug leader\" who is \"low rated and very unpopular.\" The Republican president warned that Petro \"better close up\" drug operations \"or the United States will close them up for him, and it won't be done nicely.\" Later in the day, Trump told reporters aboard Air Force One that Colombia has \"no fight against drugs\" and \"they are a drug manufacturing machine\" with \"a lunatic\" for a president. He said that he would announce new tariffs on Monday. Defense Secretary Pete Hegseth also announced the latest U.S. strike on a vessel that was allegedly carrying \"substantial amounts of narcotics.\" He said the vessel was associated with a Colombian rebel group — the National Liberation Army, or ELN — that has been in conflict with Petro's government. He did not provide any evidence for his assertions, but he shared a brief video clip of a boat engulfed in flames after an explosion on Friday. Petro, who can be as vocal on social media as his American counterpart, rejected Trump's accusations and defended his work to fight narcotics in Colombia, the world's largest exporter of cocaine. \"Trying to promote peace in Colombia is not being a drug trafficker,\" Petro wrote. He suggested that Trump was being deceived by his advisers, described himself as \"the main enemy\" of drugs in his country and said Trump was being \"rude and ignorant toward Colombia.\" The Colombian Foreign Ministry described Trump's statement as a \"direct threat to national sovereignty by proposing an illegal intervention in Colombian territory.\" Defense Minister Pedro Sánchez told reporters that the country \"has used all its capability and also lost men and women fighting drug trafficking.\" Trump's latest broadside against Petro raises the possibility of an expanding clash in Latin America, where the U.S. has already increased pressure on neighboring Venezuela and its leader, Nicolás Maduro. American naval ships, fighter jets and drones are deployed in the region for what the administration has described as an \"armed conflict\" with drug cartels. Trump also authorized covert operations inside Venezuela. Unlike Venezuela, Colombia is a longtime U.S. ally and the top recipient of American assistance in the region. But coca cultivation reached an all-time high last year, according to the United Nations, and there has been fresh violence in rural areas where the government spent years battling insurgents before reaching a peace deal a decade ago. In September, the Trump administration accused Colombia of failing to cooperate in the drug war, although at the time Washington issued a waiver of sanctions that would have triggered aid cuts. Colombia received an estimated $230 million in the U.S. budget year that ended Sept. 30, a drop from recent years that exceeded $700 million, according to U.S. figures. Petro, Colombia's first leftist president, has repeatedly feuded with Trump this year. Petro initially rejected U.S. military flights of deported migrants, leading Trump to threaten tariffs. The State Department said it would revoke Petro's visa when he attended the U.N. General Assembly in New York because he told American soldiers to disobey Trump's orders. Petro and Trump have also been at odds over American strikes on boats in the Caribbean. On Sunday, Petro accused the U.S. government of assassination, pointing to a Sept. 16 strike that he said killed a Colombian man named Alejandro Carranza. Petro said Carranza was a fisherman with no ties to drug trafficking, and his boat was malfunctioning when it was hit. \"The United States has invaded our national territory, fired a missile to kill a humble fisherman, and destroyed his family, his children. This is Bolívar's homeland, and they are murdering his children with bombs,\" Petro wrote on social media. He said that he asked his country's attorney general's office to initiate legal proceedings internationally and in U.S. courts. The White House and the Pentagon did not immediately respond to requests for comment on Petro's accusations. Despite Petro's criticism, his government plans to prosecute the Colombian survivor of a more recent U.S. strike on a submersible that was allegedly carrying drugs. Another survivor was repatriated to Ecuador, where the Ministry of the Interior said he would not face charges after prosecutors met with him and determined that he had not committed any crimes within the country's borders. The ELN, which Hegseth said was the target of Friday's strike, has long denied any role in drug trafficking and offered to submit to the scrutiny of an international commission. It did not respond to Hegseth's announcement. Colombian authorities regularly report the dismantling of cocaine laboratories and the seizure of drugs believed to belong to the guerrillas. There have been seven U.S. strikes in the region since early September that the administration says are targeting alleged drug traffickers. At least 32 people have been killed. Trump said Sunday that Petro had \"a fresh mouth toward America.\" He complained that drug smuggling continues \"despite large scale payments and subsidies from the USA that are nothing more than a long term rip off of America.\" \"AS OF TODAY, THESE PAYMENTS, OR ANY OTHER FORM OF PAYMENT, OR SUBSIDIES, WILL NO LONGER BE MADE TO COLOMBIA,\" he added. Elizabeth Dickinson, senior analyst for the Andes region at International Crisis Group, said \"it is befuddling and profoundly unwise of the United States to alienate its strongest military partner in Latin America at a moment when tension between Washington and Venezuela are at its highest point in recent years.\" She said Washington and Bogota have long treated their relationship as foundational, but \"that wisdom is being thrown out the window, with really catastrophic effects.\" Colombia lost significant U.S. funding when Trump slashed the U.S. Agency for International Development earlier this year. More cuts could affect military cooperation and undermine efforts to fight rebel groups. \"If that is cut, we will see a strategic loss of capability for the Colombian military and police at precisely the moment when they're confronting the greatest security crisis in Colombia for over a decade,\" she said. Copyright 2025 NPR",
    "domain": "knpr.org",
    "domain_category": "unknown",
    "language": "English",
    "date_publish": "20251020T083000Z",
    "date_download": "2025-10-20T09:01:18.240682+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "knpr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://knpr.org/npr/2025-10-19/trump-announces-tariffs-and-an-end-to-u-s-aid-to-colombia-amid-clash-over-drug-trade",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c01b2b00d77bfca516f3414515e2e1bc",
    "processed_at": "2025-10-20T11:02:10.120831",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses U.S. foreign policy, drug trade, and relations with Colombia, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]