[
  {
    "url": "https://www.dr.dk/nyheder/seneste/norwegian-fik-sin-bedste-indtjening-nogensinde-i-tredje-kvartal",
    "title": "Norwegian fik sin bedste indtjening nogensinde i tredje kvartal | Nyheder",
    "text": "Der er luft under vingerne hos Norwegian-koncernen, hvor årets tredje kvartal blev det bedste nogensinde målt på indtjening. Her tjente Norwegian 2,9 milliarder norske kroner før skat, viser regnskabet ifølge Ritzau. Det svarer til knap 1,9 milliarder danske kroner. I tredje kvartal i 2024 tjente Norwegian 2,0 milliarder norske kroner før skat. Norwegian-koncernen består af flyselskaberne Norwegian og Widerøe. I tredje kvartal havde hele koncernen 8,4 millioner passagerer. Heraf fløj 7,3 millioner med Norwegian, mens 1,1 million fløj med Widerøe, som flyver indenrigsflyvninger i Norge og til visse destinationer i Europa. Norwegian er det næststørste luftfartsselskab i Danmark målt på trafik i Københavns Lufthavn. SAS er det største.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251022T093000Z",
    "date_download": "2025-10-22T09:51:10.731211+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/norwegian-fik-sin-bedste-indtjening-nogensinde-i-tredje-kvartal",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "932e4f57273d851167c7e1d75804f313",
    "processed_at": "2025-10-22T11:52:27.037881",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the financial performance of the Norwegian airline company and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/film/2025/oct/22/the-spin-review-laughter-and-vinyl-in-wacky-irish-road-movie-as-pals-try-to-save-their-record-store",
    "title": "The Spin review – laughter and vinyl in wacky Irish road movie as pals try to save their record store",
    "text": "Here is a goofy road movie comedy with some cheeky borrowings from Nick Hornby’s High Fidelity; it’s a bit broad, and the ending doesn’t exactly gel, but it’s likable all the same. Dermot (Brenock O’Connor) and Elvis (Owen Colgan) are a couple of guys from Northern Ireland who run a record shop in Omagh, County Tyrone, dealing in old-school vinyl, but they are terrorised by their mean landlord, Sadie (Tara Lynne O’Neill), who owns the lease. They desperately need cash for rent arrears when Dermot discovers online that a farmer in Cork is offering what appear to be hugely valuable records by the blues legend Robert Johnson for just £30 – not realising their real value. Our two amigos go on a desperate southward journey to trick the poor guy with a paltry 30 quid – or the equivalent in euros – and then sell the precious discs on for what they figure will be a mouthwatering 40 grand. But does that mean they are selling their souls, the way Robert Johnson is supposed to have done at a remote crossroads? Dermot and Elvis have various chaotic adventures on the way, but what gives the film some flavour are the bizarre dialogue riffs. Divorced Elvis has rashly promised his young daughter that he will buy her a horse for her birthday, and tells Dermot that it doesn’t have to be a new horse, just secondhand. “But all horses are secondhand …” says Dermot thoughtfully “… when you get them.” They stop at a cinema to watch a scary animated film about a shark and agree afterwards that a shark with legs is an intensely disturbing idea. Later, in an idle moment, one remarks disgustedly: “I just saw two pigeons scissoring over there.” Some easy-going fun.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T093000Z",
    "date_download": "2025-10-22T09:51:27.147097+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/film/2025/oct/22/the-spin-review-laughter-and-vinyl-in-wacky-irish-road-movie-as-pals-try-to-save-their-record-store",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c304dba1fe2ddafacc3083b0fdd1334b",
    "processed_at": "2025-10-22T11:52:27.038374",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article is a review of a comedy film and does not discuss any topics related to artificial intelligence. It focuses on the plot and characters of the movie, with no mention of AI or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/boston/news/maine-tourists-louvre-jewelry-heist-paris/",
    "title": "Maine tour group was inside the Louvre during brazen jewel heist :  We were scared to death  ",
    "text": "Maine tour group was inside the Louvre during brazen jewel heist: \"We were scared to death\" French officials insist the Louvre's security measures were working properly when eight precious crown jewels - worth more than $100 million - were stolen in broad daylight from the world's most visited museum in Paris. Investigators say the heist lasted fewer than eight minutes, and the thieves were only inside the building half of that time. \"Quite honestly we were scared to death. We thought it was worse. We thought it was like a terrorist attack or something,\" Curt Dale Clark recalled. Tour group forcefully pushed back Dozens of travelers from the Maine State Music Theatre were inside the Louvre walking toward the Apollo Gallery Sunday morning when suddenly, their tour group was forcefully pushed back. \"We were actually really offended because we didn't understand the language, so we didn't know why it was happening. But then when we started seeing, you know, military with machine guns and SWAT teams, we realized, oh, something pretty serious is going on,\" said Clark, who is the theatre's artistic director. Investigators say a broken window triggered the museum's alarm. Police arrived two or three minutes after receiving a call, but those thieves were long gone - making their getaway on motorcycles. As the Maine tour group was ushered outside and onto their bus, the evacuation began to make sense. \"And as we were coming out of the building and turning left, we saw the ladder that they had climbed up and into the building, used their chainsaws to break it open and then climbed back down that ladder,\" Clark explained. Around 100 investigators are now involved in the search for the thieves and eight stolen treasures - a loss described as a wound to French culture. \"To know that you were there when that happened, it was crazy. absolutely crazy. Something this tour group, I promise you, will never forget,\" he added. The priceless crown jewels would still be worth millions if broken up and sold on the black market. French law prohibits institutions like the Louvre from insuring its property, except when part of a collection is moved or loaned.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T093000Z",
    "date_download": "2025-10-22T09:51:37.790807+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/boston/news/maine-tourists-louvre-jewelry-heist-paris/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4d22c7998f3913b1a4fb25576b023128",
    "processed_at": "2025-10-22T11:52:27.038821",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a jewel heist at the Louvre and the experiences of a tour group during the incident. It does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  }
]