[
  {
    "url": "https://www.dr.dk/nyheder/udland/historiker-louvre-kup-svarer-til-hvis-nogen-stjal-de-danske-kronjuveler",
    "title": "Historiker : Louvre - kup svarer til , hvis nogen stjal de danske kronjuveler",
    "text": "Det er endnu ikke meget, vi ved om smykkerne, der i formiddags blev stjålet fra verdens største museum Louvre i Paris. Den franske indenrigsminister har ikke sagt, hvad præcis, der er blevet stjålet - blot at der er tale om \"uvurderlige smykker\", som blev taget på kun syv minutter. Blandt de mere end 35.000 kunstgenstande, har tyvene haft et stort udvalg at vælge mellem, men ifølge flere franske aviser gik de efter juveler fra Napoleon-samlingen. Og hvis det er tilfældet, så ville det svare til, at nogen brød ind på Rosenborg Slot og stjal de danske kronjuveler, fortæller historiker Emma Paaske. - Det er historiske smykker, som man ikke kan sætte en pris på. - Det er enormt sørgeligt, at det er historiske juveler, der fortæller mange hundrede års historie, som bare er forsvundet. Ifølge den franske avis Le Parisien har tyvene forsøgt at stjæle ni ud af 23 smykker fra Napoleon-samlingen, der tæller alt fra kroner, øreringe, halskæder og brocher. To af de ni smykker skulle angiveligt være blevet fundet tæt på museet. - Da Napoleon bliver kejser af Frankrig, anskaffer han sig en række smykker - blandt andet en krone, som han kroner sig selv med. Og så er der en række smykker til hans hustru og familie, siger Emma Paaske om samlingen. Hvad præcis, der er blevet taget vides ikke, men ifølge avisen Le Parisien blev kronen, der tilhørte kejserinde Eugénie af Frankrig, der var Napoleon 3. af Frankrigs kone, fundet ødelagt. Det er dog ikke blevet bekræftet af franske myndigheder. 'Overdådige og voldsomme smykker' Historikeren peger på, at smykkerne fra samlingen er med til at fortælle en del af Frankrigs og Europas historie. - De fortæller om en periode, hvor Frankrig går fra at være et kongerige, til at blive et kejserrige, da revolutionen kom. Kejserriget blev også væltet, hvorefter der igen kom et kongerige, så det er hele historien om Frankrig, der på en måde også er samlet i de her smykker, siger Emma Paaske. Napoleon Bonaparte kom til magten i Frankrig i 1799 ovenpå Den Franske Revolution, der afskaffede enevælden og adelen. I 1804 blev han kronet til Frankrigs kejser. Selve smykkernes stil siger også noget om tiden. Ifølge Emma Paaske var Napoleon og hans familie med til at sætte standarden for, hvordan smykker skulle se ud i løbet af 1800-tallet i Europa. - Hvis man troede, at overdådige og voldsomme smykker var døde med revolutionen, så tog man fejl. De smykker er lavet til at imponere. Det vides ikke, hvem der har stjålet smykkerne, eller hvad motivet er. Men hvis tyvene har tænkt sig at sælge smykkerne, kan det blive lidt af en udfordring, peger Emma Paaske på. - Jeg ved ikke, hvordan de skal afsætte dem, fordi de fleste vil jo vide, hvor de kommer fra, og hvordan de ser ud. Det er svært at vide, hvorfor dælen de ville gide at stjæle dem, siger hun. Ifølge Julie Arendse Voss, der er afdelingsleder hos Bruun Rasmussen Kunstauktioner og specialiserer sig i klassisk kunst, kan smykkerne derfor ikke sælges på det åbne marked. - Det kan være en bestillingsopgave. Det har man set før, men det er en gisning, siger hun til Ritzau. Det er gennem tiden sket, at tyve har omsmeltet smykker eller andre uvurderlige værdigenstande, men det håber Emma Paaske ikke bliver tilfældet. - Det ville da være min største frygt, at de bliver brudt op og smeltet om, og stenene og perlerne bliver fjernet, så man aldrig nogensinde kommer til at se dem igen. Historiske smykker fra Napoleons tid i Danmark Det er ikke kun Louvre, der har smykker fra Napoleon Bonapartes tid. Kongehuset herhjemme har i deres private samling to armbånd, som Napoleon gav til Kejserinde Josephine, der var hans første hustru og som blev kejserinde af Frankrig, da han blev kronet i 1804. Armbåndene har kulørte ædelsten og diamantrosetter, og man kan se et billede af dem på Kongehusets hjemmeside. De faldt i danske hænder efter at være blevet givet videre til forskellige royale familiemedlemmer, herunder den svenskfødte kronprinsesse Lovisa af Danmark, der var gift med Frederik den 8. Parret stiftede i 1910 Det Danske Kongehus' Løsørefideikommis, der samler og sikrer værdigenstande, herunder smykker, som den siddende dronning kan bruge. Det indebærer armbåndene som Napoleon gav til sin hustru. Du kan følge udviklingen i vores liveblog her:",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T184500Z",
    "date_download": "2025-10-19T19:29:59.517183+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/udland/historiker-louvre-kup-svarer-til-hvis-nogen-stjal-de-danske-kronjuveler",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2009aef62d2b822f981b018e0e355169",
    "processed_at": "2025-10-19T21:31:25.630531",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a theft of historical jewelry from the Louvre and provides historical context about the items stolen. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/udland/familien-til-virginia-giuffre-vil-have-prins-fjernet-fra-prins-andrew",
    "title": "Familien til Virginia Giuffre vil have  Prin fjernet fra Prins Andrew",
    "text": "På få år er Kong Charles' lillebror gået fra at være Hans Kongelige Højhed Prins Andrew, Hertug af York, medlem af Hosebåndsordenen, Jarl af Inverness og Baron af Killyleagh til udelukkende at være Prins Andrew, officielt i hvert fald. Men nu vil familien til Virginia Giuffre have omdøbningen fuldendt, så den detroniserede prins fremover bare kendes som Andrew. - Vi opfordrer kongen til at tage prinsen ud af Andrew, udtaler Virginia Giuffres bror, Sky Roberts, til BBC. Virginia Giuffre var en af de kvinder, der stod frem med beskyldninger om overgreb mod den pædofilidømte forretningsmand, Jeffrey Epstein og hans inderkreds. En af de personer fra inderkredsen hævdede Giuffre var netop Prins Andrew, som hun angiveligt tre gange blev tvunget til at have sex med i starten af 00'erne. Virginia Giuffre begik selvmord tidligere på året. - Jeg synes, at alle der har været involveret skal mærke en form for ansvar og konsekvens for disse overlevere, lyder det fra Sky Roberts. Prins Andrew har under hele forløbet fastholdt sin uskyld. Andrew var allerede ude i kulden Det britiske kongehus har længe holdt kongens lillebror, Prins Andrew, ud i strakt arm. Men i fredags blev prinsen skubbet endnu længere væk. - Med Hans Majestæts samtykke føler vi, at jeg nu må tage et skridt videre. Jeg vil derfor ikke længere benytte min titel eller de hædersbevisninger, der er blevet tildelt mig, lød det i en officiel meddelelse. Det betød altså, at Prins Andrew blandt andet mistede titlen som Hertug af York og medlem af riget ældste og øverste orden, Hosebåndsordenen. I forvejen var Prins Andrew i vid udstrækning stoppet med at repræsentere kongehuset ved officielle begivenheder, ligesom han heller ikke måtte benytte sig af \"Hans Kongelige Højhed\". Samtidigt forlyder det i britiske medier, at prinsen kan se frem til endnu hårdere konsekvenser, når nye kræfter sætter sig på tronen. Det er The Telegraph, der skriver, at Prins William har tænkt sig at gå endnu hårdere til sin onkel. Ifølge mediet er William ikke tilfreds med konsekvenserne, og Prins Andrew vil ikke blive inviteret til Williams kroning og vil derudover blive udelukket fra alle andre kongelige begivenheder. Nye beskyldninger mod Prins Andrew Netop som kongehuset måske havde håbet på at kunne lægge en dæmper på Prins Andrew furoren ved at få prinsen til at droppe sine titler, har flere britiske medier i dag skrevet om nye beskyldninger. For ifølge Mail on Sunday anskaffede Prins Andrew sig Virginia Giuffres personnummer og videregav dem til en betjent, der egentlige var beskikket af The Metropolitan Police til at beskytte prinsen. Herefter forsøgte Andrew at overtale betjenten til at grave smuds op om Virginia Giuffre. Til BBC oplyser politiet, at de har igangsat en undersøgelse af de nye beskyldninger.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T184500Z",
    "date_download": "2025-10-19T19:29:59.579007+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/udland/familien-til-virginia-giuffre-vil-have-prins-fjernet-fra-prins-andrew",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d3986a6617846bbc6f2680558d62efb1",
    "processed_at": "2025-10-19T21:31:25.630596",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the controversies surrounding Prince Andrew and Virginia Giuffre, focusing on legal and royal family matters, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/udland/overblik-her-er-11-opsigtsvaekkende-kunstkup-begaaet-i-dette-aartusind",
    "title": "Overblik : Her er 11 opsigtsvækkende kunstkup begået i dette årtusind",
    "text": "Dagens tyveri på Louvre i Paris, hvor \"uvurderlige smykker\" blev stjålet, er et af flere opsigtsvækkende kup begået i dette årtusind på det europæiske kontinent. Vi er med hjælp fra nyhedsbureauet Reuters dykket en tur ned i arkiverne. Fælles for alle kuppene er, at de er begået mod museer og kulturinstitutioner i Europa. August 2023: London For godt to år siden meldte The British Museum ud, at omkring 2.000 artefakter var blevet stjålet. Blandt tyvekosterne var guldsmykker og juveler, som var blevet rapset i løbet af en længere periode, hvoraf nogle var forsøgt solgt via eBay. Ifølge museet, som ligger i London-bydelen Bloomsbury, var der tale om et \"inside job\", og en kurator blev siden fyret og genstand for en efterforskning. Sagen er endnu uafsluttet. En dansk-britisk antikvar med base på Langeland spillede en rolle i sagen, efter han i årevis havde forsøgt at advare museet om, at nogen stjal fra samlingen. Han modtog senere en undskyldning fra direktøren på The British Museum. August 2020: Utrecht Under covidpandemien brød tyve ind på museet Hofje van Mevrouw Van Aerden i den hollandske by Utrecht. Her blev guldaldermaleriet 'Two Laughing Boys' af hollandske Frans Hals stjålet. Værket, som blev til i 1626, er endnu ikke dukket op. Det er vurderet til at være 15 millioner euro værd - svarende til godt 110 millioner danske kroner - skriver Reuters. Marts 2020: Amsterdam Vincent van Goghs 'Spring Garden' blev stjålet i nattens mulm og mørke på et tidspunkt, hvor en række lande lukkede ned som følge af coronavirussens indtog. Singer Laren-museet i Amsterdam havde maleriet til låns. Et halvt år senere lykkedes det for Arthur Brand, hollandsk kunstdetektiv, at opspore maleriet. Det er nu udstillet på Groninger Museum i Holland. November 2019: Dresden Kunstværker til en værdi af mere end 113 millioner euro - 844 millioner kroner - blev i efteråret 2019 stjålet fra Gruenes Gewoelbe-museet i den østtyske by Dresden. Tyvekosterne bestod af værker, som indeholdt mere end 4.300 diamanter. Det lykkedes tyvene at stjæle kunstværkerne ved at bryde gennem et gittervindue og knuse montre med en økse. Inden da var en påsat brand opstået ved et elskab, hvilket resulterede i at forbindelsen til sikkerhedsalarmerne blev afbrudt. Overvågningskameraerne fungerede dog fortsat. Siden er de fleste af juvelerne blevet fundet og returneret, skriver Reuters. Oktober 2012: Rotterdam Det lykkedes i 2012 tyve at slippe afsted med syv malerier af kunstnere som Pablo Picasso, Claude Monet og Henri Matisse fra Kunsthal Rotterdam. Malerierne var vurderet til at have en værdi svarende til et trecifret millionbeløb. Året efter blev en rumænsk mand og hans medsammensvorne dømt for at stå bag kuppet. Ingen af værkerne er siden blevet lokaliseret. Maj 2010: Paris Fem malerier til en værdi af omkring 900 millioner kroner blev i foråret 2010 stjålet fra Musee d'Art Moderne i Paris. Blandt dem var Pablo Picassos 'Dove with Green Peas' og Henri Matisses 'Pastorale'. Det vides ikke, hvor malerierne nu befinder sig. Under retssagen udtalte en af de tiltalte i sagen, Yonathan Birn: - Jeg smed dem i skraldespanden. Februar 2008: Zürich Fire oliemalerier til en værdi af 164 millioner dollar blev i 2008 stjålet fra kunstmuseet Bührle Collection i Zürich. Blandt dem var værker af Paul Cezanne, Vincent van Gogh og Claude Monet. Værkerne af Monet og van Gogh blev hurtigt fundet, inden Cezanne-maleriet dukkede op i Serbien i 2012. August 2004: Oslo Bevæbnede tyve stjal for over 20 år siden Edvard Munchs berømte 'Skriget' og 'Madonna' fra Munch-museet i Oslo. De to maleriet blev returneret i 2006 - dog med mindre skader. Tre personer blev idømt mellem fem og ni og et halvt års fængsel i sagen. August 2003: Skotland I sensommeren 2003 brød tyve ind på Dumlanrig Castle i det sydvestlige Skotland. Med sig tog de Leonardo da Vincis kunstværk 'Madonna of the Yarnwinder', som blev til i starten af det 16. århundrede. Værket var dengang vurderet til at have en værdi på omkring 53 millioner dollar. Maleriet blev fundet fire år senere. December 2002: Amsterdam To oliemalerier af Vincent van Gogh - hver til en værdi vurderet til 56 millioner dollar - blev i december 2002 stjålet under et tyveri på Van Gogh Museum i Amsterdam. Med hjælp fra en stige og en hammer brød tyvene ind på museet. Begge malerier blev fundet 14 år senere i Italien i et hus tilhørende en formodet narkotikasmugler tilknyttet den napolitanske mafia. December 2000: Stockholm Værkerne 'Conversation' og 'A Young Parisienne' af impressionisten Pierre-Auguste Renoir samt et selvportræt af Rembrandt van Rijn blev i 2000 stjålet fra nationalmuseet i Stockholm. Tyvene var bevæbnede og stak efterfølgende af i en båd. Det førstnævnte maleri blev fundet i april 2002, inden Rembrandt-portrættet dukkede op tre år senere.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T190000Z",
    "date_download": "2025-10-19T19:29:59.644853+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/udland/overblik-her-er-11-opsigtsvaekkende-kunstkup-begaaet-i-dette-aartusind",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e877f8988fca2ee43be6fe8a9e0c1e0b",
    "processed_at": "2025-10-19T21:31:25.630667",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses various art thefts and heists that have occurred in Europe, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.dr.dk/nyheder/seneste/israel-angriber-flere-steder-i-gaza",
    "title": "Israel angriber flere steder i Gaza | Nyheder",
    "text": "Det israelske militær, IDF, har lørdag aften udført flere luftangreb mod mål i Gaza. På det sociale medie X skriver IDF, at man gik efter at ramme våbenlagre, affyringsstillinger og andet infrastruktur, der tilhører Hamas. Israel udførte angrebene, fordi de mener, at Hamas har overtrådt våbenhvileaftalen med et angreb på IDF-soldater i morges. Ifølge IDF er to israelske soldater blevet dræbt og tre såret i angrebet. Hamas afviser på den anden side at have udført angreb på israelske styrker og siger, at man fortsat vil overholde våbenhvilen. Ifølge det Hamas-kontrollerede civilforsvar i Gaza er 33 personer blevet dræbt i søndagens israelske angreb. Følg den seneste udvikling i vores live-blog.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251019T190000Z",
    "date_download": "2025-10-19T19:29:59.777746+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/israel-angriber-flere-steder-i-gaza",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "eb1fc349408ce78c3bef16913b81a483",
    "processed_at": "2025-10-19T21:31:25.630698",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses military actions and conflicts in Gaza, focusing on the Israeli military's airstrikes and the response from Hamas. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/c986y55jl34o",
    "title": "  Devoted  dad Sanchini Thompson named as Catford stabbing victim",
    "text": "Tributes paid to 'devoted' father stabbed to death A man who was stabbed to death in south-east London was a \"devoted father\", a \"pillar of kindness\" and \"the heartbeat of his family\", relatives have said. Sanchini Thompson was taken to hospital after being found with stab wounds in Rushey Green, Catford, at about 03:00 BST on Wednesday. He later died from his injuries. A post-mortem examination found Mr Thompson died from a stab wound to the chest, the Metropolitan Police said. No arrests have been made. In a written statement, his family said the father of a four-year-old daughter \"gave freely of himself sharing his time, his laughter, to bring joy to others, always prioritising the happiness and wellbeing of those around him\". \"In loving memory of a son, a father, and a cherished friend, our hearts are heavy as we remember a man whose presence brightened every room he entered,\" his family said. Mr Thompson's family added: \"His generosity knew no bounds, and his compassion touched friends, neighbours, and strangers alike. \"Words cannot fully capture the depth of our gratitude for him and the impact of his kindness on our lives. \"He will be deeply missed, but his spirit will remain with us in the love he shared and the memories we will carry forward.\" Det Ch Insp Rebecca Woodsford said: \"We are all thinking of Sanchini's loved ones at this heartbreaking time. \"I'd also like to echo previous thanks to residents, who have been incredibly patient while we conducted initial inquiries.\" Listen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:14.285728+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/c986y55jl34o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d687ec38a9825b67ba66897f95947e5e",
    "processed_at": "2025-10-19T21:31:25.630758",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a tragic incident involving a stabbing victim and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cnn.com/2025/10/19/business/premium-credit-cards-wealthy-us-economy",
    "title": "Here why elite credit cards are fighting for affluent shoppers",
    "text": "Americans are feeling bleak about the economy. Yet, despite headwinds, high earners are still spending like mad — and credit card companies are offering more and more perks to attract them. But some experts are worried these additional rewards for the rich are raising costs for everyone else, from merchants to customers. “Credit card companies (are) working to serve the most affluent customers more and more,” said Doug Kantor, general counsel at the trade group National Association of Convenience Stores (NACS). These companies “try to get (high earners) more rewards at everyone else’s expense by pushing those costs on to everyone.” This year, both American Express and JPMorgan Chase added luxury perks to their top rewards cards. For example, the Amex Platinum Card now offers a $200 credit for an Oura ring, while the Chase Sapphire Reserve comes with a credit of up to $500 for high-end hotels; both cards have many other benefits like access to airport lounges. These new perks were paired with higher annual fees, with the Platinum Card now $895 and the Sapphire Reserve $795. However, annual fees are only part of how credit card companies provide what they advertise as thousands of dollars in savings for cardholders. These rewards are also funded by the fees that credit card companies charge merchants every time any customer pays with a card. These so-called swipe fees often include items like interchange, processing, and other charges that merchants must pay to credit card companies to accept their cards. The US market has the highest of these rates compared to the rest of the world, “and that’s what’s used to fund these very rich rewards,” said Brian Riley, director of credit advisory services at Javelin Strategy & Research. So, as the rich lean on credit cards with greater rewards, the price merchants pay to accept them has also gone up — forcing merchants to choose between lower profits or raising their own prices. That’s why even cash payers end up contributing to these elite card rewards. Joanna Stavins, principal economist and policy advisor at the Federal Reserve Bank of Boston, found in her research that those who pay with cash and debit effectively “subsidize” credit card users by paying the same prices without reaping the rewards. “It’s definitely high-income consumers who are more likely to benefit,” said Stavins. Who actually pays for your credit card rewards? There’s a growing divergence in spending between high- and low-income households. In September, credit and debit card spending for high-income households grew more than four times faster than low-income spending, according to data from the Bank of America Institute. “There’s a gap, and the gap is widening,” said David Tinsley, the senior economist at the Bank of America Institute. Almost half of US consumer spending comes from those with incomes in the top 10% — the highest percentage since at least 1989. And while most low- and middle-income earners prefer paying with cash or debit cards, a majority (51%) of households making more than $150,000 annually prefer credit cards, according to the Federal Reserve’s 2025 findings. As credit card usage rises, so have acceptance fees for merchants. Since the onset of the Covid-19 pandemic these swipe fees have increased nearly 70%, according to NACS, which cited data from Nilson. To combat this, NACS has lobbied for legislation that aims to promote competition and allow merchants to choose credit card payment networks with lower costs. Despite picking up key supporters when the law was introduced in 2023, such as now-Vice President JD Vance, the legislation hasn’t advanced and observers see little chance of it becoming law in the near-term. Javelin Strategy & Research’s Riley said that without such legislation, credit card issuers have doubled down on premium cards that often charge consumers high annual fees and merchants higher fees to accept them — a lucrative business model in an economy where high earners see the fastest growth in spending and wages. AmEx did not comment for this story, but their fees page says they provide “simplified options” for merchants to accept their cards. The company also offers lower rates for some merchants depending on their type of business, the amount of the transaction, and whether they’re in an emerging market. Chase told CNN that while the Sapphire Reserve Card is designed for “affluent customers who deeply value travel, dining and experiences,” the company offers several types of credit cards for different types of customers. Credit card acceptance comes at a cost Some experts say these swipe fees are necessary for merchants to maintain the advantages of accepting cards. Todd Zywicki, a law professor at George Mason University, has advocated against proposals to cap swipe fees, arguing that the growing use of credit cards has benefited merchants and consumers alike — giving businesses the flexibility to conduct purchases with no need for cash and providing consumers access to credit. He noted swipe fees also support services like fraud prevention, which protect customers from paying for charges when their card is stolen. And, he said, merchants can certainly choose to refuse card payments if the cost of accepting them is too high. “They want the benefits of accepting credit cards without bearing the cost,” he said. However, some research shows the divide may not be simply between rich and poor — but rather, that the benefits from these cards go to those with high credit scores at the expense of those with low credit scores. A study published by the International Monetary Fund that looked only at credit card users found those with high credit scores — including those with low incomes — benefited from the use of rewards cards. High-income consumers with high credit scores gained the most, while high earners with low credit scores ended up losing out more than any other group, according to the researchers. CNN’s Auzinea Bacon contributed reporting.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T174500Z",
    "date_download": "2025-10-19T19:30:19.863126+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/10/19/business/premium-credit-cards-wealthy-us-economy",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d9af722594003d59dcaa5140bf52e476",
    "processed_at": "2025-10-19T21:31:25.630857",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses credit card companies, their strategies to attract affluent customers, and the economic implications of credit card rewards. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cnn.com/2025/10/19/politics/us-conducts-new-strike-on-ship-allegedly-involved-in-drug-trafficking-in-the-carribean",
    "title": "US conducts another strike on boat allegedly involved in drug trafficking in the Caribbean",
    "text": "Defense Secretary Pete Hegseth announced Sunday that the US conducted a strike Friday on a boat that American intelligence officials believed was involved in illegal drug trafficking in the Caribbean. Hegseth wrote in a post on X that the vessel was affiliated with a Colombian terrorist organization and had “substantial amounts of narcotics” on board. He said the three men on the boat were all killed and no US forces were harmed. This is the seventh known strike in a series of recent attacks by the US military on vessels that the Trump administration says are involved in drug trafficking. It comes days after another strike on an alleged drug boat that CNN reported appeared to be the first time an attack did not kill everyone on board. President Donald Trump said Saturday the survivors of that strike were released to their home countries of Ecuador and Colombia. “These cartels are the Al Qaeda of the Western Hemisphere, using violence, murder and terrorism to impose their will, threaten our national security and poison our people,” Hegseth wrote Sunday. “The United States military will treat these organizations like the terrorists they are—they will be hunted, and killed, just like Al Qaeda.” The strikes are a part of the Trump administration’s hardening stance against South American countries allegedly involved in smuggling illicit drugs into the US. The president recently authorized the CIA to operate in Venezuela and has been weighing military action inside the country as part of a pressure campaign to oust President Nicolás Maduro. Trump has also clashed publicly with Colombian President Gustavo Petro, who accused the US last week of murdering an innocent Colombian national during one of its Caribbean strikes. Trump announced Sunday he would cancel all US payments and subsidies to the country. Petro responded on X, calling Trump “ignorant” and denying his involvement in illegal drug trade. The Trump administration has produced a classified legal opinion seeking to justify lethal strikes against a secret and expansive list of cartels and suspected drug traffickers, CNN has reported. The opinion is significant, legal experts previously told CNN, because it appears to give grounds for the president designating drug traffickers as enemy combatants and having them summarily killed without legal review. Historically, people involved in drug trafficking have been considered criminals with due process rights, with the Coast Guard interdicting drug-trafficking vessels and arresting smugglers. The Senate blocked a push earlier this month to limit Trump’s ability to command the military to strike alleged drug boats without congressional authorization. Sens. Rand Paul and Lisa Murkowski were the only Republican lawmakers to cross party lines and support the resolution. “We basically are summarily executing people who are accused of something. It’s a terrible idea,” Paul, who joined with Democratic Sen. Tim Kaine to force a vote on reining in Trump’s war powers, told CNN on Thursday.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T174500Z",
    "date_download": "2025-10-19T19:30:21.766914+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/10/19/politics/us-conducts-new-strike-on-ship-allegedly-involved-in-drug-trafficking-in-the-carribean",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "89eb1549d7fbc3c5c7f12b3a0d1ba547",
    "processed_at": "2025-10-19T21:31:25.630907",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses military actions related to drug trafficking and does not mention artificial intelligence or any AI-related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/19/middleeast/yemens-houthi-rebels-un-detain-20-intl-latam",
    "title": "Houthi rebels detain 20 UN employees and confiscate equipment in Yemen",
    "text": "Iranian-backed Houthi rebels detained two dozen UN employees Sunday, a day after they raided another UN facility in the capital Sanaa, a UN official said. Jean Alam, a spokesman for the UN resident coordinator for Yemen, told The Associated Press that the UN staffers were detained inside the facility in Sanaa’s southwestern neighborhood of Hada. He said those detained Sunday include five Yemenis and 15 international staff. He said the rebels released another 11 UN staffers after questioning. He said the UN was contact with the Houthis and other parties to “to resolve this serious situation as swiftly as possible, end the detention of all personnel, and restore full control over its facilities in Sanaa.” A second UN official, speaking on condition of anonymity to discuss the raid, said the rebels confiscated all communications equipment from the facility, including phones, servers and computers. The official said the detained employees belong to multiple UN agencies including the World Food Program, UNICEF and the Office for the Coordination of Humanitarian Affairs. The Houthis have launched a long-running crackdown against the UN and other international organizations working in rebel-held areas in Yemen including Sanaa, the coastal city of Hodeida and the rebel stronghold in Sadaa province in northern Yemen. Dozens of people, including over 50 UN staffers, have been detained so far. A World Food Program worker died in detention earlier this year in Sadaa. The rebels have repeatedly alleged without evidence that the detained UN staffers and those working with other international groups and foreign embassies were spies. The UN fiercely denied the accusations. The crackdown forced the UN to suspend its operations in Saada province in northern Yemen following the detention of eight staffers in January. The UN also relocated its top humanitarian coordinator in Yemen from Sanaa to the coastal city of Aden, which serves as seat for the internationally recognized government.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:22.982133+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/19/middleeast/yemens-houthi-rebels-un-detain-20-intl-latam",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9a86252eeea8619ecdf9fde43e6f5731",
    "processed_at": "2025-10-19T21:31:25.630944",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the detention of UN employees by Houthi rebels in Yemen and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/19/politics/democratic-socialists-zohran-mamdani-movement",
    "title": "Democratic socialists see their moment in Zohran Mamdani rise",
    "text": "Standing in the lobby of the art deco theater where Zohran Mamdani held a raucous rally last week, just hours after Israeli hostages were freed by Hamas in a ceasefire deal, the organizer was dressed the part: A black T-shirt with the phrase “Land Back” on the top of a circle, “Democratic Socialists of America” on the bottom, a Palestinian flag in the middle. The pitch was the same to each prospect he sidled up to: “You look like you might want to sign up with the DSA.” Mamdani’s emergence is the biggest electoral achievement the DSA has ever had, well beyond the scattered state legislature and city council seats flipped their way in recent years, or even Alexandria Ocasio-Cortez going from being a one-time bartender to a potential top presidential contender. Here in Mamdani was a candidate who’d been a regular of their conventions and organizing Zoom calls, toppling an opponent in Andrew Cuomo as proud of his standing with the establishment as his own famous last name. Amid a larger bipartisan pull toward populism and mounting anger toward corporations and billionaires, DSA members tell CNN their meetings around the country are attracting more people than ever. Socialist chapters in cities have turned mass Signal chats into de facto National Guard and ICE monitoring groups, and affiliated candidates build up volunteer lists and fundraising beyond anything they’ve seen to date. They insist that moderate Democrats panicking and Republicans salivating over pinning their ideas to progressives at large have it backward, even as the DSA calls for the overthrow of the capitalistic system in favor of more government ownership in addition to abolishing the police, emptying prisons, creating single-payer health insurance. “I certainly believe,” Rhode Island state Rep. David Morales, a 27-year-old DSA member who last month launched his own 2026 primary challenge to the incumbent mayor of Providence, told CNN, “that the future of the Democratic Party has to be a party that’s going to stand up for the working class and be unapologetic about it.” But there’s a huge catch: The DSA remains tiny and fractured internally. According to organizers, DSA’s New York City chapter membership has doubled since the end of June. The new number is about 11,000. DSA national leaders refer to their “Mamdani bump,” sizably bigger than 2018’s “AOC bump,” driving their national membership to a record-high 80,000, with 26,000 people joining since January. By comparison, 545,000 New Yorkers voted for Mamdani in June’s Democratic primary. That night in the Upper Manhattan theater, only a few in the excited crowd of 3,000 Mamdani supporters signed the organizer’s clipboard, even after Chi Ossé, a city councilman from Brooklyn who is also considering a challenge to House Minority Leader Hakeem Jeffries, ended his speech from the stage by declaring, “If you want this movement to continue, you guys got to join New York City DSA!” Democrats increasingly seem open to socialist ideas What the crowd did do is sign up for many of Mamdani’s ideas, chanting back his slogans like classic song lyrics and grabbing from a table of buttons: “FREEZE THE RENT” in red, “CHILDCARE FOR ALL” in yellow and “FAST FREE BUSES” in blue. They bounced along with excitement as he declared that he had already won the battle for the soul of the Democratic Party, weeks before the general election. Those opposed to Mamdani’s politics are terrified of how he’s propelling democratic socialism. Other DSA members, though, see not just inspiration, but a model and a warning to the Democratic Party status quo, even as some fret quietly that if Mamdani wins and has problems governing, that could set them back not just in local races, but in trying to position Ocasio-Cortez for a potential 2028 presidential run. A Gallup poll from September showed much more support among Democrats for socialist-aligned figures than the current non-socialist leadership, though Republicans viewed socialism much more negatively. But that poll also showed a record low, 54% overall, approval for capitalism, with only 42% of Democrats saying they viewed it positively, as compared to 66% of Democrats who say that they view socialism positively. (Just 14% Republicans and 38% of independents have a positive view of socialism.) Gustavo Gordillo moved to New York initially to be an artist but has since started working as a union electrician. He liked Bernie Sanders’s 2016 campaign, but it was only after Trump’s first election that he joined the DSA. Now the co-chair of the New York City chapter, he was involved early with Mamdani’s campaign, helped craft his platform, worked with most of his senior staff, and is now helping organize members to get him over the finish line. The DSA energy is “a response to a power vacuum in the Democratic Party establishment where very few people could tell you what the Democratic Party stands for,” Gordillo told CNN in a coffee shop on the edge of Chinatown hours before Mamdani’s big rally. “And we’ve seen multiple cycles of establishment Democrats failing to defeat fascists – that that has caused a huge number of working-class people to come to understand that we need a very different kind of political agenda.” As for helping other campaigns learn from Mamdani’s success, though, Gordillo admitted the group “could be more rigorous.” Ryan Clancy, a Wisconsin assemblyman and DSA member who started an interview by saying, “I love to talk about socialism,” and joked that he was offended when Republicans called Joe Biden a socialist because the former president wasn’t nearly left enough, encouraged mainstream Democrats to read those numbers as a reason to stop trying to recapture the middle, even in his ultra-swing state. Voters are “simply demanding more. They don’t want a Hakeem Jeffries, they don’t want a Chuck Schumer, they don’t want people to say they can’t do anything because they’re not in power. That’s bulls**t. They want folks who will fight for them and will use different strategies to do that,” Clancy told CNN. “That idea as a bigger tent expressed as just taking the tent and moving it to the right is really turning off a lot of real progressives and folks on the left who are never going to vote for a Trump but they’re not going to engage with the Democratic Party as it is.” Factionalism and purity tests Even as the DSA has moved more toward local races than federal ones, it still faces factionalism and other internal issues. DSA members across the country tell CNN that Donald Trump and Democrats’ failure to stop him have more to do with their rise than even than Sanders, the Vermont senator who came in a close second in both the 2016 and 2020 Democratic primary races. Despite being the godfather of the democratic socialist revival in America, Sanders has never himself been a DSA member and has no plans to join. He likes being an independent and is also no fan of how purist DSA members de-endorse and boot officials they say have betrayed them. Ocasio-Cortez was one of those the party de-endorsed in 2024 over co-sponsoring an event on combating antisemitism. Then she was the subject of a censure resolution at this summer’s DSA convention for her “tacit support of Zionism in the face of liberal betrayal of international law, and her dogged support for the Democratic Party establishment to the detriment of DSA’s member-led organizing,” even as in the same packet of resolutions obtained by CNN, the organization lauded her “Fighting Oligarchy” tour with Sanders. The DSA’s embrace of the Palestinian cause, especially since Oct. 7, has become central to the organization’s identity, from the T-shirt of the organizer recruiting members at the Mamdani event to the group’s “Until Palestinian Liberation” statement on the ceasefire which makes no mention of the word “hostages” but is full of paragraphs decrying Israel. For some, that’s been an appeal. For others, it’s made the DSA toxic, even if they agree with many of the positions on issues like affordability and healthcare. Mamdani’s comments on Israel have long been essentially in line with the DSA’s, though he has denounced Hamas and visited synagogues and Jewish groups to affirm that he would fight antisemitism and ensure police protection as needed. But that hasn’t stopped some members from already talking about how they expect to use his potential win as an opening for a wider DSA agenda and demand that he not waver from it at all. Following in Mamdani’s footsteps One campaign trying to tap into the same energy and tactics as Mamdani is the Minneapolis mayoral run of Omar Fateh, the state senator who won the Democratic-Farmer-Labor endorsement at its convention over the summer, only to have that support revoked on claimed technicalities shortly after. Fateh told CNN that the revoked endorsement “supercharged” his campaign, both because of the incident itself and what he said it represented about a party he contends is in sway to rich donors. “What we don’t want to see is continued tension that extends into the midterms and beyond,” Fateh said. “Democratic leadership has to listen to the folks in the party that are really energizing new voters, energizing young people, bringing on new people to come out, not only to vote, but to volunteer and to spend time and effort helping build out the broad coalition in the party. And because that’s what it’s going to take to win.” In Seattle, Katie Wilson is waging a strong challenge to the incumbent mayor in November. She’s still waiting on an upcoming meeting of the local DSA to see if she’ll get their endorsement. Wilson isn’t a DSA member herself. She came up as a founder of the local Transit Riders Union and branched out to wider progressive activism. “I’m a socialist. I’m fine being called a democratic socialist,” Wilson told CNN. “We’re in a moment where most people don’t care that much. People are not that hung up on labels and want to see results on issues that affect their daily lives.” Asked how her socialism would define her a mayoralty, Wilson said she’d encourage outside organizing to keep up pressure on her administration and community wealth-building models, but said, “it’s really more of a long-term, big picture vision for me.” “In the next four years, maybe it won’t look that different from a progressive Democrat,” she said.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:23.694690+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/19/politics/democratic-socialists-zohran-mamdani-movement",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3406a9b9be2e379d7a96dcbecfe15135",
    "processed_at": "2025-10-19T21:31:25.631052",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political topics related to the Democratic Socialists of America and the rise of Zohran Mamdani, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/19/business/premium-credit-cards-wealthy-us-economy",
    "title": "Here why elite credit cards are fighting for affluent shoppers",
    "text": "Americans are feeling bleak about the economy. Yet, despite headwinds, high earners are still spending like mad — and credit card companies are offering more and more perks to attract them. But some experts are worried these additional rewards for the rich are raising costs for everyone else, from merchants to customers. “Credit card companies (are) working to serve the most affluent customers more and more,” said Doug Kantor, general counsel at the trade group National Association of Convenience Stores (NACS). These companies “try to get (high earners) more rewards at everyone else’s expense by pushing those costs on to everyone.” This year, both American Express and JPMorgan Chase added luxury perks to their top rewards cards. For example, the Amex Platinum Card now offers a $200 credit for an Oura ring, while the Chase Sapphire Reserve comes with a credit of up to $500 for high-end hotels; both cards have many other benefits like access to airport lounges. These new perks were paired with higher annual fees, with the Platinum Card now $895 and the Sapphire Reserve $795. However, annual fees are only part of how credit card companies provide what they advertise as thousands of dollars in savings for cardholders. These rewards are also funded by the fees that credit card companies charge merchants every time any customer pays with a card. These so-called swipe fees often include items like interchange, processing, and other charges that merchants must pay to credit card companies to accept their cards. The US market has the highest of these rates compared to the rest of the world, “and that’s what’s used to fund these very rich rewards,” said Brian Riley, director of credit advisory services at Javelin Strategy & Research. So, as the rich lean on credit cards with greater rewards, the price merchants pay to accept them has also gone up — forcing merchants to choose between lower profits or raising their own prices. That’s why even cash payers end up contributing to these elite card rewards. Joanna Stavins, principal economist and policy advisor at the Federal Reserve Bank of Boston, found in her research that those who pay with cash and debit effectively “subsidize” credit card users by paying the same prices without reaping the rewards. “It’s definitely high-income consumers who are more likely to benefit,” said Stavins. Who actually pays for your credit card rewards? There’s a growing divergence in spending between high- and low-income households. In September, credit and debit card spending for high-income households grew more than four times faster than low-income spending, according to data from the Bank of America Institute. “There’s a gap, and the gap is widening,” said David Tinsley, the senior economist at the Bank of America Institute. Almost half of US consumer spending comes from those with incomes in the top 10% — the highest percentage since at least 1989. And while most low- and middle-income earners prefer paying with cash or debit cards, a majority (51%) of households making more than $150,000 annually prefer credit cards, according to the Federal Reserve’s 2025 findings. As credit card usage rises, so have acceptance fees for merchants. Since the onset of the Covid-19 pandemic these swipe fees have increased nearly 70%, according to NACS, which cited data from Nilson. To combat this, NACS has lobbied for legislation that aims to promote competition and allow merchants to choose credit card payment networks with lower costs. Despite picking up key supporters when the law was introduced in 2023, such as now-Vice President JD Vance, the legislation hasn’t advanced and observers see little chance of it becoming law in the near-term. Javelin Strategy & Research’s Riley said that without such legislation, credit card issuers have doubled down on premium cards that often charge consumers high annual fees and merchants higher fees to accept them — a lucrative business model in an economy where high earners see the fastest growth in spending and wages. AmEx did not comment for this story, but their fees page says they provide “simplified options” for merchants to accept their cards. The company also offers lower rates for some merchants depending on their type of business, the amount of the transaction, and whether they’re in an emerging market. Chase told CNN that while the Sapphire Reserve Card is designed for “affluent customers who deeply value travel, dining and experiences,” the company offers several types of credit cards for different types of customers. Credit card acceptance comes at a cost Some experts say these swipe fees are necessary for merchants to maintain the advantages of accepting cards. Todd Zywicki, a law professor at George Mason University, has advocated against proposals to cap swipe fees, arguing that the growing use of credit cards has benefited merchants and consumers alike — giving businesses the flexibility to conduct purchases with no need for cash and providing consumers access to credit. He noted swipe fees also support services like fraud prevention, which protect customers from paying for charges when their card is stolen. And, he said, merchants can certainly choose to refuse card payments if the cost of accepting them is too high. “They want the benefits of accepting credit cards without bearing the cost,” he said. However, some research shows the divide may not be simply between rich and poor — but rather, that the benefits from these cards go to those with high credit scores at the expense of those with low credit scores. A study published by the International Monetary Fund that looked only at credit card users found those with high credit scores — including those with low incomes — benefited from the use of rewards cards. High-income consumers with high credit scores gained the most, while high earners with low credit scores ended up losing out more than any other group, according to the researchers. CNN’s Auzinea Bacon contributed reporting.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:23.817241+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/19/business/premium-credit-cards-wealthy-us-economy",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d9af722594003d59dcaa5140bf52e476",
    "processed_at": "2025-10-19T21:31:25.631121",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses credit card companies, their strategies to attract affluent customers, and the economic implications of credit card rewards. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://us.cnn.com/2025/10/19/politics/us-conducts-new-strike-on-ship-allegedly-involved-in-drug-trafficking-in-the-carribean",
    "title": "US conducts another strike on boat allegedly involved in drug trafficking in the Caribbean",
    "text": "Defense Secretary Pete Hegseth announced Sunday that the US conducted a strike Friday on a boat that American intelligence officials believed was involved in illegal drug trafficking in the Caribbean. Hegseth wrote in a post on X that the vessel was affiliated with a Colombian terrorist organization and had “substantial amounts of narcotics” on board. He said the three men on the boat were all killed and no US forces were harmed. This is the seventh known strike in a series of recent attacks by the US military on vessels that the Trump administration says are involved in drug trafficking. It comes days after another strike on an alleged drug boat that CNN reported appeared to be the first time an attack did not kill everyone on board. President Donald Trump said Saturday the survivors of that strike were released to their home countries of Ecuador and Colombia. “These cartels are the Al Qaeda of the Western Hemisphere, using violence, murder and terrorism to impose their will, threaten our national security and poison our people,” Hegseth wrote Sunday. “The United States military will treat these organizations like the terrorists they are—they will be hunted, and killed, just like Al Qaeda.” The strikes are a part of the Trump administration’s hardening stance against South American countries allegedly involved in smuggling illicit drugs into the US. The president recently authorized the CIA to operate in Venezuela and has been weighing military action inside the country as part of a pressure campaign to oust President Nicolás Maduro. Trump has also clashed publicly with Colombian President Gustavo Petro, who accused the US last week of murdering an innocent Colombian national during one of its Caribbean strikes. Trump announced Sunday he would cancel all US payments and subsidies to the country. Petro responded on X, calling Trump “ignorant” and denying his involvement in illegal drug trade. The Trump administration has produced a classified legal opinion seeking to justify lethal strikes against a secret and expansive list of cartels and suspected drug traffickers, CNN has reported. The opinion is significant, legal experts previously told CNN, because it appears to give grounds for the president designating drug traffickers as enemy combatants and having them summarily killed without legal review. Historically, people involved in drug trafficking have been considered criminals with due process rights, with the Coast Guard interdicting drug-trafficking vessels and arresting smugglers. The Senate blocked a push earlier this month to limit Trump’s ability to command the military to strike alleged drug boats without congressional authorization. Sens. Rand Paul and Lisa Murkowski were the only Republican lawmakers to cross party lines and support the resolution. “We basically are summarily executing people who are accused of something. It’s a terrible idea,” Paul, who joined with Democratic Sen. Tim Kaine to force a vote on reining in Trump’s war powers, told CNN on Thursday.",
    "domain": "us.cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:24.004546+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "us.cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://us.cnn.com/2025/10/19/politics/us-conducts-new-strike-on-ship-allegedly-involved-in-drug-trafficking-in-the-carribean",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "89eb1549d7fbc3c5c7f12b3a0d1ba547",
    "processed_at": "2025-10-19T21:31:25.631167",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses military actions related to drug trafficking and does not mention artificial intelligence or any AI-related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cnn.com/2025/10/19/middleeast/yemens-houthi-rebels-un-detain-20-intl-latam",
    "title": "Houthi rebels detain 20 UN employees and confiscate equipment in Yemen",
    "text": "Iranian-backed Houthi rebels detained two dozen UN employees Sunday, a day after they raided another UN facility in the capital Sanaa, a UN official said. Jean Alam, a spokesman for the UN resident coordinator for Yemen, told The Associated Press that the UN staffers were detained inside the facility in Sanaa’s southwestern neighborhood of Hada. He said those detained Sunday include five Yemenis and 15 international staff. He said the rebels released another 11 UN staffers after questioning. He said the UN was contact with the Houthis and other parties to “to resolve this serious situation as swiftly as possible, end the detention of all personnel, and restore full control over its facilities in Sanaa.” A second UN official, speaking on condition of anonymity to discuss the raid, said the rebels confiscated all communications equipment from the facility, including phones, servers and computers. The official said the detained employees belong to multiple UN agencies including the World Food Program, UNICEF and the Office for the Coordination of Humanitarian Affairs. The Houthis have launched a long-running crackdown against the UN and other international organizations working in rebel-held areas in Yemen including Sanaa, the coastal city of Hodeida and the rebel stronghold in Sadaa province in northern Yemen. Dozens of people, including over 50 UN staffers, have been detained so far. A World Food Program worker died in detention earlier this year in Sadaa. The rebels have repeatedly alleged without evidence that the detained UN staffers and those working with other international groups and foreign embassies were spies. The UN fiercely denied the accusations. The crackdown forced the UN to suspend its operations in Saada province in northern Yemen following the detention of eight staffers in January. The UN also relocated its top humanitarian coordinator in Yemen from Sanaa to the coastal city of Aden, which serves as seat for the internationally recognized government.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:24.443142+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/10/19/middleeast/yemens-houthi-rebels-un-detain-20-intl-latam",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9a86252eeea8619ecdf9fde43e6f5731",
    "processed_at": "2025-10-19T21:31:25.631201",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the detention of UN employees by Houthi rebels in Yemen and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.npr.org/transcripts/g-s1-94019",
    "title": "One ICE detainee story highlights gaps in due process : NPR",
    "text": "He was detained by ICE. Here's what happened when he lawyered up SCOTT SIMON, HOST: The Trump administration wants to deport a million people a year and is placing tens of thousands in immigration detention. As part of the strategy, immigration officers are arresting and detaining those whom the government had previously tried and failed to deport. NPR's immigration policy reporter, Ximena Bustillo, has been following the case of one such detainee. XIMENA BUSTILLO, BYLINE: Samantha Surovtsev met her husband, Roman, in 2017, while jet skiing that summer when they started to date. SAMANTHA SUROVTSEV: He told me about his past and his convictions, and, of course, I had a lot of questions. BUSTILLO: When he was a teenager, Surovtsev pleaded guilty to carjacking charges. He spent a few years in prison, and the green card he had received after coming to the U.S. as a young refugee from the former Soviet Union was revoked. When he was released in 2014, he was handed to Immigration and Customs Enforcement. SUROVTSEV: He told me, around that time, that he had spent time in ICE detention. He was a stateless person and that he couldn't be deported anywhere but checks in every year. BUSTILLO: The Surovtsev's lives followed the path of thousands of immigrants in the U.S. who are considered stateless. They got married, had kids and launched a small commercial painting business in Texas. But after President Trump won the election and there were reports of immigrants being detained at their check-ins, the couple started to worry. SUROVTSEV: There was also fears about detention. Where would he be? How would I be able to contact him? Could I contact him? There were so many unknowns that I could barely function. I was just shaking, fearful, crying. And I'm trying to keep it together for my kids' sake so that they wouldn't know what was going on. It was really hard. BUSTILLO: The morning of the appointment, they arrived early. SUROVTSEV: He doesn't even check in with an officer anymore. He was downgraded to a kiosk because of his situation. It was just basically verifying your information and then walking out. But after about 10 minutes had passed, I knew something else was going on. BUSTILLO: Roman Surovtsev was detained that day at the Dallas ICE field office and eventually transferred to the Bluebonnet Detention Center in north Texas. His wife, Samantha, lawyered up. And since he was detained, lawyers have successfully vacated the carjacking conviction, setting Roman on a path to get his green card back. But they say ICE is still trying to deport him to Ukraine, a country that has not provided any travel documents to return him and is in active war with Russia. Here's Eric Lee, a partner at one of the law firms handling the case. ERIC LEE: He's going to get his green card back in a matter of time, which only makes it all the more callous and absurd that the administration continues to try and remove him to a country to which removal is effectively going to be a death sentence. BUSTILLO: Court filings reviewed by NPR showed that ICE tried to provide documentation to Roman, but in Ukrainian, a language he does not speak. Chris Godshall-Bennett, a constitutional and civil rights attorney on the case, said Surovtsev is not the only one detained after ICE had let them go. CHRIS GODSHALL-BENNETT: There are lots of people in this situation, and there have been several habeas cases filed over the summer on very similar facts, a re-detention. BUSTILLO: Habeas is the legal avenue for people to claim that their detention is unlawful. In court filings, ICE argues that he can be detained because they're trying to get the travel documents for Ukraine. In many ways, Surovtsev's case is unique. Not everyone has this level of legal representation, for example. But in other ways, his case highlights what his wife said every immigrant should have, the due process to argue that they should stay. Here is Samantha. SUROVTSEV: People need to understand that there's a human element involved with immigration, that every story is unique. Every case deserves to be heard in front of a judge. This is not a black-and-white situation. BUSTILLO: In the more than two months that Surovtsev has been in detention, he's missed his wedding anniversary, his wife and daughters' birthdays and his mother's recent health issues. ICE did not respond to NPR's request for comment on Surovtsev's detention, and he remains there while he navigates this complicated legal landscape. Ximena Bustillo, NPR News, Washington. Copyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information. Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
    "domain": "npr.org",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:26.597753+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "npr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.npr.org/transcripts/g-s1-94019",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "50c3f983b51405040ece26aac7e412f6",
    "processed_at": "2025-10-19T21:31:25.631322",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the immigration detention of a specific individual and the legal challenges surrounding it, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://knpr.org/npr/2025-10-19/3-takeaways-from-saturdays-no-kings-nationwide-protests",
    "title": "3 takeaways from Saturday No Kings nationwide protests",
    "text": "One of the biggest days of protest against the Trump administration's policies happened on Saturday in cities around the U.S. The overriding theme of the marches was the accusation that President Trump is behaving more like a monarch than an elected official. It marked the second massive wave of protests organized by No Kings — a network of progressive organizations fighting against Trump's agenda. Organizers said about 2,600 No Kings events were planned across nearly every state, and that it projected a bigger turnout than the 5 million it said attended its previous nationwide action in June. Energized by a slew of actions taken by the administration since the summer protests, the group cited widespread immigration detentions carried out by often-masked Immigration and Customs Enforcement agents, the administration's aggressive slashing of federal education resources and environmental protections, gerrymandering and other concerns. Here's a recap of how the protests unfolded. 1. United in protests to 'protect America' Protesters showed up to oppose a wide range of issues, including the administration's immigration tactics and its push for federal and military intervention in Democratic-led states as a way to tackle crime. The diversity of concerns was strung together by the broader messaging of democracy, constitutional rights and the freedom the U.S. was founded on. In Washington, D.C., demonstrators filled Pennsylvania Avenue near the U.S. Capitol, many holding signs that read \"No Kings, No Tyrants.\" Many people wore yellow, a color organizers said is to show unity. Uriah Kitchen of Delaware, who attended the protest with his son Elijah, told NPR \"we made a pledge of allegiance when we were in school and this is what it's all about.\" \"This is why we're here, we're here to protect America,\" Kitchen said. Sen. Bernie Sanders of Vermont, an Independent who caucuses with Democrats, addressed D.C. protesters in remarks slamming tech billionaires who he said have become richer and more powerful since Trump became president. Sanders singled out Elon Musk, Jeff Bezos, Mark Zuckerberg \"and the other multibillionaires who were sitting right behind Trump when he was inaugurated.\" On the West Coast in San Pablo, Calif., Maria Floriano attended a No Kings event with immigration on her mind. Wearing a hat and shirt decorated with butterflies, she compared immigration to butterflies and said \"migration is beautiful\" and \"an act of courage.\" \"We want them to know that there are people fighting for them, that not everyone feels that they're not welcome here,\" Floriano said, noting the protest was held in a Bay Area community home to a large population of immigrants. 2. The Trump administration and Republican lawmakers weighed in House Speaker Mike Johnson slammed Saturday's protests as a \"hate America rally,\" and other Republicans have derided the event as anti-American. Responding to NPR's questions about the protests, White House spokeswoman Abigail Jackson said: \"Who cares?\" Trump was not at the White House during the protests but on a visit to his Mar-a-Lago resort in Florida. Connecticut House Republican Leader Vincent Candelora told Connecticut Public that he considered the \"No Kings\" messaging of the protests \"divisive.\" He also doesn't share protesters' concerns but supports their right to exercise their First Amendment rights. \"I think our democracy is still strong as ever — but, you know, they're free to express themselves,\" Candelora said. 3. Peaceful protesting with song and dance Despite the many criticisms that anti-Trump protesters came to preach, there were displays of optimism, hope and whimsy in several cities. Inspired by protesters in Portland, Ore., people in Los Angeles, Hartford, Conn., and elsewhere showed up to march in inflatable animal costumes. Song and dance broke out in Salt Lake City and other cities. As with the previous mass No Kings protests, revolutionary messaging showed up in demonstrators' clothing, chants and signs as protesters sought to remind people that America was founded in opposition to monarchy. In Macon, Ga., protesters belted \"The Story of Tonight\" from the musical Hamilton — a song about the importance of sacrifice and solidarity today for the sake of freedom tomorrow. The protests were largely peaceful. Police in New York City and Washington, D.C., where rallies drew some of the day's biggest crowds, said no protest-related arrests were made. Republican Govs. Glenn Youngkin of Virginia and Greg Abbott of Texas mobilized their states' National Guards in preparation for the protests. \"The Governor has authorized state active duty for training to help ensure the Guard will be ready to respond if needed to help keep people safe,\" Youngkin spokesman Peter Finocchio wrote in a statement to VPM. The Texas Newsroom reported that Abbott said in a statement of sending the Guards to Austin: \"Violence and destruction will never be tolerated in Texas.\" The newsroom also reported that state troopers were stationed at entrances to the Capitol grounds inspecting bags but protesters said the law enforcement presence felt smaller than the previous \"No Kings\" event in June. Saturday's rally was peaceful and there were no arrests, according to the Austin Police Department. NPR's Joel Rose and KQED reporter Brian Krans contributed to this report. Copyright 2025 NPR",
    "domain": "knpr.org",
    "domain_category": "unknown",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:27.840817+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "knpr.org",
    "sourcecountry": "United States",
    "gdelt_id": "https://knpr.org/npr/2025-10-19/3-takeaways-from-saturdays-no-kings-nationwide-protests",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5cfaad98af0da127c9d7458fb7ba43bb",
    "processed_at": "2025-10-19T21:31:25.631442",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses protests against the Trump administration and does not mention artificial intelligence or related topics. It focuses on political issues and social activism.",
      "keywords": []
    }
  },
  {
    "url": "https://www.nbcnews.com/politics/congress/rand-paul-favor-paying-troops-federal-workers-government-shutdown-bill-rcna238429",
    "title": "Sen . Rand Paul says he in favor of paying troops , federal workers during government shutdown",
    "text": "Sen. Rand Paul, R-Ky., said Sunday that he would support passing a stand-alone measure through the Senate to pay U.S. troops and federal workers who are not getting paid during the ongoing government shutdown. “I’m in favor of paying the troops. I’m in favor of paying all of the employees that are currently working. And if that procedure or that vote comes before us next week, which I think there’s a chance that it will, I will support that,” Paul told NBC News’ “Meet the Press.” It’s a notable position for Paul to take, given that he’s voted against every bill to temporarily fund the government in recent weeks. The federal government has been shuttered since the beginning of the month as the Senate has failed to overcome a 60-vote threshold for any bill to temporarily fund the government. The House in September passed a stopgap funding measure that would temporarily fund the government through Nov. 21. All House Republicans and one House Democrat voted in favor of that measure, but it has failed to earn the votes of 60 senators. Senate Democrats have proposed their own temporary funding measure that would fund the government through Oct. 31, reverse cuts to Medicaid that Republicans passed earlier this year and extend Affordable Care Act subsidies that are set to expire at the end of this year. That measure has also failed to garner 60 votes. During the government shutdown, federal workers and members of the U.S. military don’t receive paychecks. Some federal workers are furloughed and don’t work during the shutdown, while others continue working but don’t get paid. Last week, Trump announced that he and Defense Secretary Pete Hegseth were planning to fund troops’ paychecks ahead of the Oct. 15 payday. Meanwhile, the Trump administration tried to lay off thousands of furloughed federal workers, who are supposed to receive back pay for the time they don’t work once the government reopens. The move to lay off these workers has been temporarily blocked by courts. “I didn’t vote for their Democrat spending bill and I didn’t vote for the Republican spending bill,” Paul said Sunday. “I did so because the spending levels lead to an enormous amount of deficit. The Republican bill will lead to $2 trillion in deficit next year, the Democrat bill $3 trillion in deficit. So I opposed both.” The Kentucky senator has long been known to buck his party on bills that would increase the deficit, and it’s a key issue he’s championed nationally since he joined the Senate. Rand has faced criticism for his position from President Donald Trump, who on Friday wrote in a post, “Whatever happened to ‘Senator’ Rand Paul? He was never great, but he went really BAD!” “He just never votes positively for the Republican Party. He’s a nasty liddle’ guy ... a sick Wacko, who refuses to vote for our great Republican Party, MAGA, or America First. It’s really weird!!!” the president added. On Sunday, Paul responded to the post, telling “Meet the Press” moderator Kristen Welker, “What I represent some people describe as unusual, and the president describes it as weird that I’m for less debt and balanced budgets.” “But, you know, when I come home to Kentucky or when I travel the United States, people come up to me and say, ‘Stick to your guns. You’re the only voice up there, Republican or Democrat who’s still talking about the debt and still talking about balanced budgets,’” Paul added. He dismissed the president’s criticism, saying, “I don’t take it too seriously.” Sen. Tim Kaine, D-Va., joined the program after Paul and spoke about his party’s continued decision to vote against the GOP-backed bill to fund the government. Kaine said that Democrats would only vote to reopen the government if Trump “engages” in negotiations and if Republicans make a deal to extend ACA subsidies. “We want to negotiate a resolution so people’s health care costs don’t spike. And Republicans are saying the same thing. They know they need to fix this, so let’s fix it now,” Kaine told Welker. “The president told the Republicans to write this budget without any Democratic involvement. He instructed them to do this without any Democratic involvement,” the Virginia senator added. “That’s not the way things work here. And so when the Republicans wrote up this budget, we didn’t sit on our hands. We came up with an alternative that protected people from rising health care costs.” Kaine went on to say that it was up to the president to move the nation out of this shutdown. “We will get out of this shutdown within a matter of days or hours, once the president engages. We all have to come together on this, Democrats and Republicans, House, Senate and the White House,” Kaine said, adding later: “If he will engage, we’ll find a path forward.”",
    "domain": "nbcnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:30.334533+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nbcnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.nbcnews.com/politics/congress/rand-paul-favor-paying-troops-federal-workers-government-shutdown-bill-rcna238429",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e452da03241eba052b52f2be9d385721",
    "processed_at": "2025-10-19T21:31:25.631507",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a political issue regarding government funding and the payment of federal workers and troops during a government shutdown. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.nbcnews.com/politics/politics-news/former-rep-george-santos-only-pay-restitution-required-law-rcna238446",
    "title": "Former Rep . George Santos says he will only pay restitution if he required by law",
    "text": "WASHINGTON — Former Rep. George Santos, R-N.Y., said in a Sunday interview on CNN that he would only pay back approximately $374,000 in restitution if it is “required of me by the law.” “I can do my best to do whatever the law requires of me,” Santos said in an interview on CNN’s “State of the Union,” when asked whether he would work to pay people back as a judge had previously ordered. “So I don’t know what that is. I’ve been out of prison for two days. I agreed to come here to speak with you candidly and openly and not to obfuscate,” he said. “If it’s required of me by the law, yes. If it’s not, then no. I will do whatever the law requires me to do.” Santos was released from prison after President Donald Trump commuted his sentence on Friday, cutting short his seven-year prison term after less than three months. The former congressman had previously pleaded guilty to charges of committing wire fraud and aggravated identity theft. As part of his sentence, Santos was ordered to pay nearly $374,000 in restitution to those whom prosecutors characterized as his victims. Prosecutors had accused Santos of embezzling money from campaign donors and charging credit cards without authorization, among other crimes. In a separate interview on Fox News’ “Fox & Friends Weekend,” Santos argued that he does not still have to pay restitution. “I do not have any pendencies with the law anymore. I have no restitution. I have no probation,” he said, adding that “most of the restitution was really insane.” Santos was previously expelled from the House in December 2023. Just over a month after he was elected, Santos was launched into the spotlight after The New York Times reported that he appeared to have fabricated much of his resume. In November 2023, the House Ethics Committee released a report that said there was “substantial evidence” that the then-congressman had “violated federal criminal laws,” prompting Santos to say he would not seek re-election. Trump announced Friday that he would commute Santos’ sentence, asserting in a Truth Social post that Santos “has been horribly mistreated.” In the same post, Trump said that “at least Santos had the Courage, Conviction, and Intelligence to ALWAYS VOTE REPUBLICAN!” In the same post, Trump targeted Sen. Richard Blumenthal, D-Conn., who has apologized for saying he served in the military “in Vietnam” rather than “during Vietnam.” Trump argued that Blumenthal’s actions were “far worse than what George Santos did.” After Santos’ commutation, Blumenthal told NBC News that Trump’s “rant is fabricated nonsense,” adding that there was “no excuse for commuting George Santos’ sentence.” Santos’ commutation also sparked the ire of Richard Osthoff, a Navy veteran who has accused Santos of pocketing money from a GoFundMe raising money to get his dog lifesaving surgery. “My gut dropped; I felt like I was going to throw up,” Osthoff said after hearing about the commutation. Santos thanked the president in his Fox News interview, praising Trump as having “such an amazing will for second chances.” In his interview on CNN, Santos dismissed Trump’s detractors. “I’m pretty confident if President Trump had pardoned Jesus Christ off the cross, he would have had critics,” Santos said on CNN. “So that’s just the reality of our country.”",
    "domain": "nbcnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:30.610330+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nbcnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.nbcnews.com/politics/politics-news/former-rep-george-santos-only-pay-restitution-required-law-rcna238446",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "41868c1ed5ca7ece6a232f1b42b92279",
    "processed_at": "2025-10-19T21:31:25.631578",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the legal issues surrounding former Rep. George Santos, including his restitution obligations and comments made during interviews. It does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.nbcnews.com/news/us-news/multiple-people-injured-shooting-oklahoma-state-university-rcna238464",
    "title": "Multiple people injured in shooting at Oklahoma State University",
    "text": "Multiple people, including at least one student, have been injured in a shooting at Oklahoma State University’s main campus in Stillwater early Sunday morning, according to police. The university’s police department responded to Carreker East, a three-story residential hall on campus, at around 3:40 a.m. after victims arriving at off-campus locations reported the incident. Police initially said there were three victims, but OSU Police Chief Michael Beckner said later Sunday morning that “multiple” people were injured in the shooting and at least one is known to be a student. All of the victims are receiving treatment at local hospitals in Oklahoma City and Tulsa. “Initial reports indicate a large, private party occurred at an off-campus location. After the gathering disbanded, some attendees returned to Carreker East where the shooting occurred,” police said. Police are asking everyone who does not live in Carreker East to avoid the area, and for anyone with information on the incident to get in touch. “OSU law enforcement is on scene and investigating,” police said. This is the latest incident in a wave of gun violence at universities and schools over the last week. In Mississippi, a total of 10 people were killed in Leland, Heidelberg, Alcorn State University and Jackson State University as schools were celebrating homecoming. On Oct. 4, South Carolina State University went into lockdown after two unrelated shootings on the campus left one person dead and two people injured.",
    "domain": "nbcnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T184500Z",
    "date_download": "2025-10-19T19:30:30.718725+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "nbcnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.nbcnews.com/news/us-news/multiple-people-injured-shooting-oklahoma-state-university-rcna238464",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "e80e212a4df304baf05500ab896ecf53",
    "processed_at": "2025-10-19T21:31:25.631617",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a shooting incident at Oklahoma State University and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/sacramento/news/missing-colusa-county-man-found-dead-near-his-home/",
    "title": "Missing Colusa County man found dead near his home",
    "text": "Missing Colusa County man found dead near his home An elderly Colusa County man was found dead after being reported missing on Saturday, the Colusa County Sheriff's Office said. He was identified as 84-year-old Jim Hamner, and foul play is not suspected, the sheriff's office said. He was reported missing from his home near Hankins and Stovall roads, west of Williams, around noon and 2:30 p.m. The sheriff's office said that due to his age and welfare, a search was launched immediately. Crews from Glenn County, Williams, the Arbuckle Fire Department, and the California Highway Patrol joined the search, alongside aerial support. Hamner was then found just after 9 p.m. near an irrigation canal, close to his home. \"The Colusa County Sheriff's Office extends its deepest condolences to the family and friends of Mr. Hamner. We would also like to thank the community members and partner agencies who assisted in the search effort,\" the sheriff's office said. A cause of death will be determined by the county's Coroner's Office Pathologist.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:34.999323+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/sacramento/news/missing-colusa-county-man-found-dead-near-his-home/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "bfe9b29dd0da92286ad8408a1226b402",
    "processed_at": "2025-10-19T21:31:25.631644",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the search and discovery of a missing person, which is unrelated to artificial intelligence or its applications.",
      "keywords": [
        "missing person",
        "Colusa County",
        "search effort",
        "death"
      ]
    }
  },
  {
    "url": "https://www.cbsnews.com/news/sam-rivers-bass-player-limp-bizkit-died-at-48-the-band-says/",
    "title": "Sam Rivers , bass player for Limp Bizkit , has died at 48 , the band says",
    "text": "Sam Rivers, bass player for Limp Bizkit, has died at 48, the band says Sam Rivers, the bass player for the metal band Limp Bizkit, has died, the band said on social media. He was 48. The band said Rivers died on Saturday but did not disclose where he died or the circumstances. They described him as \"pure magic\" and \"the soul in the sound.\" \"From the first note we ever played together, Sam brought a light and a rhythm that could never be replaced. His talent was effortless, his presence unforgettable, his heart enormous,\" the band wrote in an Instagram post announcing his death. \"We shared so many moments — wild ones, quiet ones, beautiful ones — and every one of them meant more because Sam was there.\" The band added: He was a once-in-a-lifetime kind of human. A true legend of legends. And his spirit will live forever in every groove, every stage, every memory.\" Fred Durst, the band's frontman and lead vocalist, posted a video Sunday morning that recounted how they met at a club in Jacksonville Beach, Florida, and went on to musical stardom and performances around the globe. Durst said he has shed \"gallons and gallons of tears since yesterday.\" \"He really did have an impact on the world and his music and his gift is the one that's going to keep on giving,\" Durst said. \"I just love him so much.\" Rivers had spoken of heavy drinking that had caused liver disease. He left the band in 2015 and received a liver transplant before reuniting with Limp Bizkit three years later. Limp Bizkit has scheduled a tour of Central and South America to begin in Mexico City in late November. Durst said he and Rivers shared a love of grunge music, naming the bands Mother Love Bone, Alice in Chains and Stone Temple Pilots. \"He had this kind of ability to pull this beautiful sadness out of the bass that I'd never heard,\" Durst said, calling Rivers \"so talented I can't explain.\" Limp Bizkit, with roots in Jacksonville, Florida, emerged in the late 1990s with a sound that melds alternative rock, heavy metal and rap. Their off-the-wall sense of humor is reflected in the titles of their mega-selling 2000 album, \"Chocolate Starfish and the Hot Dog Flavored Water,\" and a single released last month, \"Making Love to Morgan Wallen.\"",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T174500Z",
    "date_download": "2025-10-19T19:30:35.391061+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/news/sam-rivers-bass-player-limp-bizkit-died-at-48-the-band-says/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1dc6e1756f2e63a5e7447efd832c7cf0",
    "processed_at": "2025-10-19T21:31:25.631688",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is primarily about the death of Sam Rivers, a bass player for Limp Bizkit, and does not discuss any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/news/prince-andrew-london-police-report-virginia-giuffre/",
    "title": "London police investigating report Prince Andrew asked officer to dig up  dirt  on Virginia Giuffre",
    "text": "London police investigating report Prince Andrew asked officer to dig up \"dirt\" on Virginia Giuffre The Metropolitan Police in London said it is \"actively looking into\" a newspaper report that Prince Andrew asked an officer assigned to him as a bodyguard \"to dig up dirt\" on sexual assault accuser Virginia Giuffre in 2011. The report, in the Mail on Sunday, said that Andrew provided the bodyguard with Giuffre's date of birth and confidential social security number to try to find out if she had a criminal record or any potentially damaging information about her just before the U.K.-based newspaper was due to publish a photo of Giuffre's first meeting with the prince. It's not clear if the officer complied with the request. Giuffre's family said she didn't have a criminal record. The report follows Buckingham Palace's announcement on Friday that Andrew had agreed to relinquish his royal title Duke of York and other British honors after emails emerged showing he had remained in contact with convicted sex offender Jeffrey Epstein longer than he had previously admitted. \"In discussion with The King, and my immediate and wider family, we have concluded the continued accusations about me distract from the work of His Majesty and the Royal Family,\" Andrew, the younger brother of King Charles III, said in the statement. \"I have decided, as I always have, to put my duty to my family and country first. I stand by my decision five years ago to stand back from public life.\" Giuffre, who died by suicide in April, sued Andrew in 2021, alleging that he forced her to engage in sexual acts against her will when she was 17 years old. She has accused Epstein and his associate, Ghislaine Maxwell, of trafficking her to Andrew. The two reached an out-of-court settlement in 2022. Andrew has denied the allegations. In a statement to CBS News, Guiffre's family said they believe Prince Andrew's decision to give up his royal titles is \"vindication for our sister and survivors everywhere.\" They called on Charles to strip him of the title of prince. \"This moment serves as victory for Virginia, who consistently maintained, 'He knows what happened, I know what happened, and there's only one of us telling the truth, and I know that's me,'\" the statement said. \"This is not just a victory for her, but for every single survivor of the horrific crimes perpetrated by Epstein and his co-conspirators.\" The emergence of the emails was another blow for the House of Windsor after years of tawdry headlines about Andrew's dodgy friends and suspicious business deals. The move to insulate the monarchy from Andrew's scandals has been ongoing since November 2019, when he gave up all of his public duties and charity roles after a disastrous interview when he sought to counter media reports about his friendship with Epstein and deny allegations that he had sex with a 17-year-old Giuffre. Andrew was widely criticized for failing to show empathy for Epstein's victims and for offering unbelievable explanations for his friendship with the disgraced financier. The BBC interview, in which he said he cut off contact with Epstein in 2010, came back to haunt him and sowed the seeds for his demotion when it emerged that he had emailed Epstein 12 weeks later. Prince Andrew told Epstein in the note that they were \"in this together\" and would \"have to rise above it.\" British Energy Secretary Ed Miliband, who was serving as the government's representative on the Sunday morning news programs, said a police officer should not be enlisted in a smear campaign. \"These are deeply concerning allegations,\" Miliband told the BBC. \"I think people want to look at those allegations and what the substance is behind them. But if that is correct, that is absolutely not the way that close protection officers should be used.\" In his statement on Friday, Andrew said he continues to \"vigorously deny\" the accusations. As well as no longer being known as the Duke of York, Andrew will also give up other titles: Knight Grand Cross of the Royal Victorian Order and Royal Knight Companion of the Most Noble Order of the Garter. He will remain a prince, a title he was given at birth.",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T184500Z",
    "date_download": "2025-10-19T19:30:36.056199+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/news/prince-andrew-london-police-report-virginia-giuffre/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "cc89857e57722907482ac1d880c13c9c",
    "processed_at": "2025-10-19T21:31:25.631728",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a police investigation involving Prince Andrew and allegations related to sexual misconduct, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cbsnews.com/boston/news/montie-quinn-curry-college-rushing-record/",
    "title": "Massachusetts college running back sets NCAA rushing record with 522 yards",
    "text": "Massachusetts college running back sets NCAA rushing record with 522 yards Montie Quinn of Division III Curry College ran for 522 yards in a 71-27 win over Nichols College to set the NCAA all-division rushing record Saturday. Quinn carried the ball 20 times, and eight of them went for more than 25 yards. His school-record seven touchdowns came on runs of 85, 84, 76, 64, 58, 30 and 2 yards. \"I'm just humbled and grateful,\" Quinn said. \"Breaking the record is something I never imagined coming into today. The O-line was dominating all game; receivers were blocking like crazy and coaches put us in position to make plays. This belongs to all of us; I just happened to be the one carrying the ball.\" Quinn became the first college football player in recorded history to rush for more than 500 yards in a game. The previous Division III record was 465 yards by Cartel Brook of Heidelberg (Ohio) in 2013. Other NCAA records are 425 by South Dakota Mines' Connor Silveria (2018) in Division II, 437 yards by North Carolina A&T's Maurice Hicks (2001) in the Championship Subdivision and 427 yards by Oklahoma's Samaje Perine (2014) in the Bowl Subdivision. The NAIA record is 409 yards by Eastern Montana's Derrick Williams in 1976. \"What Montie did today was nothing short of amazing,\" Curry coach Todd Parsons said. \"Breaking the NCAA rushing record is a monumental achievement. I think he'd be the first to tell you, records like this don't happen alone. Our offensive line played lights out, our receivers blocked downfield and our quarterback made great decisions.\"",
    "domain": "cbsnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T190000Z",
    "date_download": "2025-10-19T19:30:36.231088+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cbsnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cbsnews.com/boston/news/montie-quinn-curry-college-rushing-record/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1ab8cc586afe64c15a821f731d555cad",
    "processed_at": "2025-10-19T21:31:25.631758",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a college football player's achievement in breaking a rushing record and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/entertainment/kim-kardashian-sparks-mixed-reactions-strange-fashion-choice",
    "title": "Kim Kardashian face - covering gown sparks mixed reactions at gala",
    "text": "When it comes to daring fashion choices, Kim Kardashian is never one to back down. On Saturday, the SKIMS founder, 44, arrived at the fifth annual Academy Museum Gala wearing a nude-colored strapless corseted gown from the Maison Margiela Fall 2025 Couture collection, paired with a matching mask that covered her entire face. The decision to cover her face sparked mixed reactions online. KIM KARDASHIAN BRINGS ELIZABETH TAYLOR’S UNTOLD STORY TO FOX NATION \"It's unnecessary and distracting to watch her contort her body to the point she cannot breathe,\" one user wrote on X. \"The fashion could be appreciated ‘as art’ better if those viewing weren't thinking about how it feels to wear it.\" \"I find this so strange,\" another wrote. \"What's she hiding,\" one user asked on X. Despite the speculation, some were quick to praise the mom-of-four for her risky decision. \"Wait I’m obsessed,\" one fan wrote on X. \"I actually like this,\" another added. The \"Kardashians\" star seemed to have poked fun at her look while her makeup artist, Mario Dedivanoic, worked on the \"final touches.\" \"Mario, do I look OK? The make-up?\" she said in the clip Dedivanoic shared to his Instagram Stories. \"Your make-up looks amazing, yes,\" he joked. \"It’s good? All that hard work, guys,\" she responded. CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER This isn't the first time Kardashian has faced fashion-related criticism. Last week, Kardashian and her daughter North were the subject of intense online criticism after the 12-year-old was photographed in Rome wearing a corset-style top with a skirt and blue hair. \"I think like any mom of a teenager or a preteen, unless you've been here, like, please, we just need a little bit of grace,\" she told Alex Cooper during an appearance on the \"Call Her Daddy\" podcast. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS The reality TV star added, \"I just think anyone that's raising kids, especially four kids by myself, I'm doing the best that I can and my babies are good babies. So I just urge everyone to like not be judgmental and to have grace [for] single moms trying to figure it all out with like you know a preteen. It's a lot, if you know you know.\" \"It's interesting because all the kids are like wearing the same things, but then my daughter tries to wear it, and then I'm like, 'OK, we're never wearing that again,'\" the SKIMS founder noted. \"Unfortunately, we made that mistake in front of the whole world.\" CLICK HERE TO GET THE FOX NEWS APP \"She's usually a girl that dresses like a tomboy most of the time,\" Kardashian explained. \"She wanted to try something that her friends were wearing and went to the same place that they went to, and they all got these outfits, and then she wears them, and it's just like, 'OK, wait, maybe you can't wear that.' And so as a mom, you're kind of learning at the same time.\" Fox News Digital's Lauryn OVerhult contributed to this post.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:40.896127+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/entertainment/kim-kardashian-sparks-mixed-reactions-strange-fashion-choice",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "db5949923367a31c0639f9a961300d16",
    "processed_at": "2025-10-19T21:31:25.631807",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Kim Kardashian's fashion choices and public reactions to them, with no mention or relevance to artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/us/btk-killers-daughter-calls-him-subhuman-after-final-prison-confrontation-ends-relationship",
    "title": "BTK killer daughter confronts him in prison , leaves shaking",
    "text": "Nearly 20 years after Dennis Rader was sent to prison, his daughter Kerri Rawson found the strength to confront him face-to-face. In 2023, the mother of two was enlisted by investigators to determine whether the man who once terrorized Wichita, Kansas, and taunted police during a 17-year murder spree might be linked to other unsolved killings. Facing the father who called himself BTK — short for \"bind, torture, kill\" — would mark the final break in a relationship already shattered by his crimes. Rawson, 46, who has spoken out about the serial killer over the years, is the subject of a new Netflix documentary, \"My Father, the BTK Killer.\" It explores how the Michigan resident is struggling to reconcile the loving father she once knew with the monster exposed by police. DAUGHTER OF NOTORIOUS KILLER DAN LAFFERTY CHOOSES FORGIVENESS OVER HATRED AFTER DECADES OF SHAME \"It was really hard for Kerri to confront her father,\" director Skye Borgman told Fox News Digital. \"She talks about coming out of that prison. She was shaking after she talked to him about things that she had kept bottled up for a long time. And she was also surprised at her own feelings when talking to him. \"There were moments where she talks about seeing him switch between these two men, between her dad and BTK. One moment she felt like he was her dad, and then the next moment he shifted when she would ask him a question he didn’t like. He would switch to BTK.\" \"Having the knowledge that she knows now about his crimes, she was able to see that more,\" Borgman shared. \"It was incredibly hard for her. But at the same time, I think it gave her an ending to a chapter. She’s OK with not seeing him again. She’s OK with not talking to him again. Whereas before, there was a question mark there — do I want to see him? And now, the question is answered.\" WATCH: OKLAHOMA SHERIFF INVESTIGATING BTK HAS WARNING FOR COLD CASE KILLERS Rawson and two other investigators were hoping to see if Rader, now 80, could offer information about cold cases for the Osage County Sheriff’s Office. \"If my father has committed more murders, then we really need to get to the bottom of the truth, and we need to get to it before my father passes away,\" Rawson said during filming. In the documentary, Rawson questioned whether she may have been sexually abused by Rader as a child. She had read one of his notebooks from the 1980s, where he wrote about a bondage game in a bathtub. It included her name. Investigators warned her not to ask Rader about her suspicions, fearing he would shut down and refuse to answer questions. \"He's frail, he's in a wheelchair, and he was literally crying, so happy to see me — like, over the moon to see his kid,\" Rawson recalled in the film. When Rawson asked him about the cold cases during their three-hour conversation, he told her, \"What are you talking about? Can't we just reminisce? Can't we just have a father-daughter — can't we just have memories?\" FOLLOW THE FOX TRUE CRIME TEAM ON X Then, he \"turned on a dime,\" said Rawson. When she asked him about his journal entry, Rawson said he told her, \"That was just a fantasy. I never touched the family. You’re just making stuff up about me to be famous.\" Rawson described unleashing \"a blast of 45 years of anger\" at Rader as she went \"completely off script.\" \"He was literally gaslighting me, manipulating me, lying to me, five feet from me,\" she said. \"It was like I wasn’t talking to my dad. It was like I was talking to a subhuman. What everybody talks about — him being a psychopath and a narcissist and not wanting to be around him — I had still been able to find humanity in him. And then, I wasn’t able to.\" Borgman told Fox News Digital that the experience left Rawson so shaken that she never wants to see or speak to Rader again. \"I think Kerri thinks about her dad as two different men,\" Borgman explained. \"She talked about him being two different men. In her own words, she said she had a good childhood. They explored, they went places, they camped together, they had great family vacations. So those memories of her father, I think, she was able to hang onto them because she was able to separate that man from BTK. But as far as I know, they’re no longer speaking. She got to the point where she knew she needed to separate herself from him to continue on her healing journey.\" SIGN UP TO GET THE TRUE CRIME NEWSLETTER \"They’re not speaking anymore,\" Borgman shared. \"I think a lot of that communication was her trying to get information out of him. She realized that probably was not going to happen.\" Rader played a cat and mouse game with investigators and reporters for decades before he was arrested in 2005, The Associated Press reported. The former church leader and animal control officer confessed to murdering 10 people between 1974 and 1991 in and around Wichita. He is now serving one life term for each of the 10 people he was convicted of killing. Loved ones of the victims declined to participate in the documentary. Borgman said she made sure her film featured their voices prominently. \"We found the reasons for them not wanting to participate are very different,\" said Borgman. \"They’ve been reached out so many times, especially over the last 20 years. But the film shows the ripple effects of a crime like this. I hope the victims’ families feel represented. It was always our intention to make them equal participants in this story.\" Borgman said that when looking back, Rawson wondered if her father’s sudden bursts of anger were glimpses into his double life. Rawson is aware she may never know the truth. Throughout the film, Rawson stressed that she and her family had no idea about her father’s crimes and were blindsided when it came to light. \"When she was a little girl, Dennis would have these outbursts,\" said Borgman. \"She just thought, ‘Well, that’s my dad. He can get angry from time to time. He had a bad day at work, or the dishes weren’t cleaned when he came home.’ I think in looking back, she has more perspective about the surrounding circumstances that may have gotten him to be that way.\" GET REAL-TIME UPDATES DIRECTLY ON THE TRUE CRIME HUB \"It may be similar to how Kerri views her father as two different men,\" said Borgman. \"I think he was able to separate himself and come up with these lies where he had been able to sneak away. I think it provided something in him that he was able to hide when he came back home. And look, I’m not a psychologist. I can’t diagnose him, but I do think he got something out of this — that it provided something that he wanted and needed. And once he was able to get that, he was able to return to his role as a family man, a father figure.\" Today, Rawson is an advocate and mentor for those who have discovered that their relative is a violent offender. Borgman said the experience has been \"a double-edged sword\" for Rawson, who wants to be recognized for more than just being Rader’s daughter. \"The investigation with Osage County hasn’t really produced any evidence,\" said Borgman. \"[But] it’s required Kerri to dive into her father’s crimes. I think what’s healthier for her is when she’s working with other families and bringing perspective on what it’s like to be the daughter of a serial killer. She can speak to what a family may be going through and how hard that is, how the backlash and violence thrown at the family is a real thing.\" CLICK HERE TO GET THE FOX NEWS APP In the film, Rawson shared that since speaking out, she’s estranged from her mother and brother. Still, she remains hopeful about her future. \"I think that’s something she feels incredibly dedicated to doing — helping other families in similar circumstances,\" said Borgman. \"If she can ease somebody else’s pain, she’s going to do that, even if it causes her pain. And I think it’s largely because she wants to do something good just to take away a little bit of the bad her father did.\" \"My Father, the BTK Killer\" is now available for streaming.",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T183000Z",
    "date_download": "2025-10-19T19:30:40.958976+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/us/btk-killers-daughter-calls-him-subhuman-after-final-prison-confrontation-ends-relationship",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "9f1e8557c6182561d0cafd1887e2bd3a",
    "processed_at": "2025-10-19T21:31:25.631908",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the personal story of Kerri Rawson confronting her father, the BTK killer, and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://www.foxnews.com/health/bible-based-diet-could-unlock-secret-lasting-wellness-experts-say",
    "title": "Diet based on the Bible uses ancient foods to reverse modern health conditions",
    "text": "Many people turn to the Bible for guidance in times of both triumph and hardship — but some say it can also serve as a guide for physical health. Dr. Josh Axe and Jordan Rubin, co-authors of the book \"The Biblio Diet,\" believe that ancient foods of the Bible can be transformed into a modern dietary plan to enhance health and even help reverse life-threatening conditions. \"I think the Bible is the greatest health book ever written,\" Axe, a doctor of natural medicine in Tennessee, told Fox News Digital in an interview. \"If somebody's dealing with any health condition, whether it's depression, anxiety, cancer, heart disease, diabetes, PCOS, infertility, hypothyroidism or low testosterone, the Bible has a solution. If you follow a diet based on the Bible, you can be made well.\" PROTEIN SHAKE SAFETY DEBATE ERUPTS AFTER PROBE REVEALS LEAD IN POPULAR PRODUCTS Here are more details. Faith and healing through biblical principles Both Axe and Rubin have faced serious health challenges that deepened their faith and inspired their work, they said. Rubin was diagnosed with Crohn’s colitis as a teenager, and later with severe cancer. After visiting dozens of doctors with no success, he met a man who told him that if he followed a diet based on the Bible — proven through history and confirmed by science — he could be well. \"After another 40-day period of an upgraded diet — plus detoxification, and emotional and spiritual therapy — I overcame cancer that was referred to as terminal and did not undergo chemotherapy, radiation or additional surgeries,\" Rubin told Fox News Digital. KETO DIET HAS SURPRISING IMPACT ON MENTAL HEALTH, RESEARCHERS DISCOVER Dr. Axe’s own journey began while he was helping his mother overcome breast cancer. \"I put together a program for my mom that included certain foods in the Bible, like pomegranate and olive oil — and also prayer, faith, praise and worship,\" he said. \"I think the Bible is the greatest health book ever written.\" Later, when a medical procedure left Axe with a spinal infection, he again turned to a Bible-based diet and prayer, combining them with regenerative treatments to heal. \"I listened to the diagnosis of my great physician, not my ordinary physician,\" the doctor said. \"The great physician tells you to live with hope in all things and believe in the miraculous — and I did. Now I’m 100% healed.\" What a Bible-based diet looks like Food is mentioned repeatedly in the Bible, and both authors believe the core foods discussed can form the foundation of a healthy modern diet. Key examples include red meat, whole-grain sourdough bread, olive oil, dairy, fruits like pomegranates and figs, and natural sweeteners, such as raw local honey. Red meat, the authors say, is a \"superfood\" that provides protein, creatine, glutamine, carnitine, zinc, iron and B6. \"If you look at the Bible’s longest-lived heroes, anytime they could afford red meat, they would consume it,\" Rubin said. RED MEAT CAN HELP YOUR MOOD IF PART OF A HEALTHY, BALANCED DIET, STUDIES SUGGEST Bread, often demonized in modern diets, also plays a key role when prepared correctly. \"Properly sourced and properly prepared grains can be a part of a healthy diet,\" Rubin said. \"With Jesus being called the bread of life, it wouldn’t make sense if bread was bad for everyone. The way it’s processed and preserved matters.\" VIRAL MORNING WELLNESS ROUTINE PROMISES MORE ENERGY AND FOCUS BY NOON Olive oil, frequently referenced in scripture, supports skin, metabolism and cardiovascular health. Dairy — particularly from sheep, goats or certain dairy cows — can also be beneficial. \"The land of milk and honey was not just a euphemism,\" Rubin noted. \"Dairy can be very healthy if it’s whole, raw and grass-fed.\" \"Eat foods that God created and in a form that’s healthy for the body.\" Raw, local honey serves as a natural sweetener and immune booster, while unprocessed whole salt provides essential minerals. Avocados, figs and fresh fruits are other staples. \"Eat foods that God created and in a form that’s healthy for the body,\" Rubin advised. \"You can take red meat or an apple and make it unhealthy by how you grow, raise, process and prepare it.\" Foods to consider avoiding The authors argued that people should avoid foods labeled \"unclean\" in Leviticus — such as pork, shellfish and shrimp. \"Pigs, shrimp and other scavengers don’t have the system to properly process toxins,\" Rubin said. They also warned against modern processed foods, including those with high-fructose corn syrup, food dyes and refined sugars. Even foods considered healthy can become harmful when overly processed. \"If Moses were here today, what would the food laws look like?\" they ask in \"The Biblio Diet\" — encouraging readers to apply biblical principles to modern nutrition. Fasting and other biblical health practices Beyond food, Axe and Rubin highlight spiritual disciplines that impact both body and soul — particularly fasting. CLICK HERE TO GET THE FOX NEWS APP \"There’s no doubt that fasting is one of the greatest healing breakthroughs someone can experience,\" Dr. Axe said. Fasting can begin simply by avoiding food for a 10-hour window overnight, allowing the body to \"clean up damaged cells, cancer cells, parasites and infections.\" \"Fasting is one of the greatest healing breakthroughs someone can experience.\" He added, \"There’s a lot of medical literature on it being the greatest thing you can do to reverse the aging process and activate longevity.\" CLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER For some, fasting can also bring spiritual clarity. \"I can tell you personally [that] spiritual growth [brings a] deeper connection to God [and] clearer thinking — the ability to hear God’s voice,\" Dr. Axe said. Rubin agreed, emphasizing the importance of emotional healing as well. \"During my successful battle with cancer, I made spiritual health a priority,\" he said. \"I wrote out a prayer from the Bible and quoted it out loud three times a day — it was medicine to me.\" He also focused on forgiveness, calling it \"essential\" to his recovery. Best to consult multiple sources The authors stressed that \"The Biblio Diet\" isn’t a one-size-fits-all solution. \"It’s a great diet for everyone, but due to the number of health problems people have today, there is a level of customization that people can benefit from,\" Dr. Axe said. TEST YOURSELF WITH OUR LATEST LIFESTYLE QUIZ The diet, they noted, isn’t restrictive — it can even include waffles, pizza, cookies and ice cream made with wholesome, Bible-approved ingredients. Rubin advises anyone facing health challenges to stay calm, seek peace and consult multiple sources. \"Take a deep breath. Believe that God has provided for your healing. Seek a second opinion, and most of all, do what you have peace about.\" Axe and Rubin view health as a form of worship, they said — a way to honor God through the body. CLICK HERE FOR MORE HEALTH STORIES \"I think God wants us to be excellent in everything we do,\" Dr. Axe said. \"One of the greatest things we can do to influence others and let them see the truth of the Bible and what Jesus teaches is by being physically healthy.\"",
    "domain": "foxnews.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T181500Z",
    "date_download": "2025-10-19T19:30:41.126320+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "foxnews.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.foxnews.com/health/bible-based-diet-could-unlock-secret-lasting-wellness-experts-say",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0bd6425a753223affa8793a0effc06dc",
    "processed_at": "2025-10-19T21:31:25.632009",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a diet based on biblical principles and ancient foods for health improvement, with no mention or relevance to artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.latimes.com/world-nation/story/2025-10-19/kenya-ex-prime-minister-raila-odinga-buried-as-the-country-faces-political-uncertainty",
    "title": "Kenya former Prime Minister Raila Odinga buried as the country faces political uncertainty",
    "text": "Kenya’s former Prime Minister Raila Odinga buried as the country faces political uncertainty - Share via - Former Prime Minister Raila Odinga was buried Sunday with full military honors as Kenya grapples with political uncertainty following his death. - President Ruto pledged to honor a political pact with Odinga’s party that helped stabilize Kenya after months of antigovernment protests, some that turned violent. - Five people died and hundreds were injured in stampedes during three days of public viewings that drew thousands of mourners. NAIROBI — Former Kenyan Prime Minister Raila Odinga was buried Sunday at his rural home as his country, which has been marred by postelection violence and other turmoil, faces political uncertainty. Leaders present at the burial, including President William Ruto, who signed a political pact with Odinga early this year, talked about the need for Odinga’s ODM party to remain united and either form or join the next government after the 2027 election. Odinga, a pro-democracy champion, was accorded full military honors that included a 17-gun salute by the army and was buried next to his father, Jaramogi, who fought for Kenya’s independence and was the country’s first vice president. Thousands of Kenyans and dignitaries from across Africa attended the final interment of a man described as a “selfless pan-Africanist.” Wailing mourners breached a security cordon to gain access to the burial site, which was initially only for family members and leaders. Odinga, 80, died in India on Wednesday, and his body was received by thousands of mourners in Kenya’s capital, Nairobi, on Thursday. Four public viewing events have been held in the last three days, attracting thousands of mourners and leaving five people dead and hundreds injured during stampedes. Though he never succeeded in his five campaigns to be president, Odinga entered into political agreements with three of the country’s five presidents when tensions rose after elections. Ruto said that he would support Odinga’s party to remain united and honor the political pact signed earlier in the year that saw opposition members appointed as ministers. “I am very proud today that Raila Amolo Odinga is being rested when one of his own students — a man he has mentored — is today the president of Kenya,” he said. Ruto had said Friday that Odinga helped him “steady the country” after a political pact signed in March, following months of antigovernment protests that saw young Kenyans storm and burn parts of parliament buildings. Odinga’s party officials were divided in their tributes, with some saying they would honor the pact with government while others hinted at an intention to steer clear of his former political rivals who tear-gassed him during opposition protests. Odinga unsuccessfully ran for the African Union chairperson position, but previously mediated political impasses in the continent. Former AU Deputy Chairperson Erastus Mwencha said that Odinga’s influence is continental. “I see him as one of those who fought for the second liberation,” Mwencha said, noting that some African countries are still struggling for democracy. While serving as prime minister in 2010, Odinga played a crucial role in constitutional review. Since his death, dozens of world leaders have hailed his statesmanship. Odinga’s survivors include his wife, Ida, and children Rosemary, Raila Junior and Winnie. Musambi writes for the Associated Press.",
    "domain": "latimes.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T190000Z",
    "date_download": "2025-10-19T19:30:43.252768+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "latimes.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.latimes.com/world-nation/story/2025-10-19/kenya-ex-prime-minister-raila-odinga-buried-as-the-country-faces-political-uncertainty",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8e0a56d44818cfe9e4a84104508a6281",
    "processed_at": "2025-10-19T21:31:25.632066",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the burial of Kenya's former Prime Minister Raila Odinga and the political situation in Kenya, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/world/article-louvre-museum-art-heist-jewellery-mona-lisa/",
    "title": "Famous museum heists from around the world",
    "text": "Thieves reportedly stole nine pieces from the jewelry collection of Napoleon and the Empress in the Louvre, using a basket lift to reach the museum on Sunday morning. The daring heist at the world’s most visited museum occurred as tourists were inside the Galerie d’Apollon, where part of the French Crown Jewels are displayed. The museum closed for the day as police sealed gates and ushered visitors out. Thieves steal historic jewels from the Louvre in daytime heist Here’s a look at some other famous heists worldwide: The Louvre’s missing Mona Lisa helped cement the portrait’s fame The Louvre has a long history of thefts and attempted robberies. The most famous came in 1911, when the Mona Lisa vanished from its frame, stolen by Vincenzo Peruggia, a former worker who hid inside the museum and walked out with the painting under his coat. It was recovered two years later in Florence — an episode that helped make Leonardo da Vinci’s portrait the world’s best-known artwork. Boston’s Isabella Stewart Gardner Museum heist remains unsolved It’s been called the biggest art heist in U.S. history, but 35 years later, the theft of 13 works from Boston’s Isabella Stewart Gardner Museum remains unsolved. In the early hours of March 18, 1990, two men disguised as Boston police officers talked their way into the museum by saying they were responding to a call. They overpowered two security guards, bound them with duct tape and spent 81 minutes pilfering 13 works of art, including masterpieces by Rembrandt, Vermeer, Degas and Manet. Authorities say the artwork is worth perhaps as much as a half-billion dollars. Museum officials say it’s priceless because it cannot be replaced. Some of the works, including Rembrandt’s Storm on the Sea of Galilee, were cut from their frames. Those frames hang empty in the museum to this day. Two German museum burglaries netted a solid-gold coin and royal jewels In 2017, burglars at Berlin’s Bode Museum stole a 100-kilogram (220-pound) Canadian solid-gold coin known as the Big Maple Leaf. The suspects are believed to have smashed a protective case and then managed to lift the coin out of a museum window before fleeing along a rail track with their haul in a wheelbarrow. After getting away with it, authorities believe they later cut up the coin, valued at about 3.75 million euros (US$4.33-million), and sold the pieces. Three men, including a museum security guard, were later convicted. Two years later, thieves smashed vitrines in Dresden’s Green Vault, one of the world’s oldest museums, and carried off diamond-studded royal jewels worth hundreds of millions of euros. Officials said they made off with three “priceless” sets of 18th century jewelry that would be impossible to sell on the open market. Part of the haul was later recovered. Five men were convicted and a sixth was acquitted. An English palace’s golden toilet was pried off its plumbing A thief who swiped a golden toilet from an English palace was convicted earlier this year along with an accomplice who helped cash in on the spoils of the 18-carat work of art insured for nearly 5-million pounds (more than US$6-million). Michael Jones had used the fully functioning one-of-a-kind latrine as he did reconnaissance at Blenheim Palace — the country mansion where British wartime leader Winston Churchill was born — the day before the theft, prosecutors said. He described the experience as “splendid.” He returned before dawn on Sept. 14, 2019, with at least two other men armed with sledgehammers and crowbars. They smashed a window and pried the toilet from its plumbing within five minutes, leaving a damaging flood in their wake as they escaped in stolen vehicles. The satirical work, titled America by Italian conceptual artist Maurizio Cattelan, poked fun at excessive wealth. It weighed just over 215 pounds (98 kilograms). The value of the gold at the time was 2.8-million (US$3.6-million). The purloined potty has never been recovered but is believed to have been cut up and sold. The piece had previously been on display at The Guggenheim Museum in New York. The museum had offered the work to U.S. President Donald Trump during his first term in office after he had asked to borrow a Van Gogh painting.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251019T174500Z",
    "date_download": "2025-10-19T19:30:46.258207+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/world/article-louvre-museum-art-heist-jewellery-mona-lisa/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0d5dd36c58bff3fe8669a59cf0da2070",
    "processed_at": "2025-10-19T21:31:25.632156",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses famous museum heists and does not mention artificial intelligence or related topics at all.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/black-phone-tron-one-battle-box-office-global-international-1236591659/",
    "title": "Black Phone 2 Opens To $42M Global Box Office , One Battle After Another Reaches $163M",
    "text": "Refresh for latest…: Blumhouse’s Black Phone 2 dialed up a $42M start globally, including $15.5M from the international box office – the latter above The Black Phone and Sinners in the same markets. The Universal release of the Scott Derrickson-directed Ethan Hawke-starrer is playing in 71 offshore markets, led by Mexico at $4.3M. It was No. 1 for the weekend there with a 58% share. The launch is above the first film, as well as Weapons, and more than 3x Smile 2 and Sinners. In the UK & Ireland, $1.48M placed it at No. 2 behind Uni’s other opener, Gabby’s Dollhouse: The Movie. The UK bow for Black Phone 2 is 19% above the first film. Watch on Deadline Brazil was another highlight at $1.2M, and with Saturday over-indexing as cinemagoing was boosted by cool and rainy weather. Black Phone 2 ranked as the clear No.1 title in the market and came in above the first film, as well as topping Smile 2, Weapons and Sinners. Australia and France round out the Top 5. In Oz, the sequel did $908K at No. 1 with business continuing to build throughout the frame. France captured $569K as Blumhouse’s first 16-rated film in the market. Upcoming releases include Germany, Spain, Korea and Japan. The sophomore session for Disney’s Tron: Ares was down 54% internationally with an additional $14.1M from 52 material markets. The overseas cume to date is $48.4M, lagging domestic’s $54.6M for a $103M global total through Sunday. China was new this weekend, but, as expected, did not light up, giving the movie a $2.8M launch. Tron: Ares was the top non-local title, slightly edging the arrival of One Battle After Another ($2.5M). It was No. 1 again in a handful of smaller markets, and No. 2 in Australia, Brazil and Mexico. The Top 5 after two weekends are: Mexico ($4.9M), UK ($4.3M), France ($3.3M), China ($2.8M) and Germany ($2.7M). The global Imax total so far is $17.6M including $7.1M from overseas. Warner Bros’ Paul Thomas Anderson critical darling One Battle After Another continued to hold strongly with a 38% drop for another $11.8M from 78 overseas markets in release. The offshore cume has crossed the century mark with $100.6M through today. Global is now $162.5M. The Top 5 international markets are: UK ($13M), France ($10.1M), Germany ($7.7M), Italy ($5.2M) and Australia ($4.6M). Universal/DreamWorks Animation’s Gabby’s Dollhouse: The Movie notably added the UK and Spain this session, bringing the number of overseas markets in release to 60. The frame was $6.8M to reach an international cume through Sunday of $28.2M, above Captain Underpants on a like-for-like basis. Holdovers were down 46%. UK & Ireland had a No. 1 start with $2.3M including Thursday’s strong “Purrsday” previews, and also the highest screen average in the market. There was especially strong performance in Scotland, where schools are at the back end of their early October half term, ahead of holidays rolling out across the rest of the UK. The weekend result is in line with the openings of both Bad Guys films, above Paw Patrol: The Mighty Movie, Captain Underpants and Paw Patrol. Spain also had a No. 1 start with $1M including last Saturday’s previews. The opening result excluding previews is in line with Captain Underpants, and above Sonic 3 and Paw Patrol. Still to release is Japan in March next year. MORE…",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T174500Z",
    "date_download": "2025-10-19T19:31:14.692204+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/black-phone-tron-one-battle-box-office-global-international-1236591659/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "2b02306fc76991e976e78d8002d3e4ec",
    "processed_at": "2025-10-19T21:31:25.632369",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the box office performance of movies, specifically 'Black Phone 2' and 'One Battle After Another', without any mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/brandy-suffered-dehydration-wanting-faint-chicago-show-1236591742/",
    "title": "Brandy Was Dehydrated ,  Wanted To Faint  Before Exiting Chicago Show",
    "text": "After abruptly leaving the Chicago stop of her and Monica‘s The Boy Is Mine Tour, Brandy Norwood is explaining her exit and apologizing to fans. The artist explained that she “experienced dehydration and feelings of wanting to faint” before stepping off stage during Saturday’s performance at United Center, noting that she left the venue to “see a doctor nearby” and get checked out. “To my dear fans in Chicago, Thank you all for the overwhelming love, support, and—most importantly—your prayers,” she said in a statement. “I sincerely apologize for the abrupt end to last night’s performance in Chicago. After weeks of nonstop rehearsals, last night I experienced dehydration and feelings of wanting to faint, everyone involved agreed that prioritizing my well-being was of the utmost importance.” Watch on Deadline Norwood continued, “I still made the decision to try and return and give it my all despite not feeling ok. With having to make some adjustments and the show being very technical. Unfortunately, it was impossible to fully connect sonically with the production, I really appreciate everyone’s best efforts.” The I Know What You Did Last Summer actress added that she’s “deeply grateful to my sister, Monica, for stepping up with such grace and professionalism and the entire crew for their continued care and support. “I went from the arena to see a doctor nearby and have taken the proper precautions to help moving forward. Your understanding, patience, and unwavering belief mean the world to me,” said Norwood. “I look forward to returning to the stage—stronger and more grateful than ever—alongside my girl, Monica, tonight in Indianapolis. With all my love, Brandy“ Fans of Norwood and Monica were left confused by the abrupt end to Saturday’s concert, after Norwood abruptly walked off-stage early in the performance, leaving Monica to finish the concert solo, without getting to the tour’s eponymous 1998 duet. “Give me one second y’all I gotta get my—” said Norwood in a video, going backstage after apparently struggling with sound issues, never to return. After announcing their reunion in June, Brandy and Monica’s The Boy Is Mine Tour kicked off Thursday at Cincinnati’s Heritage Bank Center, featuring appearances from Kelly Rowland and Muni Long.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251019T190000Z",
    "date_download": "2025-10-19T19:31:15.333954+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/brandy-suffered-dehydration-wanting-faint-chicago-show-1236591742/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1c20ab0bf2ccc54c3050616911da3603",
    "processed_at": "2025-10-19T21:31:25.632417",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses Brandy Norwood's health issues during a concert and does not mention artificial intelligence or related topics.",
      "keywords": []
    }
  }
]