[
  {
    "url": "https://www.dr.dk/nyheder/seneste/eu-landene-vil-loesrive-sig-fra-russisk-gas-og-olie-inden-udgangen-af-2027",
    "title": "EU - landene vil løsrive sig fra russisk gas og olie inden udgangen af 2027 | Nyheder",
    "text": "Står det til EU-landenes regeringer, skal medlemslandene være helt fri af russisk gas og olie inden udgangen af 2027. Alle medlemslandene på nær to har i dag bakket op om Europa-Kommissionens forslag om blandt andet at sætte en stopper for import af russisk gas, både rørledningsgas og flydende naturgas, i løbet af de kommende godt to år. - Et energiuafhængigt Europa er et stærkere og mere sikkert Europa, lyder det i en pressemeddelelse fra energiminister Lars Aagaard (M), der som følge af det danske EU-formandskab sidder for bordenden af det ministerrådsmøde, hvor beslutningen er blevet taget. 'Det er jo ret vanvittigt' Siden krigen i Ukraine brød ud i februar 2022, har medlemslandene ifølge forskningsorganisationen Centre for Research on Energy and Clean Air, som holder øje med vores energikøb, købt gas, olie og kul fra Rusland for knap 1.607 milliarder kroner. Til sammenligning har de i samme periode støttet Ukraine for knap 1.100 milliarder kroner, viser tal for Europa-Kommissionen. I 2024 var der ifølge Europa-Kommissionen ti medlemslande, der fortsat importerede russisk gas. Faktisk var russerne sidste år den næststørste leverandør af gas til EU-landene, kun overgået af Norge. Omkring 19 procent af den samlede gasimport, herunder LNG-gas, kom fra Rusland. Med forslaget er der blandt andet lagt op til, at det fra årsskiftet vil blive forbudt at indgå nye gaskontrakter med Rusland. Derudover vil eksisterende korttidskontrakter forbydes fra 17. juni næste år, mens langtidskontrakter forbydes fra senest 1. januar 2028. Ved siden af det skal den sidste import af russisk olie være udfaset senest 1. januar 2028. - Det er jo ret vanvittigt, når man tænker over det, at vi har en fjende, som er i krig med Ukraine, og som vi gør alt for at bekæmpe. Og så er vi stadigvæk indirekte med til at finansiere Putins krig, sagde energikommissær Dan Jørgensen (S) inden mødet. Modstand fra Ungarn og Slovakiet Det er endnu uvist, hvilke to lande der var imod i dag, men Ungarn og Slovakiet har åbent sagt, at de er imod forslaget. Både af politiske grunde - begge er trods krigen i Ukraine fortsat allierede med Rusland og præsident Vladimir Putin - og af praktiske grunde. De er stærkt afhængige af den russiske energi. Ifølge Centre for Research on Energy and Clean Air har de to lande alene i år købt russisk energi for omkring 41,6 milliarder kroner. Det er mere end sidste år, hvor regningen lå på 41,4 milliarder kroner. De frygter begge, at forbuddet vil, hvis det bliver stemt endeligt igennem, få de hjemlige energipriser til at stige og føre til mangel på energi samt svække deres konkurrenceevne Forslaget skal nemlig først færdigforhandles med Europa-Parlamentet, før det i givet fald kan blive vedtaget og træde i kraft.",
    "domain": "dr.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:01.641076+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "dr.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://www.dr.dk/nyheder/seneste/eu-landene-vil-loesrive-sig-fra-russisk-gas-og-olie-inden-udgangen-af-2027",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "299b5150f66c19b98566aa360c9c85b2",
    "processed_at": "2025-10-20T12:26:31.035603",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the EU's plans to reduce dependence on Russian gas and oil, focusing on energy policy and geopolitical issues, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/loekke-stoetter-trump-forslag-om-ukraine/10982485",
    "title": "Løkke støtter Trump - forslag om Ukraine",
    "text": "Danmark støtter USA's præsident Donald Trumps forslag om en våbenhvile, der fastfryser den nuværende frontlinje. Det siger udenrigsminister, Lars Løkke Rasmussen. Udmeldingen kommer på vej ind til udenrigsministermøde i Luxembourg mandag. - Vi støtter Trumps melding om en våbenhvile på kontaktlinjen, siger Lars Løkke Rasmussen. I en udtalelse til journalister om bord på Air Force One, sagde Trump sent søndag, at Donbas-regionen i det østlige Ukraine bør for nuværende opdeles langs frontlinjen mellem Ukraine og Rusland. Og så må landene derefter forhandle sig til en løsning hen ad vejen. Dermed ville størstedelen af regionen være under russisk kontrol. - Vi synes, at det, de burde gøre, simpelthen er at stoppe ved frontlinjerne, hvor de er. Gå hjem, stoppe med at dræbe folk og være færdige, siger Trump sent søndag lokal tid ifølge nyhedsbureauet dpa. Udmeldingen kommer, efter at Trump fredag mødte Ukraines præsident, Volodymyr Zelenskyj. Forud for mødet var der forsigtig forhåbning i Europa om, at Trump ville sige ja til at give langtrækkende amerikanske Tomahawk-missiler til Ukraine i forsøget på at øge presset på Rusland. I stedet endte mødet med, at Trump gentog sin hidtidige linje om, at der skal etableres en våbenhvile på den nuværende frontlinje. Det er også Danmarks ønske. For der kan ikke blive tale om, at Ukraine før fredsforhandlinger skal afgive territorier, som Rusland ikke har formået at indtage, er den danske regerings holdning. Op til mødet med Zelenskyj sagde Trump, at han snart vil mødes med Ruslands præsident, Vladimir Putin. Det vil ske i den ungarske hovedstad, Budapest. Det kunne varsle ilde for Danmark og andre EU-lande, der ønsker urokkelig opbakning til Ukraine. Ungarns leder, Viktor Orbán, har nemlig flere gange markeret sig som modstander af at give våben til Ukraine og forhalet sanktioner mod Rusland. Løkke afviser dog, at Orbán med mødet får lov at sætte dagsorden for næsen af det danske EU-formandskab. - Hvis mødet i Budapest handler om en våbenhvile på kontaktlinjen, så er det helt ok, siger Lars Løkke Rasmussen.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:03.844414+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/loekke-stoetter-trump-forslag-om-ukraine/10982485",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "cab198bc234041bb9816f732c547ce6d",
    "processed_at": "2025-10-20T12:26:31.035634",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses political support for a ceasefire proposal related to the Ukraine conflict and does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/krimi/mand-overfaldet-af-maskerede-gerningsmaend-foran-soen/10982451",
    "title": "Mand overfaldet af maskerede gerningsmænd foran søn",
    "text": "En 42-årig mand blev søndag aften overfaldet af flere personer, da han steg ud af sin bil på Christians Torv i Solrød. Fem til syv maskerede gerningsmænd overfaldt manden med slag - muligvis med et slagvåben. Han blev også sparket og trampet på. Overfaldet skete for øjnene af mandens søn, der var med i bilen. Det skriver Midt- og Vestsjællands Politi i politikredsens døgnrapport. Politiet kan ikke umiddelbart oplyse sønnens alder. Overfaldsmændene forsvandt efterfølgende i to eller tre biler. De beskrives som værende 20-30 år, 170-180 centimeter høje og iført mørkt tøj. En af dem havde desuden en blå og hvid maske på. Den 42-årige blev kørt til behandling for sine skader på sygehuset. Politiet fik anmeldelsen søndag klokken 20.10 og hører meget gerne fra vidner til overfaldet. Politiet undersøger desuden, hvad der kan være motivet til overfaldet.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:03.976246+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/krimi/mand-overfaldet-af-maskerede-gerningsmaend-foran-soen/10982451",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "17b867d9fd6184b655e0c8991d6a23d6",
    "processed_at": "2025-10-20T12:26:31.035648",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a violent incident involving a man being attacked, which is unrelated to artificial intelligence or its applications. There are no mentions of AI topics or related terms.",
      "keywords": []
    }
  },
  {
    "url": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/ekspert-om-skroebelig-vaabenhvile-de-er-ikke-tilfredse/10982317",
    "title": "Ekspert om  skrøbelig  våbenhvile : De er IKKE tilfredse",
    "text": "Den blot ti dage gamle våbenhvile mellem Israel og Hamas er på ganske tynd is, efter begge parter de seneste dage har anklaget hinanden for at bryde den. Det overrasker ikke Peter Viggo Jakobsen, lektor ved Forsvarsakademiet, at våbenhvilen er 'skrøbelig', som han beskriver det til Ekstra Bladet. - Det viser jo bare, at israelerne ikke er tilfredse. De er stadig langt væk fra at nå deres erklærede mål om helt at fjerne Hamas, lyder det. Peter Viggo Jakobsen understreger dog også, at Israel 'jo holder inde igen' efter skudvekslingerne. - Der har formentlig været masser af mål for dem at gå efter, men der har nok været et amerikansk pres og et pres på de indre linjer for at få dem til at styre sig, lyder det. Artiklen fortsætter under billedet... Peger på hinanden Selvom de stridende parter altså gensidigt har anklaget hinanden for brud på våbenhvilen, har USA's præsident, Donald Trump, gjort det klart, at våbenhvilen stadig holder. Ordene fra præsidenten faldt, efter mindst 45 mennesker ifølge civilforsvaret i Gaza var meldt dræbt i israelske angreb, mens det israelske militær tidligere på dagen søndag meldte, at to soldater var dræbt og tre andre såret under et angreb i byen Rafah i den sydlige del af Gaza-striben. Artiklen fortsætter under billedet... Hamas har afvist at stå bag angrebet, men Peter Viggo Jakobsen mener, at det viser, hvor ustabil situationen egentlig er, ligesom han ikke mener, at Hamas har 'helt styr på deres soldater'. Svært at tro Samtidig er der - i ekspertens ord - 'ikke rigtig nogen, der tror på, at Israel er indstillet på at overholde våbenhvilen'. - Det er forbundet med en hel del skepsis, fordi israelerne ikke har nået deres erklærede mål om at fjerne Hamas fuldstændig og forhindre dem i at genvinde den politiske kontrol, lyder det. - Hvis det ikke koster Hamas livet som organisation, har Israel ikke opnået noget som helst rent strategisk. Om et antal år er de tilbage til udgangspunktet, lyder det fra Peter Viggo Jakobsen. Eksperten tror heller ikke på, at våbenhvilen kan blive til en reel fredsløsning i fremtiden. - Der er stadig ikke nogen, der kan se, hvordan våbenhvilen skal veksles til en varig fred. Det kan godt veksles til en våbenhvile, der varer et antal år, men den grundlæggende årsag til krigen bliver ikke fjernet, lyder det.",
    "domain": "ekstrabladet.dk",
    "domain_category": "journalism, news and media",
    "language": "Danish",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:04.130965+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "ekstrabladet.dk",
    "sourcecountry": "Denmark",
    "gdelt_id": "https://ekstrabladet.dk/nyheder/krigogkatastrofer/ekspert-om-skroebelig-vaabenhvile-de-er-ikke-tilfredse/10982317",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "d46f4b81a9c34f8b6ec3050ed505be92",
    "processed_at": "2025-10-20T12:26:31.035667",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a fragile ceasefire between Israel and Hamas, focusing on political and military analysis rather than any aspect of artificial intelligence. There are no references to AI technologies, applications, or research.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/film/2025/oct/20/my-best-friends-wedding-feelgood-movie",
    "title": "  Stole my heart : why My Best Friend Wedding is my feelgood movie | Julia Roberts",
    "text": "If When Harry Met Sally questioned whether men and women can be friends without sex getting in the way, My Best Friend’s Wedding is unequivocal. If your fiance has a female BFF – especially if she has the megawatt smile and mile-long legs of Julia Roberts at her ravishing best – prepare for drama. Even if you’re Cameron Diaz. Which is the precise scenario we’re confronted with at the start of my favourite chaotic caper, which made just under $300m at the global box office when it debuted in 1997, and also stole my heart as a melodramatic 11-year-old. We were truly spoiled for romcoms in the 90s – believe me, I watched them all – but My Best Friend’s Wedding is something special. To watch this PJ Hogan classic (he also directed Muriel’s Wedding) is to sink into a warm bath of nostalgia, complete with brick-sized mobile phones, indoor smoking and croony Burt Bacharach classics. It has everything: a car chase, an all-cast singalong lunch complete with dancing lobster claws and even an intimate mishap with an ice sculpture of Michelangelo’s David. But it also has the chutzpah to turn the romcom formula on its head, and give us an ending we don’t necessarily expect. Roberts plays Julianne, a no-nonsense New York food critic who has a pact with her college best friend Michael (a Disney-handsome, if dull, Dermot Mulroney) that if they reach the ripe old age of 28 unmarried, they’ll marry each other. Except now Michael is marrying peppy 20-year-old Kimmy (Diaz), which prompts Julianne to realise she’s actually desperately in love with him herself. “It’s amazing, the clarity that comes with psychotic jealousy,” Julianne’s editor George (Rupert Everett) drily remarks. Cue increasingly manic ploys to sabotage the wedding. Roberts is a bride-to-be’s worst nightmare. As a preteen in rural Surrey, I didn’t know anyone like these characters, but now I recognise Julianne instantly as one of those women who has no female friends, and for good reason. Impeccable in peak 90s tailoring and Pretty Woman-era auburn curls, she arrives in Chicago for the wedding and, within minutes, is making references to the “one hot month” she and Michael spent together at college. The impenetrable in-jokes are constant – poor Kimmy – and Julianne is such a knockout in her lavender satin bridesmaid gown (Kimmy’s former maid of honour “shattered her pelvis line-dancing over spring break”) that you’d be tempted to call off the entire thing there and then. But what I love, and have always loved about this film, is that it refuses to turn Kimmy into the villain in order to justify Julianne’s actions. Sure, she’s shrieky and drives like a psychopath, but she’s also sweet. In fact, none of the characters are entirely good or bad, they’re just nuanced – like real people (just very good-looking real people). It’s impossible not to root for Julianne, who’s the perfect, chaotic anti-hero. OK, so she’s chaotic in a sort of screwbally, Julia Roberts way that feels almost aspirational, but still, her inability to deal with things in a rational way feels very human. She’s too frightened and broken and proud to tell Michael how she feels, so there’s nothing for her to do but make bad decisions and chain-smoke through it, like a normal person. It’s refreshing! If I learned any lesson from the romcoms of my youth, it was that if you love somebody, you pursue them at all costs. But My Best Friend’s Wedding points out that, actually, that’s not always a great idea. And ultimately, Julianne puts herself out there, and gets shunned. It’s a big departure from romcom code, and while the film feels conventional in a lot of ways, I’ve always appreciated the honesty of its message that, actually, love isn’t always enough. It’s not all drama, though. In fact, while this film has a lot of heart, it’s also frequently absurd, and that’s what stops it being saccharine and makes it so rewatchable. A favourite moment of mine is when a serious conversation between Julianne and Michael is soundtracked by some wedding guests singing a three-part harmony of Annie’s Song in helium-induced chipmunk voices behind them. Meanwhile, Everett is exceptional as the charming and highly camp George, and the kitschy lip synch to Wishin’ and Hopin’ at the start of the film is utter perfection – I watch it on YouTube sometimes when I need cheering up. My Best Friend’s Wedding originally had a different ending, in which Julianne meets a new love interest at the wedding reception, rather than dancing her cares away with George, but apparently it had to be scrapped as test audiences reacted so negatively. And thank goodness: the film’s ultimate feelgood factor surely comes from its flawless ending, and the message that friendship is the most important relationship of all. I was single for much of my 20s, and watching the film then, it felt so satisfying to see Julianne having the time of her life just hours after having been rejected by a guy, rather than moping around. Now that’s a happy ending. - My Best Friend’s Wedding is available to rent digitally in the US and UK and on Stan in Australia",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:15.912487+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/film/2025/oct/20/my-best-friends-wedding-feelgood-movie",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "301a1a412b439addecd32435194bf340",
    "processed_at": "2025-10-20T12:26:31.035774",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article is a review and analysis of the film 'My Best Friend's Wedding' and does not discuss any topics related to artificial intelligence.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/society/2025/oct/20/medical-trial-transformed-young-person-life-clincial-depression",
    "title": "  I wish I took part sooner : how a medical trial transformed a young person life | Health",
    "text": "Millions of young people risk missing out on new treatments for health conditions and having to use medicines that are unsafe, ineffective or inappropriate because so few take part in medical research. One of those bucking the trend explains why he signed up to a study and how it transformed his life. Gulliver Waite was diagnosed with clinical depression at 19. For years, he struggled with extremely low mood, anxiety, frequent panic attacks and occasional paranoia. “I put everything I could into working because it was basically all I could do,” he says. “I didn’t really go out and see people. I just stayed at home and slept a lot. My partner would wake me up and try to stop me from doing it, but I could easily sleep 18 hours in a day. I just retreated into myself basically.” For the data analyst from Dunstable, Bedfordshire, even tasks such as brushing his teeth or taking a shower became difficult. “I would have no energy or I’d think: ‘What’s the point?’ While I wasn’t suicidal there was a feeling throughout that it would have been a lot easier if I just disappeared.” Waite tried a range of treatments, including antidepressants and talking therapies. But nothing soothed his symptoms. “At best I felt neutral. I could function but wasn’t really living, just getting through the days. It was difficult to recognise if I was better because I never felt truly happy.” Then his mother came across a clinical trial called PAX-D on Facebook. As a therapist, she would receive a lot of information about mental health studies and thought the trial could help her son. “At that point, I would have tried anything to feel better,” Waite says. “It was a particularly bad time. A little bit after I applied for the trial, I had to stop working because I just wasn’t coping. So it was very lucky she came across it and sent it when she did.” The study funded by the National Institute for Health and Care Research (NIHR) was testing whether a drug commonly used for Parkinson’s disease could help with treatment-resistant depression. Unlike antidepressants, which target serotonin, pramipexole mimics dopamine, which influences the energy with which people pursue goals. “The day after I started taking the drug I felt so much better,” Waite says. “I had loads more energy and stopped sleeping during the day. My sleep quality improved drastically as well as my overall mood.” He continued to take pramipexole after the trial concluded. A year ago, he stopped taking the drug, or any other antidepressants. It is the longest he has been off medication since he was 19. Now 31, Waite has more energy, his personal life has improved and he has even started a new job with a mental health research company, inspired by his positive experience on the PAX-D trial. “Everything isn’t the battle that it was. I’m not constantly having to feel like it would be better if it wasn’t here. I still feel anxiety and some days are lower than others, but it’s not the all-consuming thing it once was,” he says. “I wish I could have taken part in the trial sooner. If I would have known about it and it would have been running, I’d do it immediately. Even if I went back and got the placebo and didn’t get the actual medication itself, I’d still do it.” Waite is encouraging other young people to take part in research, as part of a national campaign by the NIHR. A UK-wide volunteer registry helps make it easier to join studies, by matching people with opportunities that align with their health concerns and interests. Anyone can take part in research, whether they have a health condition or not. Some trials seek people without the condition being studied, so researchers can compare them with those who have it. “It’s important that people consider taking part in research,” Waite says. “The only reason I could get the help I did on this trial is because of the people that volunteered for research before me. It’s validating to know that I have helped pay it forward a bit.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:15.968371+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/society/2025/oct/20/medical-trial-transformed-young-person-life-clincial-depression",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "906f4b87373dcfef4c84e0282f106918",
    "processed_at": "2025-10-20T12:26:31.035801",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses a personal experience with a medical trial for depression and the importance of participating in medical research. It does not focus on artificial intelligence or its applications.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/commentisfree/2025/oct/20/asbestos-britain-epidemic-deaths-buildings",
    "title": "It still killing people , and the government has yet to act : Britain hidden asbestos epidemic | Tom White",
    "text": "Helen Bone was diagnosed with an asbestos-related cancer in 2021. She was 38. The type of cancer, mesothelioma, is incurable; the best prognosis is a few years, though most people don’t get that long. “You always think of asbestos as a disease from decades ago – affecting men who worked in heavy industry – so to be diagnosed in my 30s is shocking,” she told the Northern Echo in 2022. “I want to see my children grow up but now I have to come to terms with the thought that this might not happen.” Sadly, Bone passed away in November last year, just three years after her diagnosis. For most people, the word “asbestos” will evoke previous eras: dusty Victorian and Edwardian factories; the shipyards of the interwar period; postwar building sites. Yet asbestos was not banned in the UK until 1999. According to the Health and Safety Executive (HSE), it still kills around 5,000 people every year. Many anti-asbestos campaigners believe that this figure is a serious underestimate, and that the real total is closer to 20,000. Mesothelioma has a long latency period: anything from 15 to 40 years. Helen Bone could have been exposed to asbestos at school, at the college where she studied to become a critical care practitioner, or at the two hospitals where she later worked. Bone is part of what’s known as the third wave of asbestos deaths. The first wave was those who worked directly with asbestos in mines and factories. The second wave was those who worked with or near the material: shipyard and rail workers, builders and other tradespeople, engineers. The third wave comprises all those who have been exposed as asbestos-containing materials deteriorate or are disturbed, releasing millions of fibres into the air, unseen. If the first and second waves constitute a horrific occupational disaster, then the third wave is a vast environmental and infrastructural catastrophe. Around 6m tonnes of asbestos were imported into Britain between 1870 and 1999. It remained mostly hidden behind walls and ceilings, laid into cement roofs and pipes, and was woven through textiles. British companies used two especially harmful types: crocidolite and amosite, which were mined in South Africa. British companies, Cape plc and Turner & Newall chief among them, relied on British imperial domination and, later, apartheid, to keep mining costs low and profits high. Thanks to the efforts of anti-asbestos campaigners and trade unionists, the use of asbestos declined significantly in the 1980s and 90s, before it was finally banned in 1999. But the ban was not accompanied by a coordinated removal programme. The start of the new millennium should have been the moment for a reckoning with asbestos. Instead, the material receded from view, its prohibition giving the impression that it was a problem solved. A lot of asbestos has been removed over the past 25 years. There are several decent companies that observe the law and work safely. There are also plenty of cowboy outfits that cut corners and put their workers and the public at risk. A lot of asbestos remains in place and is now far beyond its intended design life. The Control of Asbestos Regulations 2012 operate on the basis that risk is low if the material is undamaged and left undisturbed. This policy of in situ management is bad in theory and worse in practice. A recent audit by the National Organisation of Asbestos Consultants and the Asbestos Testing and Consultancy Association found that “of 128,761 buildings … examined over a six-month period, 78% had asbestos,” and that “71% of the asbestos items recorded … were damaged”; 30% were in the highest risk category, requiring immediate removal. The regulations place much of the onus on the “duty holder” who is responsible for monitoring asbestos-containing materials and for supplying information to building users in an asbestos management plan. Yet in many cases, rather than living documents, these plans are left to gather dust in a drawer. The regulations do not differentiate by the type of building, even though studies have shown that the risk of developing mesothelioma and lung cancer increases dramatically for those who are exposed when they are young. Nor is there any differentiation by the type of asbestos, even though it is known that amosite and crocidolite are particularly dangerous. There are nations that have chosen to address this challenge. In 2016, the South Korean Ministry of Education ordered that asbestos be removed from all schools by 2027. The government has allocated 2.872 trillion won (£1.8bn) to the programme. The Australian Asbestos and Silica Safety and Eradication Agency was founded in 2013 and is coordinating a multi-phase national strategic plan to eliminate future cases of asbestos-related disease in the country. The HSE does appear to be moving in this direction, though it has yet to set out a clear timeframe. In June, the all-party parliamentary group on occupational safety and health published a report on the legacy of Cape plc. As well as calling on Cape’s parent company, Altrad, to pay £10m towards research into asbestos-related cancer, the group reiterated the need for the government to commit to a national asbestos removal programme. The enduring presence of asbestos in schools, hospitals, housing and various other buildings presents not only a technical and logistical challenge, but also a challenge of political imagination. In the face of compounding social and ecological crises, the demand to remove and rebuild cannot simply be a call to replace what was there before, just without the asbestos. Rather, it implies a different kind of society with properly funded education and healthcare sectors, mass retrofitting programmes, and well-resourced local councils training and running their own asbestos removal teams. With its self-imposed fiscal rules and general lack of a substantive, positive vision for the country, it seems unlikely that the Labour government will arrive at such a programme on its own. If Britain’s asbestos disaster is to be addressed, then coalitions of campaigners, trade unionists and tenants’ rights groups will be vital. In the 1970s and 80s, similar coalitions took on a powerful industry and succeeded in reframing asbestos as an urgent risk to public health. Now, just as then, change will come from below, or not at all. - Tom White is a writer and education worker. Bad Dust: A History of the Asbestos Disaster, his first book, is published by Repeater",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:16.021001+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/commentisfree/2025/oct/20/asbestos-britain-epidemic-deaths-buildings",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3a70dce1e4955edb7caf8c099036aa49",
    "processed_at": "2025-10-20T12:26:31.036722",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the health risks and regulatory issues surrounding asbestos exposure in Britain, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.cnn.com/2025/10/20/us/trump-san-francisco-national-guard-legal-battle-hnk",
    "title": "Trump eyes San Francisco for next round of National Guard deployment as legal battles over troops intensify in other cities",
    "text": "President Donald Trump on Sunday threatened to send the National Guard to San Francisco as his administration continues an effort to crackdown on a growing list of cities it claims to be ridden with crime. “San Francisco was truly one of the great cities of the world, and then 15 years ago it went wrong, it went woke,” Trump said during an interview with Fox News anchor Maria Bartiromo Sunday. “We’re going to San Francisco and we’re going to make it great.” “Nobody wants you here,” California Gov. Gavin Newsom said in a social media post in response to Trump’s comments. “You will ruin one of America’s greatest cities.” The president told Bartiromo the cities he feels are in need of troop deployment are almost exclusively “Democrat-run,” describing them as “unsafe” and “a disaster.” Trump also claimed he could, at any moment, invoke the Insurrection Act – a seldom-used law that allows the president to deploy military forces in the US in certain limited situations. The mobilization of National Guard troops to cities like Chicago, Memphis, Tennessee, and Portland, Oregon, has been met with fierce backlash from residents as well as local and state leaders – including some who have gone so far as to sue the administration. Federal deployments have also sparked pop-up protests in these cities and helped fuel a second “No Kings” rally over the weekend, where millions took part in more than 2,700 events across the country to protest the Trump administration. Here’s the latest on Trump’s efforts to federalize troops in several US cities: San Francisco Trump toyed with the idea of deploying federal troops to the Bay Area last week when he told FBI Director Kash Patel that San Francisco was among the “great cities that can be fixed.” “San Francisco neither needs nor wants Trump’s personal army on our streets,” California state Senator Scott Wiener, whose district includes San Francisco, said on X. “We don’t need Trump’s authoritarian crackdown in our city. Bottom line: Stay the hell out of San Francisco.” Trump initially received support from Bay area tech billionaire and Salesforce CEO Marc Benioff, who told the New York Times ahead of his “Dreamforce” AI conference last week, he backed Trump’s troop deployment to the city. But Benioff later backtracked, saying on X he does not believe the National Guard is needed to address safety in San Francisco and his comments were made out of “an abundance of caution around the event.” “I sincerely apologize for the concern it caused,” he said. San Francisco Mayor Daniel Lurie has not directly commented on Trump’s comments, but said in a news conference last Friday crime in the city is down 30% – the lowest point in decades. The city has faced a shortage of police officers but recently reported its largest surge of recruits in years, according to the San Francisco Police Department, with 3,375 entry-level applications so far this year, up more than 40% from last year. For his part, Newsom sued the Trump administration in June over the federalization of the California National Guard to quell protests in Los Angeles and joined a lawsuit in Oregon earlier this month over Trump’s attempt to send federalized troops in Los Angeles to Portland to respond to protests there. Memphis A group of seven elected officials in Tennessee filed a lawsuit against the state’s governor and attorney general last week, challenging the deployment of the Tennessee National Guard to Memphis at the direction of Trump. “Governor Lee’s deployment violates both the Tennessee Constitution and state statutes, which allow the Guard to be called up only in the event of a rebellion or invasion—and only when the General Assembly declares that public safety requires it,” the officials said in a statement published by the National Immigration Law Center. “No such conditions exist in Memphis today.” Federal troops were seen in Memphis for the first time on October 10, the Associated Press reported, including soldiers accompanied by Memphis police officers patrolling at the Pyramid, an iconic landmark in the city. Memphis Mayor Paul Young, defended the city, noting crime has fallen by double-digit percentages since last year, but acknowledged the situation is different from efforts to fight the federalization of troops in Portland or Chicago, CNN affiliate WMC reported. “Memphis is different than L.A. and Chicago or Portland in that the governor of Tennessee and the president of the United States made the decision to bring the National Guard and the federal resources to the City of Memphis,” Young said Wednesday. Memphis Police Chief Cerelyn “CJ” Davis said last week she hoped troops would help direct traffic and have a presence in public retail spaces, but not operate at checkpoints, the AP reported. “From a public safety standpoint, we’re trying to utilize Guard personnel in non-enforcement types of capacities, so it does not feel like there is this over-militarization in our communities, in our neighborhoods, and that’s not where we’re directing those resources, either,” she said. Chicago Trump last Friday urged the Supreme Court to allow him to deploy the National Guard in Chicago, putting the legal fight over his ability to use those troops on American soil before the justices for the first time. The emergency appeal follows a series of decisions from lower federal courts which temporarily blocked the administration’s efforts to mobilize troops. On Thursday, the Chicago-based 7th US Circuit Court of Appeals let stand an order temporarily blocking that effort. In Trump’s appeal, the administration said the lower court order “improperly impinges on the president’s authority and needlessly endangers federal personnel and property.” The appeal describes the situation in Chicago as threatening, asserting that federal officials there have been “assaulted, attacked in a harrowing pre-planned ambush involving many assailants.” Clashes between protesters and law enforcement in Chicago became the focus of courtroom discussions last week with a judge demanding answers from federal authorities over violent encounters with protesters. US District Judge Sara Ellis said recent news reports were leading her to believe the Trump administration was not following her instructions to limit use of force and actions against journalists documenting Chicago protests. Ellis last week expanded her restraining order, requiring all federal agents with body cameras involved in quelling protests to have them on when encountering demonstrators. Her order, however, does not require agents to wear body cameras if they’re undercover, not in uniform or exempt from Customs and Border Protection, Immigration and Customs Enforcement or Department of Homeland Security policy. Portland A three-judge panel with the Ninth Circuit Court of Appeals is weighing whether the Trump administration should be blocked from deploying the Oregon National Guard to respond to ICE protests in Portland, after US District Judge Karin Immergut last week ruled to extend her temporary restraining order barring the deployment of federal troops to Portland. “Regardless of what happens next, Oregon (Department of Justice) will continue to fight to uphold Oregon’s laws and the Constitution,” Oregon Attorney General Dan Rayfield said in a social media post Wednesday. The president has cited protests outside Portland’s Immigration and Customs Enforcement facility to justify the callups of troops in the deep blue city. Leaders in Oregon have emphatically disputed the president’s characterizations of the city as “war-ravaged” and uncontrollably violent, arguing in court the situation on the ground in Portland is nowhere as extreme as federal officials portray it to be. Protests in Oregon’s biggest city over White House immigration policies started in June, with a declared riot and arson arrests in mid-summer. The scene was largely calm until Trump declared in late September he was sending 200 Oregon National Guard troops to the city. In a letter sent Friday to the Defense Department Office of Inspector General, a group of senators, including those from Oregon, asked for an inquiry into recent deployments of National Guard troops across the country. The senators argued that deployments were “fundamentally un-Constitutional, dangerous for American civil rights” and risk “straining military readiness and resources,” according to the letter. “We urgently request that you initiate an inquiry into the cumulative effects of these domestic deployments of U.S. active-duty troops and the National Guard—over the objections of state and local officials—on military readiness, resources, personnel, and our military as an institution,” the senators requested. CNN’s John Fritze, Andy Rose, Danya Gainor, Bill Kirkos and Josh Campbell contributed to this report.",
    "domain": "cnn.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:19.802632+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "cnn.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.cnn.com/2025/10/20/us/trump-san-francisco-national-guard-legal-battle-hnk",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "40edbe47cd4983983cf12cc2a7cfabde",
    "processed_at": "2025-10-20T12:26:31.037221",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses political issues related to the deployment of National Guard troops in various cities and does not focus on artificial intelligence topics. Although there is a brief mention of a tech billionaire associated with an AI conference, it is not the main subject of the article.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/canada/british-columbia/article-legislation-power-line-northern-development/",
    "title": "New B . C . legislation promises power line to unlock northern development",
    "text": "The B.C. government is set to introduce legislation Monday to fast-track construction of a multibillion-dollar power transmission line to the north coast. It’s British Columbia’s big bet: The publicly funded infrastructure project is meant to secure new private-sector investments, including a string of critical-mineral mines, for the sparsely developed northwest corner of the province. Energy Minister Adrian Dix says he expects the North Coast Transmission Line to break ground by the summer of 2026. The government is speeding the process in order to supply massive industrial projects that may or may not be built. Michael Goehring, president and chief executive of the Mining Association of BC, said the NCTL project will tip the scales in favour of 15 critical-mineral and precious-metal projects that require certainty of electricity supply before they proceed. “This is a nation-building project that will bring clean electricity to mining projects in northwest and central B.C.,” Mr. Goehring said in an interview Sunday. “It will strengthen Canada’s position as a leading global supplier of critical minerals and metals, and it will unlock more than $45-billion in near-term economic activity for British Columbians – and all Canadians.” B.C. Premier David Eby travels to Ottawa to lobby Carney for major projects funding The B.C. NDP government is lobbying for the support of Ottawa’s Major Projects Office, saying the NCTL meets the test of a nation-building project because it will help Canada join a global critical-minerals revolution by developing mining for copper, nickel, lithium, graphite and cobalt needed for renewable-energy projects and electric vehicles. Canada has identified 34 minerals and metals as critical to the country’s economic or national security. B.C. has supplies of more than a dozen of those minerals and metals, and there are 17 proposed critical-mineral mines and five precious-metal mines in advanced development. An economic study commissioned by the mining association concluded that the projects in development in B.C. would be worth $90-billion in new economic activity. The potential projects on tap – which also include expansion of the Port of Prince Rupert and additional liquefied natural gas development – would result in an enormous increase in electricity demand at a time when the province’s surplus energy supply is forecast to turn to a deficit. Mr. Dix has signalled that the province is prepared to adopt an allocation system where it chooses which industries take priority. Quebec, also confronted with an evaporating energy surplus, moved last year to amend its energy allocation policy. To meet growing demand for electricity, the Crown corporation BC Hydro has been on a buying spree over the past year, contracting for a major expansion of private power generation in the province. Still, Hydro’s new purchase agreements for wind and other renewable-energy projects will be stretched by demands for energy-intensive industries from mining and LNG plants to artificial-intelligence data centres. Ksi Lisims LNG developer welcomes shift in political support for industry While Alberta has launched an AI data centre attraction strategy, B.C. has not yet issued a clear policy on the sector. Instead, the B.C. government has pursued natural-resource development such as critical-mineral mines and LNG. These are projects worth billions of dollars, and thousands of jobs – enough, the NDP hopes, to dig the province out of its growing deficit and debt challenge. The province’s first LNG export plant came online in June and the LNG Canada operation alone is expected to measurably lift the national economy. An out-of-date business plan from BC Hydro estimated that the NCTL would cost more than $3-billion to build, and the revised budget will almost certainly be costlier. As well, generating additional power will cost more than the power produced by B.C.’s heritage hydroelectric system, and the legislation is expected to provide some clarity about how those costs will be shared. Mr. Dix said in an interview that these investments are pivotal to B.C.’s economic future. “BC Hydro started as a province-building enterprise,” he said. “And now it’s going to become a province-building company again.” LNG Canada prepares to start second processing unit in B.C. The construction of the transmission line creates risk for the government because it won’t guarantee billions of dollars of private-sector investment. But Mr. Dix said he is confident that those investments will follow. “None of this will make the mines happen in and of itself, but it is an important prerequisite,” Mr. Dix said. The proposed law will lay out plans for the first two phases of the transmission line, which would double the capacity of the existing electricity supply line that stretches 450 kilometres from Prince George to Terrace. It will also enable, for the first time, equity partnerships between Hydro and First Nations along the route. Possible extensions would bring more power to the Port of Prince Rupert, which features heavily in the province’s ambitions for a western transportation network that will open up more Canadian trade with Asia. There are also talks under way with the Yukon government to extend a line into the North. A report released earlier this month by the Yukon Development Corp. describes that extension proposal as “transformational” with the potential to unlock up to $7.6-billion a year in economic growth in the territory. Mr. Goehring said the mining industry supports B.C.’s call for federal backing of the transmission line. “There is a lot of discussion about the Ring of Fire in Ontario, and it’s a significant potential source of critical minerals and metals to Canada and the world. But right now, we have a region in Canada that is further advanced, and that is northwest British Columbia. There’s a very strong argument for a specific federal focus on this region.”",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T100000Z",
    "date_download": "2025-10-20T10:24:35.610055+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/canada/british-columbia/article-legislation-power-line-northern-development/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0acb381ae32b546c260954489bcb91c5",
    "processed_at": "2025-10-20T12:26:31.037310",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the construction of a power transmission line and its implications for mining and economic development in British Columbia. While it briefly mentions AI data centers, this is not the main focus of the article, which centers on infrastructure and energy supply.",
      "keywords": [
        "power transmission line",
        "mining",
        "electricity supply",
        "critical minerals",
        "AI data centres"
      ]
    }
  },
  {
    "url": "https://www.theglobeandmail.com/drive/reviews/article-we-will-soon-have-three-car-seats-do-you-recommend-an-suv-or-minivan/",
    "title": "We will soon have three car seats . Do you recommend an SUV or minivan ? ",
    "text": "We have a Subaru Outback that we bought in 2017. It has served us well pre-kids, but we now have two children aged two and four and are expecting a third child soon. The car has to fit three car seats and have some stroller space in the trunk. We are wondering if an SUV is better, or if having a minivan is best. Which brand do we go for? Our budget is $50,000 or cheaper. Is it better to buy used or new? – Joanne Mark Richardson: This is simple. Three car seats and space for a stroller? Forget SUVs – Joanne wants a minivan. This is what they’re designed for. Miranda Lightstone: I can feel your excitement getting to suggest a minivan, but I’m not entirely convinced she should jump on the van wagon just yet. Her eldest will be moving into a booster seat soon enough, and a three-row SUV can offer a decent amount of cargo space. Richardson: Any three-row SUV is limited in cargo space when all three rows are used as seats. Get over your anti-minivan prejudice. It’s the only smart way to go. Lightstone: I’ll admit I adore the ease-of-use a minivan offers, but a well-rounded and spacious SUV can be just as practical. Take the Toyota 4Runner, for example. There are quite a few used models available for less than her $50,000 budget. I’m currently driving a 2025 version, but they haven’t changed much over the years: there are two dedicated LATCH systems in the second row, and a smaller seat for the oldest child can be used in the third row. Richardson: Which doesn’t leave much cargo space for strollers. Why don’t we just tell Joanne about some minivans, and then maybe mention another SUV if she’s as image-conscious as you? Lightstone: Some see vehicles as a tool, others (read: me) as an accessory in life. And so, if I were to accessorize with a minivan, my first choice would be the Chrysler Pacifica, specifically the hybrid. Richardson: She has a budget of $50,000 all-in, so it can’t be new. Lightstone: Before you come at me with it being too expensive, used 2021 model year or earlier Hybrid versions can be found well under her price range on AutoTrader. They’re plug-in hybrids, too, with an all-electric range of around 50 kilometres when they were new. Richardson: The Pacifica has been around for a while, so there are Chryslers and the cheaper Dodge Grand Caravans going back years. You get what you pay for though, and I wouldn’t recommend a Chrysler or Dodge minivan from before 2020. The non-hybrid 2020 model is generally the best bet for reliability. Lightstone: If Dodge and Chrysler aren’t to Joanne’s liking, I’d look at a used Sienna next. Toyotas are well-known for their high resale value, and for good reason. Richardson: The Sienna is always my top choice for a minivan because of its overall reliability, and now its hybrid powerplant. It’s comparatively expensive to buy, but it holds that value well if it’s properly maintained. Lightstone: There are a decent number of trim levels for Joanne to browse if she really wants to buy the Sienna brand new, but they start right at the top of her budget, and those are before tax. Richardson: She’s open to buying used and a used Toyota is generally a sound investment. The hybrid Sienna’s been around for five years now, so there’s some choice in the market – if she can find one. If not, my next choice would be the Honda Odyssey. Lightstone: The Odyssey has always been hit-and-miss for me. While I enjoy the drive, it being a Honda and all, I’ve never been a fan of the onboard infotainment system. It’s not user-friendly or intuitive. I would be annoyed living with it daily. Richardson: I know what you mean. The Odyssey is fairly dull and long in the tooth now, too, but it is reliable. The Kia Carnival is really the only other comparable minivan and it was updated last year to improve all of its technology. Lightstone: I really liked the Carnival, and I don’t think enough people know about it. The Hybrid feels powerful to drive and the interior amenities are on point for its price range, which also falls into Joanne’s budget. Oh, and don’t forget the available second-row recliner seating. Richardson: The Toyota Sienna also offers second-row recliners, which are really quite comfortable. Joanne’s kids won’t be able to use them though, so their extra cost will be wasted on her family. Lightstone: Let’s swing back to SUVs for a moment, though, and let’s stick with Toyota. If the 4Runner is too rugged, the Grand Highlander is not too small for a growing family of five. Richardson: The Grand Highlander does have reasonable leg room in the third row, unlike most three-row SUVs. If Joanne really wants to avoid a minivan for some reason, as you do, it’s probably the most practical of the alternative choices. It’s too new to find a used model, and it’s expensive, owing to the Toyota reputation of reliability and high resale values. Lightstone: If Joanne has never sat in or driven a minivan, she should do so before she jumps straight to an SUV, even though I’ve given her two great SUV options. Richardson: Nonsense. With three kids, she shouldn’t consider anything other than a minivan if she wants easy access to all the seats and enough space to carry all their paraphernalia. For reliability and value, the Toyota Sienna is the best of the bunch. What car should you buy? Write to Mark and Miranda at globedrive@globeandmail.com and use ‘What car’ as as part of your subject line. Emails with different subject lines may not be answered. Shopping for a new car? Check out the new Globe Drive Build and Price Tool to see the latest discounts, rebates and rates on new cars, trucks and SUVs. Click here to get your price.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T100000Z",
    "date_download": "2025-10-20T10:24:36.338024+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/drive/reviews/article-we-will-soon-have-three-car-seats-do-you-recommend-an-suv-or-minivan/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "19ad057b5b63dc61da4e6c2415ca231e",
    "processed_at": "2025-10-20T12:26:31.037337",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the considerations for purchasing a family vehicle, specifically comparing SUVs and minivans, without any mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theglobeandmail.com/politics/article-igor-makarov-seeks-removal-canada-russian-sanctions-regime/",
    "title": "Billionaire oligarch seeks removal from Canada Russian sanctions list",
    "text": "A former Russian oligarch has renewed his legal fight to force Ottawa to remove him from Canada’s sanctions regime and free up more than $100-million of frozen assets. Lawyers for Igor Makarov informed Global Affairs Canada on Oct. 10 that they plan to challenge his presence on Canada’s sanctions list before an international arbitration panel. That could be either the World Bank’s International Centre for Settlement of Investment Disputes or a United Nations panel. The billionaire oil and gas tycoon renounced his Russian citizenship in 2023 and is now a citizen of Cyprus and Moldova. He accuses Ottawa of violating an investment treaty it has with Moldova. Canada placed Mr. Makarov under sanctions and froze $145-million of his assets in the aftermath of Russia’s invasion of Ukraine in February, 2022. His lawyers say the frozen assets and lost investments amount to $350-million. Mr. Makarov is seeking $350-million through international arbitration unless Ottawa renews negotiations to delist him. Earlier: Russian oligarch Igor Makarov moved money before Canada added him to sanctions list “We invite Canada to resolve this dispute amicably by negotiation,” his London-based lawyers wrote to Global Affairs’ sanctions division in a letter obtained by The Globe and Mail. The letter argues that the “sanctions have not been pursued in Canada in an even-handed manner or based on good-faith belief in any genuine connection between Mr. Makarov and the Russian regime, but rather to target Mr. Makarov as one of the few (former) Russians with substantial assets in Canada.” Britain, Australia and New Zealand had also put Mr. Makarov on their Russian sanctions lists, but they delisted him in March, 2024, and May and September of this year, respectively. The United States and European Union never imposed sanctions on Mr. Makarov, a former Soviet Union cycling champion. Canada now remains the only Western country with sanctions in place against Mr. Makarov because of his alleged ties to senior Russian officials, which he denies having. Mr. Makarov had previously challenged then-foreign affairs minister Mélanie Joly’s decision not to delist him before the Federal Court of Canada. That case was dismissed in August, 2024. The court said the minister has wide discretion and is “not bound by the strict rules of evidence.” The dismissal is currently under appeal at the Federal Court of Appeal. Mr. Makarov filed a second delisting application based on the international delistings in Britain and Australia. That application was also dismissed and is under judicial review. He then made a third delisting application after New Zealand subsequently also delisted him. That application is pending. His notice of legal dispute and intent to submit a claim to international arbitration under the Moldova-Canada investment treaty is a separate matter. He would be seeking compensation for mistreatment by Canada in violation of protections provided to him under the treaty. Thida Ith, a spokesperson for Global Affairs, said the department is “reviewing the information provided in the Notice of Intent,” but would have no further comment “on specific sanctions listings for privacy reasons.” Mr. Makarov and his lawyers did not make themselves available for comment. Opinion: Canada cannot wait for Europe and must act alone to ‘double-freeze’ Russian assets Mr. Makarov was the founder of the Russian energy conglomerate ITERA. The letter says that the businessman, who is currently president of ARETI International Group, not only severed ties to Moscow but has also spoken out publicly against the invasion of Ukraine and contributed funds to help 15,000 Ukrainian refugees. He said in the letter that he was forced to sell ITERA to the Russian state-owned oil and gas corporation Rosneft in 2013 and moved to Switzerland in 2016. He is now a resident of Cyprus. That same year, he invested heavily in Calgary-based oil and gas exploration company Inception Exploration Inc., which was later taken over by Spartan Delta. The shares in Spartan have been frozen. His lawyers argue that Mr. Makarov’s Canadian investments constitute a significant portion of the total value of his frozen assets and blocked transactions. “Canada has unlawfully deployed its sanctions regime against Mr. Makarov to restrict him from benefiting from, transacting with, or dealing in any way with his extensive investments in Canada,” the letter says. Being placed on Canada’s Russia-related sanctions list means any assets of the named person in Canada are frozen. People in Canada and Canadians outside of this country are prohibited from providing financial services to those under sanction, or entering into or facilitating transactions with them. Those under sanctions in Canada might also face the prospect of the federal government seizing and selling off their assets, with the proceeds donated to Ukraine, as Ottawa has proposed doing. They are also banned from entering Canada.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T100000Z",
    "date_download": "2025-10-20T10:24:37.100899+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/politics/article-igor-makarov-seeks-removal-canada-russian-sanctions-regime/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "5658a67bd4da4341db99d1f6a8477c48",
    "processed_at": "2025-10-20T12:26:31.037361",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses legal matters related to sanctions against a Russian oligarch and does not mention artificial intelligence or any related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.thedrum.com/news/2025/10/20/sams-club-shows-how-store-retail-media-should-really-work",
    "title": "Sam Club shows how in - store retail media should really work",
    "text": "Sam’s Club shows how in-store retail media should really work The Drum’s commerce media columnist, Kiri Masters, explains how Sam’s Club is turning in-store retail media from a testbed into a performance engine. Sam's Club While most retail media networks remain stuck testing endless pilots for in-store advertising, Sam’s Club Member Access Platform is rolling out programs at scale and leaving breadcrumbs for the industry to follow. I spent an afternoon touring a Sam’s Club in Murfreesboro, Tennessee, with Harvey Ma, who leads the retailer’s Member Access Platform. What I saw wasn’t a cautious experiment. It was a coordinated deployment of in-store retail media technology backed by serious investment in measurement and organizational alignment. That isn’t what we’re seeing in the broader retail market, to say the least. According to a new report from Emarketer, \"In-Store Retail Media 2025,\" in-store retail media ad spending won’t cross the $1 billion threshold until 2029 — a milestone the industry once expected to reach in 2028. Growth has built more slowly than anticipated despite advertiser demand, with roughly one in four ad buyers citing difficulty accessing in-store reach as a top challenge. The infrastructure and capital investment required to scale these programs remain daunting, and many retailers struggle to move beyond pilot purgatory. Sam’s Club took a different path, taking a big bet on a media channel that it could uniquely build and defend. The company has invested significantly in technology, shopper experiences, and measurement capabilities that let them prove what’s working at the individual member level. Ma’s philosophy cuts through the noise: “Advertising exists to sell more things.“ Want to go deeper? Ask The Drum From parking lots to point-of-sale Sam’s Club’s approach to in-store retail media actually starts outside the four walls. A few weeks ago, I covered their IndyCar sponsorship activation—a “Race to the Club” event series that brought race car simulators, prize wheels, and brand partner activations to club parking lots ahead of the season finale in Nashville. These weren’t brand awareness plays. They were member acquisition and engagement moments with measurable outcomes tied directly to membership sign-ups and in-club purchases. The events worked because Sam's Club treated them as part of a “retail experience network” rather than isolated marketing stunts. Vizio sold TVs out of their branded RV in the parking lot. ePro demonstrated vacuum cleaners with live spill-and-clean demos. Member’s Mark, Tyson, Fanttik, and Clearly Canadian all activated within the Sam’s Club ecosystem, coordinated by the retailer rather than each brand negotiating sponsorship independently. This orchestrator model matters because it shows how retailers can monetize their physical footprint beyond traditional ad placements. Ma told me the events generated strong NPS scores and that advertiser demand exceeded available partnership slots. Every touchpoint fed data back into Sam’s Club’s longitudinal measurement system. They can now connect a parking-lot engagement to a basket scan days later—and ultimately to what that member buys over the year. Now Sam’s Club is scaling these activations, targeting 5X growth in large-scale events for 2026. But the real test is what happens once you’re through the doors. Advertisement Matching format to function Emarketer’s research emphasizes that in-store placements aren’t interchangeable. Different formats serve different purposes, and retailers need to match technology choices to shopper behavior and category context. Sam’s Club demonstrates this principle in practice. Walk into the club with the Scan & Go app open, and you’re immediately served contextual ads based on your location and member profile. The exit technology uses computer vision to verify your cart contents against your scanned items—no unloading, no friction, just walk out. For members who’ve never used Scan & Go before, that first frictionless exit becomes a conversion moment for the technology itself. (Ma noted that their “zillennial” demographic—Gen Z and younger millennials—shows the highest Scan & Go penetration, because they’re impatient and don’t want to wait in lines. Despite being an older millennial, I felt seen.) In some locations, Sam’s Club pilots dynamic messaging on exit arch screens that can serve dynamic content and welcome first-time members by name. Screens appear throughout the club at strategic moments, including the entrance, pharmacy waiting areas, the cafe, and checkout exits. Screens appear at strategic secondary locations — such as endcaps and checkout – where SMG research shows that placements drive nearly 90% SKU lift for new product launches, compared with 36% for average campaigns. Ma pointed out the autonomous floor scrubber roaming the aisles of the Club. It isn’t just cleaning – it’s gathering thousands of signals per second through computer vision, monitoring traffic patterns, dwell time, and out-of-stock conditions. All of that feeds into merchandising and advertising optimization capabilities. Sam’s Club isn’t chasing every shiny format. There are no smart carts in sight. But each format in the club has a clear purpose. They’ve brought their in-store audio programming entirely in-house, with a live DJ in Bentonville curating playlists and voiceovers that stream to all clubs. Advertisers can sponsor custom messaging and song pairings, but Ma acknowledges measurement remains difficult given the high ceilings and ambient noise. It’s an impression play, not a conversion driver. Advertisement Breaking the JBP mold Ma’s approach challenges the traditional joint business planning cycle that has governed retailer-brand relationships for decades. Historically, merchants negotiated product assortment during JBP sessions, securing which SKUs would be on the shelves, and the conversation ended there. The merchant’s job was to get the product in; what happened next fell to someone else, or no one at all. Sam’s Club flips this dynamic. Every JBP conversation now includes the question: what do you want to do with this item once it’s in the club? How will you bring the product to life for members? That question forces coordination between merchant teams and retail media teams from the start, breaking down the silos that plague most retail media networks. The display of Samsung washing machines we stood in front of while discussing this topic would historically have been pure shopper marketing territory. Now it's a coordinated play that extends the merchant’s work through measurable media activation. The measurement that actually proves ROI Most retail media networks struggle to prove in-store advertising works because they can’t connect impressions to outcomes at scale. Sam’s Club built what Ma calls their “omni impact tool” — combining multi-touch attribution with marketing mix modeling over a 12-month member journey. “We are the first in the industry to have created an MTA (multi-touch attribution) combined with an MMM,” Ma explained. The system tracks every touchpoint a member encounters – on-site, off-site, in-club displays, audio, events – and uses AI-driven propensity modeling to determine which channels drove the most engagement and conversion. It operates at the member level with SKU-level precision, something few competitors can match. This closed-loop deterministic measurement creates a flywheel. Brands see what works, justify spending from performance budgets that previously couldn’t touch physical retail, and Sam’s Club captures advertiser dollars that would otherwise stay in digital channels. Ma’s team also developed what they call a “propensity predicting model” that identifies saturation points — telling brands when they’ve over-invested in a particular channel and should reallocate spend. \"We also think we’re the first ones to do that too,” Ma said. When I asked Ma what gets advertisers most excited, he pointed to the member-level, SKU-level closed-loop measurement first. Then the automation and AI that scales these insights without armies of analysts. But experiential retail media gets the most attention—creating memorable moments rather than just serving impressions. Suggested newsletters for you The reality check But here’s the catch: even if Sam’s Club executes flawlessly, in-store media won’t become the dominant revenue driver retail media networks hoped for. Emarketer’s projections are blunt – when you strip out Amazon’s massive digital dominance, in-store will represent only 3.3% of non-Amazon retail media spend by 2029. For retailers with significant physical footprints, that 3.3% can translate into meaningful revenue – if they can execute. That’s the qualifier most retailers miss. In-store media requires more capital investment than spinning up on-site digital formats. The sales process is more complex. Organizational alignment between merchants, operations, and media teams is non-negotiable. And the landscape keeps fragmenting. New Acosta Group data shows shoppers are visited 6.6 grocery locations in Q2 2025, up from 5.7 in Q1 2024. That dispersion makes it harder for any single grocer to claim the reach advertisers need, raising the bar even higher for execution. Not every retailer can pull this off, which makes it a defensible advantage for those who can. Sam’s Club has a unique positioning here. As Ma told me in an interview earlier this year, Sam’s stands on its own as both a retail operation and an RMN. But they benefit from learning from their much bigger older brother, Walmart — borrowing tech, testing approaches, and avoiding mistakes that would be expensive to make independently. That learning advantage, combined with 140 million weekly US store visits and a membership model that enables closed-loop measurement, creates conditions most retailers can’t replicate. Getting past pilot purgatory Sam's Club’s willingness to invest early and widely stands in sharp contrast to the industry pattern. According to Grocery Doppio research, 86% of grocers say their print circulars, digital media networks, and in-store media networks remain completely siloed or only partially integrated. About two-thirds of advertisers want connected strategies across retail media, loyalty, and merchant teams, but most retailers haven't figured out the organizational alignment required to deliver it. Sam’s Club moved aggressively to solve this. Their growth team sits within merchandising, reporting to merchant leadership, which forces retail media activations to align with core business objectives rather than operating as a separate profit center. Every JBP conversation now includes questions about how to activate products through media once they’re on the floor. For years, retailers have hyped the potential of in-store retail media. With 91.5% of food and beverage sales still happening in physical stores and advertisers demanding access to those shoppers, the opportunity is attractive. But the projections that in-store retail media will grow to just 1.1% of total retail media spend by 2029 raise an obvious tension: massive transaction volume, but limited advertising scalability. Sam’s Club is showing it can be done – if you have the scale, the membership model that enables deterministic measurement, and the advantage of learning from a larger sibling’s retail media playbook. For retailers without those advantages, the infrastructure investment might not pencil out. In-store media will remain a fraction of retail media spending, but for the right retailers, it’s a fraction worth fighting for.",
    "domain": "thedrum.com",
    "domain_category": "advertising and commercial",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:41.761559+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "thedrum.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.thedrum.com/news/2025/10/20/sams-club-shows-how-store-retail-media-should-really-work",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "0c76b15dcca575a7408ffbe8867a3855",
    "processed_at": "2025-10-20T12:26:31.037433",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.85,
      "topic": "AI Technology and Infrastructure",
      "explanation": "OpenAI: The article discusses Sam's Club's use of AI-driven propensity modeling and measurement systems to optimize in-store retail media, indicating a significant focus on AI applications in retail technology.",
      "keywords": [
        "AI",
        "propensity modeling",
        "computer vision",
        "measurement",
        "automation"
      ]
    }
  },
  {
    "url": "https://www.thedrum.com/open-mic/ais-hidden-environmental-cost-what-marketers-can-do-right-now",
    "title": "AI hidden environmental cost : what marketers can do right now",
    "text": "AI’s hidden environmental cost: what marketers can do right now With marketing embracing the transformational power of AI, important questions around sustainability must be asked. The Brandtech Group’s Lucy Usher and Céline Craipeau explore how marketers harness AI without undermining sustainability goals Within two years, we expect almost every creative project we do here at The Brandtech Group to involve generative AI. The reasons why are clear: AI boosts creativity, makes processes faster, and keeps teams competitive. But while AI is transforming marketing, it’s also raising serious sustainability questions. Gen AI, in particular, has a big energy appetite, and using it comes with an environmental cost that brands can’t ignore. The challenge is this: how can marketers harness AI’s potential without undermining sustainability goals? It’s a question that we’ve been grappling with at Brandtech, alongside our clients and colleagues in the industry. We launched our first environmental impact study earlier this year, alongside a carbon calculator geared to marketing use cases. But we’re still at the early stages of understanding and addressing these issues, and we believe it’s vital to share what we’re learning. This is not about quick fixes or definitive answers – it’s about starting a conversation that the entire marketing industry needs to have. The hidden footprint of AI Every time you use gen AI, whether it’s creating an image, analyzing data, or drafting copy, you’re triggering extensive computations on energy-hungry servers. Many of these servers operate in regions dependent on fossil fuels, compounding the environmental cost. Beyond energy consumption, there are broader impacts: - Mining for rare materials essential to AI infrastructure involves land degradation, pollution, and significant water use. - Data centers contribute to global emissions and strain water resources needed for cooling. - Mining operations can harm local ecosystems and cause health issues among mining communities. As the usage of AI increases, resources are likely to grow more scarce, meaning there’s a chance that brands will face shortages. In addition, stricter environmental regulations are on the horizon, which are likely to demand that companies account for their environmental impact, and potentially even pay for it. Measuring what matters Quantifying AI’s environmental impact is complex but critical. Clients are increasingly asking questions: are certain tools or models more energy-intensive than others? How do AI-enabled campaigns compare to traditional approaches in terms of environmental cost? Is there a way to rate or track the energy consumption of AI tools? Currently, there’s no universal sustainability rating for AI, although some platforms like Hugging Face are working to create standardized benchmarks for energy scoring. This makes direct comparisons very challenging, but marketers can still start by asking their AI providers key questions: Are your servers powered by renewable energy? What’s your carbon footprint? Can you provide reports on your emissions and evidence of where they’ve been reduced? It’s vital to start having these conversations around the sustainable use of AI now, so that we, as an industry, can establish best practices early on. After all, once marketing teams implement AI, it’s very difficult to remove it from the process. Marketers can also take internal steps by auditing their own AI tools. It’s important to know that there are variations in energy usage across different models and operations. In some cases, using a large language model (LLM) would be like using a blowtorch to light a birthday candle – it’s overkill. You might be able to reduce your energy usage simply by switching to a more basic machine learning model, which still does the job. Transparency isn’t optional Marketers increasingly need transparency about the tools they’re using, including the associated environmental trade-offs. A growing number of clients are demanding clear emissions data. One forward-thinking client recently told us: “We’ll need AI-related emissions data included in next year’s reporting.” This level of scrutiny is becoming the norm. By setting clear expectations with providers and partners, brands can help drive accountability across the industry. Transparency isn’t just ethical – it’s a competitive imperative. Stakeholders, from clients to regulators, are prioritizing sustainability, and businesses that lead on these issues will be better positioned to succeed. Striking the balance between innovation and responsibility The real challenge is finding that sweet spot between AI’s benefits and sustainability goals. You don’t need to stop using AI – it’s too valuable – but you can be smarter about how you use it. Make sure that sustainability isn’t an afterthought. As electricity resources get tighter and climate regulations become stricter, companies that optimize their digital consumption now will be in a much stronger position. A responsible-by-design approach isn’t just about minimizing harm; it’s about building resilience. Here’s what you can do now: - Audit your AI tools: start getting to grips with their energy use and environmental impact. - Ask the right questions: make your AI providers aware of your own sustainability goals, and ask them to help you reach those goals. - Educate your team: make sure everyone understands the trade-offs between AI use and sustainable business practices. - Lead the conversation: be open with clients and stakeholders about what you’re doing to balance AI innovation with environmental responsibility. - Carefully evaluate your AI use cases: ensure your use case warrants the deployment of AI tools and systems compared with lower-energy solutions, by using available tools like Brandtech’s carbon calculator. At Brandtech, we’ve long known that AI would revolutionize marketing. But we also know that its environmental implications can’t be ignored. We’re still learning ourselves, but we’re committed to learning out loud. We want to share our findings so that we – creatives, clients, brands, partners – can all learn from each other, and ultimately progress as an industry. The imminent future of marketing will be defined by how well we balance innovation with responsibility. Marketers who embrace this challenge will create a more sustainable, resilient industry. If you’d like to learn more about Brandtech’s sustainability research, you can get our AI environmental impact report and access the carbon calculator here. Lucy Usher is head of sustainability at Oliver, and Céline Craipeau is VP sustainability at Jellyfish, both part of The Brandtech Group.",
    "domain": "thedrum.com",
    "domain_category": "advertising and commercial",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:24:41.894246+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "thedrum.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.thedrum.com/open-mic/ais-hidden-environmental-cost-what-marketers-can-do-right-now",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "429ae3ba57715b3b4b3f030172b50215",
    "processed_at": "2025-10-20T12:26:31.037475",
    "ai_topic_analysis": {
      "is_ai_topic": true,
      "confidence": 0.95,
      "topic": "AI Business and Industry",
      "explanation": "OpenAI: The article discusses the implications of AI in marketing, focusing on its environmental impact and sustainability concerns. It explores how marketers can leverage AI while addressing these challenges, indicating a strong connection to AI applications in business.",
      "keywords": [
        "AI",
        "sustainability",
        "marketing",
        "environmental impact",
        "energy consumption"
      ]
    }
  },
  {
    "url": "https://www.theverge.com/news/802486/aws-outage-alexa-fortnite-snapchat-offline",
    "title": "Major AWS outage takes down Fortnite , Alexa , Snapchat , and more",
    "text": "Amazon Web Services (AWS) is currently experiencing a major outage that has taken down online services, including Amazon, Alexa, Snapchat, Fortnite, ChatGPT, Epic Games Store, Epic Online Services, and more. The AWS status checker is reporting that multiple services are “impacted” by operational issues, and that the company is “investigating increased error rates and latencies for multiple AWS services in the US-EAST-1 Region” — though outages are also impacting services in other regions globally. Major AWS outage takes down Fortnite, Alexa, Snapchat, and more The cause of the AWS outage is currently unclear. The cause of the AWS outage is currently unclear. Users on Reddit are reporting that the Alexa smart assistant is down and unable to respond to queries or complete requests, and in my own experience, I found that routines like pre-set alarms are not functioning. The AWS issue also appears to be impacting platforms running on its cloud network, including Perplexity, Airtable, Canva, and the McDonalds app. The cause of the outage hasn’t been confirmed, and it’s unclear when regular service will be restored. “Perplexity is down right now,” Perplexity CEO Aravind Srinivas said on X. “The root cause is an AWS issue. We’re working on resolving it.” The AWS dashboard first reported issues affecting the US-EAST-1 Region at 3:11AM ET. “We are actively engaged and working to both mitigate the issue and understand root cause. We will provide an update in 45 minutes, or sooner if we have additional information to share,” Amazon said in an update published at 3:51AM ET. In a 5:27AM ET update, Amazon says “We are seeing significant signs of recovery. Most requests should now be succeeding. We continue to work through a backlog of queued requests.” AWS outages in the US-East-1 region have created widespread disruptions in 2023, 2021, and 2020, forcing multiple websites and platforms offline for several hours before regular service was restored.",
    "domain": "theverge.com",
    "domain_category": "digital media and content creation",
    "language": "English",
    "date_publish": "20251020T094500Z",
    "date_download": "2025-10-20T10:26:26.379314+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theverge.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://www.theverge.com/news/802486/aws-outage-alexa-fortnite-snapchat-offline",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "393835549f0fb1fd4cb30b1afa954ae7",
    "processed_at": "2025-10-20T12:26:31.037493",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.9,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses an outage of Amazon Web Services (AWS) and its impact on various online services, including some that utilize AI technology. However, the focus is on the outage itself rather than on artificial intelligence topics.",
      "keywords": [
        "AWS",
        "outage",
        "Alexa",
        "services",
        "ChatGPT"
      ]
    }
  }
]