[
  {
    "url": "https://www.theglobeandmail.com/world/article-britain-england-flag-immigration-unite-kingdom/",
    "title": "Britain new wave of flag fervour linked to tension over immigration",
    "text": "Typically, the British tend to limit enthusiastic displays of their flags to royal, sporting or military occasions. But in recent months, the Union Jack and particularly the cross of St. George – the patron saint of England – have become a common sight up and down the country. Flags have been hoisted onto lampposts on major roads, draped over motorway bridges and placed in shop fronts and windows. In some places, the red cross of St. George has been spray-painted onto white mini-roundabouts or other road markings. The flags have appeared amid rising tension over immigration, and agitation in some quarters about the increased numbers of undocumented migrants arriving across the Channel from France in small boats. In the normally tranquil Essex town of Epping, protests broke out in July outside an hotel for asylum-seekers, after an Ethiopian man was arrested and charged with sexually assaulting a 14-year-old schoolgirl and a woman in the town centre. He was convicted and jailed for a year and will be deported after his sentence. There, and elsewhere in England, for some people the flags represent a positive expression of patriotism in a country struggling for identity. For others, they are an endorsement of hateful or racist anti-immigrant sentiment. Steven Frost, 63, joined the protests in Epping early on and soon became involved in erecting flags in and around the town. The owner of a nationwide construction business, he and his friends usually operate in the early hours, standing on ladders and fixing flags with plastic ties. “What do I think of the flags? It’s amazing. It’s patriotic. Why are you not allowed to fly your own flag?” He added: “I’m not a right-wing idiot, but it’s our country at the end of the day. And I’m not against immigration, but it’s got to be controlled immigration, [for] people who are going to contribute something to the country.” Sunder Katwala, director of the British Future think tank and author of the new book How to Be a Patriot, said there is a shared “sense of being unheard” among many people. Concerns about years of increased immigration are wrapped up with a feeling of national malaise, lack of trust in politics, despair at the rising cost of living and the National Health Service’s operational struggles. “They’ve got grievances, which they would say are legitimate,” he said, including the feeling that people “can’t even express our identity or even be allowed to fly a flag.” Sometimes flags are used in a positive way, such as when red-and-white bunting is strung across high streets on St. George’s Day, or this summer during the European women’s football championship, which England won. But, he added, “when people fly flags to the lampposts, it’s very different to people flying flags from their own houses and cars. It’s perceived by some as saying, ‘This is ours, not yours.’” Bernard Jenkin, a veteran Conservative MP for Harwich and North Essex, thinks that years of postimperial overconfidence had perhaps reduced the need to fly the flag outside of official occasions. “But since our national identity has become so challenged, there is definitely a reaction amongst a section of the population that they want to reassert that national identity, whether it’s British or English,” he said. “Then from the broad left, there’s a reaction against the reaction, that somehow waving a Union Flag or a St. George’s flag is an attempt to intimidate or to deny the legitimacy of citizens of an ethnic origin.” There was, he said, a danger of the far right exploiting the traditional indifference about flying the flag to “assert something that the vast majority of British people don’t believe in, which is some kind of message about racial purity or [being] very strongly anti-immigration.” For older left-wing or progressive campaigners, the abundance of national flags revives uncomfortable memories of the National Front and British National Party, two far-right, anti-foreigner parties that peaked in the 1970s and the early 20th century, respectively. The summer’s flag campaigns started with small local groups of people connecting on social media and quickly took off. Some are spontaneous, while others are organized by more experienced activists with far-right links. The content on the Facebook page of Operation Raise the Colours, perhaps the largest flag-raising group, has been condemned as virulently Islamophobic or racist. Robert Ford, professor of politics at the University of Manchester, said that although the flag-raising movement covered a spectrum ranging from “hard-core racists” to “people who are concerned about immigration,” much of the activity was linked to the far right becoming better organized. “Typically, alienated men weren’t the most socially networked sections of the public, but social media has changed all of that. People who have these very intense feelings about this stuff can find each other and get organized quite easily,” he said.",
    "domain": "theglobeandmail.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251022T090000Z",
    "date_download": "2025-10-22T09:18:30.829681+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theglobeandmail.com",
    "sourcecountry": "Canada",
    "gdelt_id": "https://www.theglobeandmail.com/world/article-britain-england-flag-immigration-unite-kingdom/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "8638a7292cd6de40d1e1ecf754937e74",
    "processed_at": "2025-10-22T11:19:11.989122",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses national identity, immigration, and the display of flags in Britain, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]