[
  {
    "url": "https://deadline.com/2025/10/matt-copson-last-daysagathe-rousselle-mubi-louverture-af-1236599783/",
    "title": "Matt Copson Adapting His Buzzy Opera  Last Day Into Feature Film",
    "text": "EXCLUSIVE: Following successful runs at the Royal Opera House in London and the LA Phil, the buzzy English-language opera Last Days has been adapted for the big screen by artist and filmmaker Matt Copson, who co-created the original opera with Oliver Leith. Inspired by Gus Van Sant’s 2005 film of the same name and financed by Mubi, Spain’s AF Films, and LUMA, with additional support from Nina Pictures and Artemis Rising Foundation, the film is currently in production in Spain. Copson will direct the screen adaptation, with Agathe Rousselle (Titane) signed on to star. Rousselle also starred in the original opera production. Last Days is produced by AF and Many Enterprises and Riccardo Maddalosso, in collaboration with Mubi and Joslyn Barnes’ Louverture Films (Nickel Boys). Mubi has world rights, excluding Spain, on the pic. AF retains all rights in Spain. Last Days dramatizes the final period in the life of a successful but reclusive musician, Blake, played by Rousselle. Blake has just escaped rehab to return home, but the peace of his household is soon disrupted by a series of unwelcome visitors. Adding to the chaos are constant calls from his manager and the presence of a private investigator and a superfan stalking nearby. As the turmoil around him reaches its peak, the ghostly figure of a magician appears, offering him a way out. In the end, Blake is left alone, facing only what remains: himself. Watch on Deadline French cinematographer Claire Mathon, best known for her acclaimed work with Céline Sciamma (Petite Maman, Portrait Of A Lady on Fire), will serve as the Director of Photography. Sound Design will be led by Nicolas Becker (Sound Of Metal), Production Design is by Liam Moore, Nicolas Chaudeurge is the Editor, and Anna Morrisey is the movement director. Costume Design is by Nat Turner. The score by Oliver Leith, original to the opera, features an aria sung by Caroline Polachek. Last Days will mark Copson’s feature directorial debut. The British artist and filmmaker is best known for his work in the worlds of contemporary art and opera. Copson is most widely acclaimed for his theatrical installations, which fuse lasers, sculptures, and sound. He has exhibited internationally at the KW Institute in Berlin, Fondation Louis Vuitton in Paris, Aspen Art Museum, and Serpentine Galleries in London. Copson has also closely collaborated with Polachek, co-directing all her music videos with her since 2019. The 2005 Van Sant film was an experimental and fictionalized account of a Seattle musician’s life and career, reminiscent of those of Kurt Cobain.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251028T113000Z",
    "date_download": "2025-10-28T13:02:20.755298+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/matt-copson-last-daysagathe-rousselle-mubi-louverture-af-1236599783/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "64b3e4813b605fec95f5fba157ef11bb",
    "processed_at": "2025-10-28T14:03:05.405940",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the adaptation of an opera into a feature film, focusing on the creative aspects and production details. There is no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  }
]