[
  {
    "url": "https://variety.com/2025/global/markets-festivals/jaff-future-project-asia-pacific-titles-1236558502/",
    "title": "Indonesia JAFF Future Project Unveils 10 Asia - Pacific Titles",
    "text": "JAFF Market 2025 has unveiled its second edition lineup for the JAFF Future Project, featuring 10 fiction and documentary titles spanning the Asia-Pacific region. The selection showcases a roster of established and emerging filmmakers whose works reflect the region’s evolving narratives and cross-border collaboration potential. Set to run Nov. 29-Dec. 1 at the Jogja Expo Center in Yogyakarta, Indonesia, the initiative is part of the broader 20th-anniversary celebration of the Jogja-Netpac Asian Film Festival (JAFF). The Future Project functions as both a development platform and co-production hub, designed to advance independent works toward completion and distribution. Among the notable names in this year’s lineup are acclaimed Korean director Park Kiyong, who returns to filmmaking with “Ghost Island,” produced by Ho Yuhang. Ho’s own project “The Silent Village” captured two prizes at last year’s Future Project. Indonesian filmmaker Eddie Cahyono follows up his award-winning feature “Siti,” which screened at Telluride, with “My Mother.” Australian director Aaron Wilson, whose films “Canopy” and “Little Tornadoes” played the international festival circuit, presents “Under the Banyan Moon.” Popular on Variety The selection process drew from an open call held Aug. 1-Sept. 1, attracting submissions from across the region. A selection committee comprising filmmaker-comedian Ernest Prakasa, producers Fauzan Zidni and Tia Hasibuan evaluated projects based on storytelling strength, creative vision, feasibility and market readiness. For the second consecutive year, JAFF Future Project has renewed its partnership with the Adelaide Film Festival and Mylab, extending pathways for creative exchange between Asia and Australia. “In this second-year partnership, we continue to open pathways for filmmakers across Asia and Australia to engage in meaningful exchange in sustaining the region’s independent film ecosystem,” said Mat Kesting, chief executive and creative director of the Adelaide Film Festival. Lorna Tee, JAFF Market advisor and Mylab curator, added: “Together with JAFF Market’s commitment to supporting early-stage projects, we are helping build a more connected creative landscape across the Asia-Pacific.” Throughout the three-day market, participating filmmakers will present their works in curated pitching sessions and one-on-one meetings with producers, investors and industry partners. Selected participants will compete for awards totaling more than $74,000 in cash and production support. Cash prizes include the Visinema Awards ($3,000 for two projects) and The United Team of Arts Awards ($6,000 for one project). Production and post-production packages include the Brandlink Awards ($30,000 in equipment facilities for two projects), Kongchak Awards (sound design facility valued at $10,000), White Light Awards (color grading and mastering valued at $15,000) and Prodigihouse Ecosystem Awards (editing and color grading valued at $10,000). “Our selection process goes beyond curating stories,” said Linda Gozali, market director of JAFF Market. “It’s about identifying creators who can inspire new partnerships and push their projects toward realization. Through JAFF Future Project, we see this as a long-term investment in creative infrastructure, one that connects filmmakers to international networks, development labs and co-production partners, ensuring that promising ideas don’t remain on paper but evolve into impactful works.” The initiative’s impact is already visible in its alumni success. “Pangku” (On Your Lap), the directorial debut of Indonesian actor Reza Rahadian, emerged from last year’s Future Project after winning the White Light Post-Production Award. The film was selected for HAF Goes to Cannes at the Marché du Film and earned four major awards at the 2025 Busan International Film Festival. JAFF Market 2025 is powered by Amar Bank. The Jogja-Netpac Asian Film Festival runs Nov. 29-Dec. 6. JAFF FUTURE PROJECT 2025 – FULL PROJECT LINEUP “A Life Full of Holes” (Development) A teenage girl travels abroad to reunite with her mother, a migrant worker, only to discover she has died and left behind a child from a troubled relationship. Country: Indonesia | Director: Loeloe Hendra Komara | Producers: Indra Yudhitya, Dewi Umaya, Loeloe Hendra Komara | Production Company: Onomastika Films “Evil Underground” (Development) Two estranged sisters must overcome their fractured bond to escape shape-shifting entities in the basement of an old trade center after performing a deadly ritual. Country: Indonesia | Director: Adriyanto Dewo | Producers: Perlita Desiani, Tina Arwin | Production Company: Relate Films “Ghost Island” (Development) When her husband disappears during their honeymoon on Jeju Island, an Indonesian woman’s search uncovers parallel Cold War massacres in Korea and Bali. Countries: South Korea, Malaysia, Indonesia | Director: Park Kiyong | Producers: Park Kiyong, Ho Yuhang | Production Company: Paperheart Sdn Bhd “Ibu” (Development) An unfulfilled filmmaker returns from Los Angeles to Yogyakarta after her stepfather’s death, where clashing with her domineering mother forces her to confront the silence in her marriage. Countries: Indonesia, United States | Director: Kanya Iwana | Producer: Zack Rice | Production Company: Feed You Films “Rose Pandanwangi” (Development) A gifted Indonesian soprano returns home in the 1950s to start over, but as her marriage falters and unrest grows, she must choose between family, true love and her musical ambitions. Countries: Indonesia, Philippines | Director: Razka Robby Ertanto | Producers: Razka Robby Ertanto, Kristine de Leon, Chelsea Islan | Production Company: Summerland “To My Dearest, My Dear…” (Development) After his cancer returns, Adam discovers a way to travel through time to meet the daughter he never lived to see, attempting to heal old wounds before time slips away. Country: Indonesia | Director: Netanya Yemima | Producers: Bela Nabila, Bayu Arief | Production Company: Doa Ibu Frameworks “Under the Banyan Moon” (Development) An Australian schoolteacher journeys to Indonesia after ending her engagement, where a reunion with her first love and connection with his enigmatic best friend force her to choose between nostalgia and a new future. Countries: Australia, Indonesia | Director: Aaron Wilson | Producer: Aaron Wilson | Production Company: Left-Handed Productions “Aluk” (Work-in-Progress) An observational documentary traces three generations of a family in Tana Toraja over seven years as they reckon with the loss of their patriarch and their community’s uncertain future amid rapid transformation. Countries: Australia, Indonesia | Director: Chris C.F | Producers: Sam Hewison, Wahyu Al Mardhani | Production Company: Cut By Dog Production “My Mother” (Work-in-Progress) A widow wants to meet her daughter who has been sentenced to death in Saudi Arabia for murdering her employer, but the daughter refuses, having never forgiven her mother for past betrayals. Country: Indonesia | Director: Eddie Cahyono | Producers: Tika Bravani, Eddie Cahyono, Isabelle Glachant | Production Companies: ANP Talenta Media, Memorieslight Pictures, Yasa Buana Film, Knockonwood.inc, Sasha & Co Production “Our Son” (Work-in-Progress) Two childless married couples raise an unexpected son from an illicit affair between the two households, and amidst the chaos of a paternity reveal, the two wives take parenting into their own hands. Country: Indonesia | Director: Luhki Herwanayogi | Producer: Iqbal Mohammad Hamdan | Production Company: Catchlight Pictures",
    "domain": "variety.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251022T101500Z",
    "date_download": "2025-10-22T10:36:26.588084+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "variety.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://variety.com/2025/global/markets-festivals/jaff-future-project-asia-pacific-titles-1236558502/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "1bda7ba9f8a05ef6570e62c65e81e5ed",
    "processed_at": "2025-10-22T12:36:42.838180",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the JAFF Future Project and its lineup of film titles, filmmakers, and the film festival's initiatives, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  }
]