[
  {
    "url": "https://www.bbc.com/news/articles/clyz58n65g3o",
    "title": "Louvre heist creates  terrible image  of France , justice minister says",
    "text": "Louvre heist creates 'terrible image' of France, justice minister says Security measures \"failed\" in preventing a major jewellery heist in the Louvre museum in Paris on Sunday, creating a very negative image of the country, the French justice minister has said. \"People were able to park a furniture hoist in the middle of Paris, get people up it in several minutes to grab priceless jewels and give France a terrible image,\" Gérald Darmanin said. Thieves wielding power tools broke into the world's most-visited museum in broad daylight, stealing eight items described as being of inestimable value, before escaping on scooters. There are fears that unless the thieves are caught quickly, the priceless items - including a diamond and emerald necklace Emperor Napoleon gave to his wife - will be broken up and smuggled out of the country. Darmanin told France Inter radio he was certain police would eventually arrest the thieves. But the head of an organisation specialising in the location and recovery of stolen and looted artworks warned that if the thieves are not caught in the next 24 to 48 hours, the stolen jewellery will likely be \"long gone\". \"There is a race going on right now,\" Chris Marinello, the chief executive of Art Recovery International, told BBC World Service's Newshour programme. Crowns and diadems - which were stolen in the heist - can easily be broken apart and sold in small parts. The thieves \"are not going to keep them intact, they are going to break them up, melt down the valuable metal, recut the valuable stones and hide evidence of their crime,\" Mr Marinello said, adding it would be difficult to sell these jewels intact. The French police \"know that in the next 24 or 48 hours, if these thieves are not caught, those pieces are probably long gone,\" he said. \"They may catch the criminals but they won't recover the jewels.\" French Interior Minister Laurent Nunez said he was aware of \"a great vulnerability\" in museum security in France. A preliminary report by the Court of Auditors (which audits public funds) said a third of the rooms in the Denon wing - where the robbery took place - have no surveillance cameras, French media reported. The heist has sparked an angry political reaction. It was an \"attack on a heritage that we cherish because it is our history,\" the French President Emmanuel Macron said. It was an \"intolerable humiliation for our country,\" the National Rally president Jordan Bardella posted on X, because the jewels are a \"global symbol of our culture.\" This is a \"very painful\" episode for France, said Natalie Goulet, a member of the French Senate's finance committee. \"We are all disappointed and angry,\" she said, and it is \"difficult to understand how it happened so easily.\" Goulet told the BBC that the gallery's alarm was recently broken, and \"we have to wait for the investigation in order to know if the alarm was disactivated.\" She said the cut up jewels would be \"used in a money laundering system.\" \"I don't think we are facing amateurs. This is organised crime and they have absolutely no morals. They don't appreciate jewellery as a piece of history, only as a way to clean their dirty money,\" she added. The theft took place between 09:30 and 09:40 local time on Sunday morning, shortly after the museum opened to visitors. Four masked thieves used a truck equipped with a mechanical lift to gain access to the Galerie d'Apollon (Gallery of Apollo) via a balcony close to the River Seine. Pictures from the scene showed a vehicle-mounted ladder leading up to a first-floor window. Two of the thieves cut through glass panes with a battery-powered disc cutter and entered the museum. They then threatened the guards, who evacuated the building. The thieves smashed the glass display cases and stole the jewels, which collectively contained thousands of diamonds and precious gemstones. The robbery took just seven minutes. As the museum's alarms started blaring, staff followed protocol by contacting security forces, the culture ministry said in a statement. The thieves had tried to set fire to their vehicle outside but were prevented by the intervention of a museum staff-member, it added. Eight items of jewellery were stolen in total, including an emerald and diamond necklace that Napoleon gave his wife, Empress Marie Louise. Also taken was a diadem (jewelled headband) that once belonged to the Empress Eugénie - wife of Napoleon III - which has nearly 2,000 diamonds. They also took a necklace that once belonged to Marie-Amelie, the last queen of France, and which contains eight sapphires and 631 diamonds, according to the Louvre's website. The robbery is a \"dagger into the heart of France\", said Elaine Sciolino, author of Adventures in the Louvre: How to Fall in Love with the World's Greatest Museum. Built as a fortress in the Middle Ages, it was a palace for kings for several centuries before the French Revolution. The Louvre \"represents the history of France,\" she said. Earlier this year, officials at the Louvre requested help from the French government to restore and renovate the museum's ageing exhibition halls and better protect its works of art. At the time, President Macron pledged the Louvre would be redesigned as part of the New Renaissance project - expected to cost between 700 and 800 million euros. The project includes reinforced security.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T080000Z",
    "date_download": "2025-10-20T08:37:00.274978+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/clyz58n65g3o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "278353734d6becd723cffb1105a227e7",
    "processed_at": "2025-10-20T10:37:59.794556",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses a jewelry heist at the Louvre museum and the implications for security and national image, with no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cd67yx3e653o",
    "title": "The  radical  Manchester event that changed Africa forever",
    "text": "The 'radical' Manchester event that changed Africa In October 1945, delegates from across the world descended on a town hall on the outskirts of Manchester city centre to attend a seismic event in African politics, the ripple effects of which still resonate 80 years later. The Fifth Pan-African Congress, held between 15 and 21 October 1945, was a key moment for the movement that liberated many Africans from colonial rule. Among those who attended were Obafemi Awolowo, one of the driving forces of Nigerian independence, feminist and human rights campaigner Amy Ashwood Garvey, Trinidadian radical George Padmore and the future presidents of Malawi, Ghana and Kenya - Hastings Banda, Kwame Nkrumah and Jomo Kenyatta. But it was not, as its name makes clear, the first such gathering, so how did it come to have such significance and why was it held in Chorlton-on-Medlock Town Hall? What is Pan-Africanism? Pan-Africanism is a philosophy which held that all people of African descent should unite to stand against racial injustice, inequality and colonialism in Africa. It began in the mid-19th Century but came to the fore in the early 20th Century, when Trinidadian barrister Henry Sylvester Williams organised the First Pan-African Conference in London in 1909. That event was followed by Pan-African Congresses in 1919, 1921 and 1923, which were held either solely or jointly in Paris, London, Brussels and Lisbon, four cities which had been the seats of European colonial power, before a fourth event in New York in 1927. Each congress ended with a list of resolutions, which were mainly made around the need for more rights for Africans, for the end of British rule and for home rule and a say in the governance of their own countries. Why was Manchester chosen? The Pan-African movement was disrupted by world events in the 1930s and 1940s and did not hold a congress again until after the end of World War Two. Its leading figures were keen to get things going again after that conflict was finally ended with Victory over Japan Day on 15 August 1945. Within two months, delegates were filing into the main chamber at Chorlton-upon-Medlock Town Hall to see the start of the Fifth Pan-African Congress. Its aim was to tackle the post-war struggle against racial discrimination and help its delegates find a path to liberation for those living under what they saw as unjust colonial rule. Harry Eyres, an expert on the congresses who helps with the documenting of black histories as the librarian for the Ahmed Iqbal Ullah RACE Centre and Education Trust, said there were a \"plethora\" of reasons why the city was chosen to host. The main one, he said, was the strength of black communities and their established network of businesses in Manchester. Ras T. Makonnen, for example, owned a number of restaurants, hotels and nightclubs, so people travelling from all over the world had places to stay and eat. He acted as treasurer for the congress and is named on a plaque commemorating the congress on the building where it was held, which is now part of Manchester Metropolitan University. Harry said Makonnen was friends with Padmore, who has been described as \"one of the most influential black political thinkers of the 20th Century\", and the pair were both instrumental in bringing the event to Manchester. Harry's colleague Maya Sharma, the head of the trust, added that in their archives, there was evidence that there had been an \"African and Caribbean presence in Manchester for decades\", long before the arrival of the Windrush generation. She said the Oxford Road area around the town hall had a flourishing black community with businesses such as cafes, restaurants and a bookshop. Who was involved? Many of the delegates at the congress were political heavyweights, activists and vocal supporters of the Pan-African movement. They came from Manchester and the surrounding area, from other parts of Great Britain and more than 25 other countries, the majority of which were still part of the what had become known as the British Commonwealth of Nations. They represented more than 50 organisations and political associations, from the Women's International League for Peace and Freedom to the Communist Party of Great Britain. Alongside Awolowo, Ashwood Garvey, Padmore, Banda, Nkrumah and Kenyatta were the likes of African National Congress activist and writer Peter Abrahams, Sierra Leone People's Party founder Lamina Sankoh, All African Convention founder Davidson Don Tengo Jabavu and Tikiri Banda Subasinghe, who would go on to serve as the Speaker of the Sri Lankan Parliament. There was also at least one delegate who had been there from the start, as the congress chairman was William Edward Burghardt Du Bois, the African American thinker and journalist who had helped to organise the first event in 1919. Why was it so significant? Harry said the congress was unique as the previous ones had involved primarily people of upper classes and of professional backgrounds. In Manchester though, the event catered for a much larger demographic of activists from all over the world as well as also from black communities in the UK and specifically the city itself. He said while its impact was not \"instantaneous\", it \"led to the success of independence movements\" in decades that followed across the British Empire and other colonial strongholds. He said Jomo Kenyatta and Kwame Nkrumah, who would go on to lead homelands of Kenya and Ghana independence, came together to plan the means with which they would eventually achieve that. \"It was a sort of zenith of the movement, the beginning of the struggle after the Second World War,\" he added. Maya said the Manchester event \"raised some very clear demands\" which included an end to colonial rule in Africa and the Caribbean and racial equity for people of African heritage everywhere. \"They also demanded economic justice and fair wages,\" she said. \"I believe these demands are still very relevant today. \"Many African and Caribbean counties are still economically dependent on global superpowers and multinational companies, while here in the UK, black communities experience disparities in policing, education, employment and housing.\" What happened next? The next Pan-African Congress was not held until June 1974, when leaders and thinkers came together in Dar es Salaam in Tanzania. By that point, 19 of the countries which had been the homeland for some of the delegates at the Manchester event had declared independence from the British Empire, joining the two which were already independent states in 1945. In the decade after the Tanzania event, three more were independent. Only Bermuda, which was represented in Manchester by members of its Workers' Association, remains a British Overseas Territory, self-governed by its own parliament under a governor who is appointed by King Charles III. What is its legacy? Harry said the event was \"really radical\" and showed \"significant\" levels of organising and activism which was \"supremely empowering\" but it \"wasn't an \"isolated piece of history\". \"The most profound legacy of the congress is a call to action... encouraging us to build a more equitable, humane and respectful world,\" he said. He said it also inspired people in the years which followed the conference, such as Kath Locke who co-founded the Abasindi Co-operative in 1980, an organisation based in Manchester's Moss Side which was established by and to benefit the black women in the community. He said Makonnen became a \"massive mentor\" in terms of developing Locke's \"political identity\" and she went on to be a \"really significant\" person in the histories of the city's black communities. Maya said the congress \"placed Manchester at the epicentre of global and successful liberation movements\". However, she added that there was a need to celebrate the city's radical history more. \"Apart from one plaque that was very hard fought... where the congress was held, there's nowhere else in the city where you can go and see any kind of physical legacies,\" she said. She added that it was not evident in exhibitions and only occasionally taught in schools. \"Why do we not talk about it in the same breath as the Peterloo massacre when we talk about Manchester's radical histories?\" she said. How is it being commemorated? There are a series of events to mark the 80th anniversary of the congress, including a discussion and networking event at what is now Manchester Metropolitan University's Grosvenor East building where the event took place. The event will explore what liberation, self-realisation and self-determination looks like for communities and how the enduring legacy of the Pan-African Congress can inform collective action and cultural leadership in Manchester. Manchester City Council is hosting a \"deep dive talk\" on 29 October at the Friends' Meeting House by Parise Carmicheal-Murphy along with the Ahmed Iqbal Ullah RACE Centre team to highlight the impact the conference has had on racial equality. The trust will also host a talk at Central Library on 3 November to commemorate the anniversary of the Congress and its enduring relevance. Listen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X, and Instagram. You can also send story ideas via Whatsapp to 0808 100 2230.",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T080000Z",
    "date_download": "2025-10-20T08:37:00.648352+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cd67yx3e653o",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "4759340950662118cf8bf710a3619456",
    "processed_at": "2025-10-20T10:37:59.794617",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the historical significance of the Fifth Pan-African Congress and its impact on African politics and liberation movements, with no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.bbc.com/news/articles/cz0xr0gmzxvo",
    "title": "Chinook crash : Renewed calls for inquiry into 1994 tragedy",
    "text": "Renewed calls for inquiry into 1994 Chinook crash Families of those killed when a Chinook helicopter crashed in Scotland more than 30 years ago are making renewed calls for a public inquiry. The crash on the Mull of Kintyre, which killed 25 intelligence experts and four special forces crew on 2 June 1994, was initially blamed on pilot error, a finding that was overturned in 2011. The Chinook Justice Campaign has now released 110 \"critical questions\" about the tragedy as they prepare to hand in a petition to Downing Street in support of an inquiry, signed by more than 47,000 people. Members have said they will \"see the UK government in court\" after the prime minister rejected calls for a judge-led inquiry. The petition will be handed in to Downing Street on Tuesday, along with a letter the campaign also plans to deliver to the Ministry of Defence. 'Machiavellian cover-up' Niven Phoenix, who's father died in the crash, said 31 years later families had 110 questions but \"zero answers\". He told BBC Radio's Good Morning Scotland programme that campaigners were hopeful of securing a judge-led public inquiry. \"If they don't do this as a public body and exercise duty of candour, what's to prevent it from happening again,\" he added. He said there had been a \"machiavellian cover-up\", and said it was \"unacceptable\" that people involved had been allowed to go unchallenged. Mr Phoenix added that growing up in Northern Ireland during the troubles he \"half expected\" something to happen to his special branch father, but having it happen \"due to the incompetence of senior officers\" in the RAF and MOD \"blindsided\" him. He said: \"That led to this sense of ambiguity to this loss. There is a duty of care expected, and it just wasn't provided. \"My father and his colleagues were all about protection of life and why was that same protection not offered to them?\" Among the 110 questions, the campaign asks who authorised the mission, why that aircraft type was selected, and whether passengers and crew were warned of the risks. David Hill, the campaign's technical expert, said refusal to grant a public inquiry and to seal key documents until 2094, was \"a betrayal by the state\" of both families and victims. He said: \"The prime minister and his defence ministers keep claiming that 'this was a tragic accident' and that there have been 'six inquiries' and that no fresh evidence is likely to emerge in a new judge-led public inquiry. \"This new list of 110 questions explodes that myth. It blows a massive hole in the government's argument because none of these questions have been answered properly.\" He added that the questions sought to assist in establishing why \"25 passengers and four crew were placed in an unairworthy aircraft that the MoD's most experienced test pilots were forbidden to fly.\" The helicopter was en route from RAF Aldergrove in Northern Ireland to Fort George near Inverness when it went down, killing everyone on board. A BBC documentary last year, Chinook: Zulu Delta 576, revealed that files relating to the crash had been sealed by the Ministry of Defence for 100 years. Jenni Balmer-Hornby, whose father Anthony Hornby was killed in the crash, said: \"Every time the Ministry of Defence says there is nothing new to uncover, we can now point to 110 very specific, very serious questions that have never been answered. \"These questions are not speculation – they are based on evidence that was withheld, ignored or misrepresented to previous inquiries.\" She added that the families deserved answers, and that those who \"died serving their country deserve to be honoured not subjected to continuing deception from the MoD\". An MOD spokesperson said: \"We have now received the Chinook Justice Campaign's formal claim for a judicial review of our decision to reject the demand for a judge-led inquiry into the circumstances of the crash. \"Our focus is on responding to that claim and to the allegations contained within it and we are unable to comment further at this time. \"The accident has already been the subject of six inquiries and investigations, including an independent judge-led review.\"",
    "domain": "bbc.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T080000Z",
    "date_download": "2025-10-20T08:37:00.686343+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "bbc.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.bbc.com/news/articles/cz0xr0gmzxvo",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "f4bca9d13e6eec33d2cdbe6bc8562e45",
    "processed_at": "2025-10-20T10:37:59.794700",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 1.0,
      "topic": null,
      "explanation": "OpenAI: The article discusses the renewed calls for an inquiry into a helicopter crash and the associated campaign for justice, with no mention or relevance to artificial intelligence topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/artanddesign/2025/oct/20/turner-winner-ferocious-helen-marten",
    "title": "  Winning the Turner made me more ferociou : Helen Marten on the prize downside – and her epic new work | Art",
    "text": "‘I don’t think I’ve ever worked so hard,” says Helen Marten. “I’ve literally not taken a day off for four months.” The artist is talking about 30 Blizzards, a two-hour opera for which she was commissioned, by Art Basel Paris and the fashion brand Miu Miu, to write the libretto and design the staging. Featuring 30 main characters – named things like The Mother, The Baker, The Asphalt, The Forest – and a chorus collectively called Dust, the whole piece moves from “deepest night through all of these iterations of the day – dawn, afternoon, then back to deepest night”. It will take place in a space 200 metres long, with the audience able to mingle with the performers throughout. It sounds exhausting, but Marten, by her own admission, is “a total workaholic”. During our lengthy chat, she repeatedly darts off to leaf through a file, pull up a video, glance through a book, or play a voice memo – talking all the while. The artist, seated in her London studio, pulls up images of the multiheight set she has designed for the opera and plays rough edits of the five new video works has written and shot. In one, we hear a girl say: “Today, I hopped around my room on one foot and then backwards on the other foot. Do you believe in ghosts, Lupo?” Even in this unfinished state, being shown the work feels a lot like being made tiny and placed – like a figure in a doll’s house – into a Helen Marten installation. Marten is also preparing for a solo exhibition at Sadie Coles HQ, called Treatise of a Coat. This is the first time Marten has shown a large body of her wall-based works. Like nesting dolls, these comprise coloured-pencil drawings, mounted inside highly sculptural protruding frames, themselves mounted on elaborate, multilayered screen prints and framed again. She says the drawings are “very focused, myopic” depictions of moist things: people eating snails, animals licking cakes, lots of mouths. “They’re not surreal, but there is an oddness to them.” Marten, now 39, won the Turner prize when she was 31, making her the second youngest to win the award after Damien Hirst, who was 30. She had been picked for a collection of mesmerising sculptural works, some of which she’d shown the year before at the Venice Biennale. Critics greeted Marten’s victory, not to mention her pioneering political gesture to share with her fellow nominees the £25,000 Turner winnings and the £30,000 from the Hepworth prize she’d won weeks earlier, with both rapture and bewilderment. “Rarely have I been so struck,” wrote one. “The meaning of the work is only known to her,” mused another. Marten felt, as she puts it, “fragmented”. “It was a really manic year,” she says. By the end of it, she felt “so tired and sad from pushing work off into the world, allowing it to go and stand up on its own – and then be completely misinterpreted as ‘an assemblage of found objects’. I labour fiercely on these works. Every move when I make a sculpture, every part of it, means something explicit to me. There’s almost no found object in my work ever. If it looks like a found object, a deliberate mode of approximation and deception has gone into making it look so defiantly real.” These days, she says, she barely thinks about the Turner. It certainly didn’t stop her making work. “If anything,” she says, “it made me more ferocious.” In 2019, Marten decided to write a novel. Being free from the constraints of “gravity, production, shipping, physical making, everything, all of it,” she says, “was just so much fun.” Titled The Boiled in Between, it runs to 321 pages of dense, crisp, utterly confounding prose, and was published in 2020, during lockdown. “This is my proudest moment,” she says, pointing to the blurbs on the back. She cold-called the writers she admired the most. The Nobel prize-winning Austrian author Elfriede Jelinek wrote back: “A cosmos emerges in the work of Helen Marten, we know it and we don’t.” So did American author Helen DeWitt, who said reading Marten’s work produced the same shock Alexander Calder said he had experienced when visiting Mondrian’s studio in 1930: “Like the baby being slapped to make its lungs start working.” Coming back to making after that writing phase was a challenge. “I felt so fraudulent in the studio,” Marten says. She had to relearn that “tactile possessiveness over material” that has always underpinned what she does. Marten grew up with her twin sister in Macclesfield. While her sibling is a naturally numerical person, for her it was always about language. “I was definitely a pale, quiet, strange child,” she says. “I would always collect little bits and pieces and put them into funny taxonomies. I had a toothbrush collection that I, at one point, strung up like little bunting around my bedroom. I had collections of so many strange things. I still do.” She pulls down a portfolio folder from a top shelf, which is bursting with paper bags from shops across Europe. She began to collect them, in earnest, about five years ago, variously pilfering them from fruit stalls or receiving them as donations from like-minded enthusiasts. “The Dutch ones are amazing,” she says. “The Netherlands is really good at paper packaging. The French ones are also very good.” We’ve been speaking for two hours and, throughout, Marten has remained fully focused on the interview, her gaze and tone never wavering. In the background, her desktop email has been pinging incessantly but she’s not complaining: “I absolutely love everything I am allowed to do. I feel so lucky to have the access and the support to do it and to, like, know what I love.”",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T074500Z",
    "date_download": "2025-10-20T08:37:02.899741+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/artanddesign/2025/oct/20/turner-winner-ferocious-helen-marten",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "3b931765a411ac07f99f7f054a2f417d",
    "processed_at": "2025-10-20T10:37:59.795102",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article primarily discusses the work and experiences of artist Helen Marten, focusing on her artistic projects and creative process. There is no mention of artificial intelligence or related topics.",
      "keywords": []
    }
  },
  {
    "url": "https://www.theguardian.com/business/2025/oct/20/b-and-m-finance-chief-warns-on-profits-accounts-blunder",
    "title": "B & M ousts finance chief as it warns again on profits after £7m accounts error",
    "text": "The discount retailer B&M has ousted its finance chief after reporting a £7m accounts blunder that will cut its annual earnings – its second profit warning within two weeks. The company told investors it looking for a successor to Mike Schmidt, who is stepping down as chief financial officer, after the accounting error. The company, which sells things ranging from DIY, electricals and garden products to toys, pet food and everyday essentials, discovered that £7m of overseas freight costs were not “correctly recognised in cost of goods sold,” after an update to its operating system earlier this year. This means that adjusted profits for the year to March 2026 are now expected to be between £470m and £520m, down from its previous estimate of between £510m and £560m. For the first half, B&M expects profits of £191m, down from £198m. Shares in the FTSE 250-listed company slumped by nearly 18% in early trading. They have lost nearly 50% of their value this year. The retailer said Schmidt will remain with the group until a replacement is found. The system issue at the centre of the problem has since been fixed, it said. B&M will commission an external review, and will provide a further update when it releases first-half results on 13 November. One of Britain’s biggest discount retailers, it has been struggling and warned on profits earlier in October. It announced a “back to basics” plan under its new chief executive, Tjeerd Jegen, who took the helm in June. It expects UK sales at stores open for at least a year to either fall, or rise in low single digits, this year. Jegen said in early October that the company had cut prices and was working to refocus its ranges, improve on-shelf availability and “bring back excitement to our stores”. B&M also issued a profit warning in February, and in June blamed sliding sales on more cautious consumer spending, particularly among lower-income shoppers who are its main customers. In a short statement on Monday, B&M said: “The board wishes Mike well for the future.” B&M, founded in 1978, became one of Britain’s most successful retailers during the pandemic, when it was still run by the Arora brothers, Simon and Bobby. They acquired the business from Phildrew Investments in late 2004 when it was an ailing regional chain of 21 stores, and built it into a retail empire in the UK and France. It listed on the London Stock Exchange in 2014. The company has 1,270 stores, mostly in the UK under the B&M, Heron Foods and B&M Express brands. The figure also includes 140 B&M shops in France.",
    "domain": "theguardian.com",
    "domain_category": "journalism, news and media",
    "language": "English",
    "date_publish": "20251020T081500Z",
    "date_download": "2025-10-20T08:37:03.169381+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "theguardian.com",
    "sourcecountry": "United Kingdom",
    "gdelt_id": "https://www.theguardian.com/business/2025/oct/20/b-and-m-finance-chief-warns-on-profits-accounts-blunder",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "755f89d4abbe910c8ccad8c9eb60ef43",
    "processed_at": "2025-10-20T10:37:59.795161",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses a financial issue faced by the retailer B&M, including an accounting error and changes in management. There is no mention of artificial intelligence or related technologies.",
      "keywords": []
    }
  },
  {
    "url": "https://deadline.com/2025/10/game-show-network-100-choices-development-1236591651/",
    "title": "Game Show Network Plans To Make  100 Choice With B17 Entertainment",
    "text": "EXCLUSIVE: Game Show Network has decided on putting 100 Choices into development. The cable channel is working with Extracted and On Brand with Jimmy Fallon producer B17 Entertainment to create a U.S. version of the Japanese comedic family format. Tokyo-based Fany Studio and B17 parent Sony Pictures Television, which has international distribution rights, unveiled the development today. Given that Game Show Network is also a Sony-owned business, the deal is something of a family affair. The show sees a a group of contestants faced with one question and 100 possible answers. If they can answer correctly, they win a large cash prize, but the question is nearly impossible to answer, so the they take on five physical challenges that allows them to eliminate some of the choices based on their performance in each challenge. Watch on Deadline This comes after Sony Pictures Television International Formats pitched the show to international buyers last week as a cornerstone of its unscripted slate. The U.S. studio unveiled the show at the London TV Screenings earlier this year after picking up the rights at the Asia TV Forum, and part of that announcement revealed B17 would represent it in the U.S. “We have enjoyed a tremendous buzz around 100 Choices ever since we unveiled the series at London Screenings and we have had an amazing response from clients at MIPCOM,” said Laura St Clair, SVP, International Formats at SPT. “Fany Studio has created a format with a universality that can be enjoyed by family audiences the world over, and it is fantastic that the brilliant team at B17 Entertainment are developing this for Game Show Network. I can’t wait to see how they adapt and enhance the games for American audiences, and we are very excited to be able to announce further news around 100 Choices very soon.” Fany Studio is behind shows such as comedy quiz Freeze, which has been a major hit in Portugal, and dating format Rea(l)ove, which Turkey’s Global Agency has on the international market. B17, founded back in 2013 by principals Rhett Bachner and Brien Meagher, has credits including The Final Straw for ABC; Blue Ribbon Baking Championship and The History of Swear Words for Netflix; Craftopia, Baketopia and The Book of Queer for HBO Max among others. The recently launched marketing competition show On Brand With Jimmy Fallon, co-produced with Universal Television Alternative Studio, was featured heavily in our MIPCOM cover story interview with late-night host Fallon. Game Show Network is known for the likes of People Puzzler, American Says and Switch, along with Beat The Bridge, which is based on the BBC’s Bridge of Lies; a modern version of Tic Tac Dough; and the Jaleel White-hosted Flip Side.",
    "domain": "deadline.com",
    "domain_category": "film and TV production",
    "language": "English",
    "date_publish": "20251020T081500Z",
    "date_download": "2025-10-20T08:37:48.880943+00:00",
    "authors": [],
    "description": "",
    "image": "",
    "source": "deadline.com",
    "sourcecountry": "United States",
    "gdelt_id": "https://deadline.com/2025/10/game-show-network-100-choices-development-1236591651/",
    "extraction_method": "basic_text_extraction",
    "fetch_source": "gdelt",
    "gdelt_metadata": true,
    "content_hash": "c454ec36ec26106f7071212c1f19dc29",
    "processed_at": "2025-10-20T10:37:59.795867",
    "ai_topic_analysis": {
      "is_ai_topic": false,
      "confidence": 0.95,
      "topic": null,
      "explanation": "OpenAI: The article discusses the development of a game show and related entertainment industry activities, with no mention or discussion of artificial intelligence or related technologies.",
      "keywords": []
    }
  }
]